In [1]:
import time
import json
import openai
import re
import sqlite3
import pandas as pd
import numpy as np

from os import path
from openai.api_requestor import error

In [2]:
def get_schema(db_id):
    PATH = 'spider/database/'
    
    path_to_file   = PATH + db_id + '/schema.sql'
    path_to_file_2 = PATH + db_id + '/' + db_id + '.sqlite'
    
    if path.exists(path_to_file):
        x = open(path_to_file, 'r').read()
        # Remove comment lines
        x = re.sub(r"^/\*.*\n", "", x, flags=re.MULTILINE)
        x = re.sub(r'^--.*(\n|$)', '', x, flags=re.MULTILINE)
        x = re.sub(r"^/\*.*\*/", "", x)
        
        x = re.sub(r'CREATE TABLE \t', 'CREATE TABLE ', x)
        
        arr = x.split(';')
        create_tables = []
        for i, stmt in enumerate(arr):
            stmt = stmt.strip()
            if stmt.lower().startswith('create'):
                create_tables.append(stmt.replace('IF NOT EXISTS ', '').replace('\n', ''))
        return ';'.join(create_tables)
      
    elif path.exists(path_to_file_2):
        # Connect to the sqlite file
        conn = sqlite3.connect(path_to_file_2)

        # Read the schema of the twitter_1.sqlite file into a dataframe
        df_conn = pd.read_sql_query("SELECT sql FROM sqlite_master WHERE type='table';", conn)
        
        # Close the connection
        conn.close()
        
        create_tables = []
        for idx, row in df_conn.iterrows():
            row['sql'] = row['sql'].strip()
            if row['sql'].lower().startswith('create'):
                create_tables.append(row['sql'].replace('IF NOT EXISTS ', '').replace('\n', ''))
        return ';'.join(create_tables)
    
    else: return None

def short_open_ai_prompt(x):
    return f'''Schema: {x['schema']}\nQuestion: {x['question']}\n\n###\n\n'''

# From OpenAI: The completion should start with a whitespace character (` `). 
# This tends to produce better results due to the tokenization we use.
def open_ai_completion(x):
    return f" {x['query']}\n" 

def call_model(row, engine):
    prompt = row["open_ai_prompt"]
    while True:
        try:
            completions = openai.Completion.create(
                engine=engine,
                prompt=prompt,
                max_tokens=1024,
                n=1,
                stop=["\n"],
                temperature=0.5
            )

            print(completions.choices[0].text)
            return completions.choices[0].text
    
        except error.ServiceUnavailableError:
            print('ServiceUnavailableError')
            time.sleep(1)
            continue
            
        except error.InvalidRequestError:
            print('InvalidRequestError: too many tokens')
            time.sleep(1)
            break

# Data Preparation

In [4]:
df = pd.read_json('spider/train_spider.json')
# df = df[~df['query'].str.contains('JOIN')]
# df = df[df['query'].str.count('FROM') <= 1]

# Set schema
df['schema'] = df.apply(lambda x: get_schema(x['db_id']), axis=1)
# Remove REFERENCES sections and NOT NULLs
df['schema'] = df['schema'].apply(lambda x: re.sub('(?i) REFERENCES.*?(;|$)', ';', x)) 
df['schema'] = df['schema'].apply(lambda x: re.sub('NOT NULL', '', x))

# Set Open AI prompt and completion
df['open_ai_prompt'] = df.apply(lambda x: short_open_ai_prompt(x), axis=1)
df['open_ai_completion'] = df.apply(lambda x: open_ai_completion(x), axis=1)

# Randomize at the db level
df_db_id = pd.DataFrame(df['db_id'].unique(), columns=['db_id'])
np.random.seed(240956) #set seed
df_db_id['train_test'] = np.random.choice(['train','test'], df_db_id.shape[0], p=[0.8, 0.2])
df = df.merge(df_db_id, on='db_id')
df_train = df[df['train_test'] == 'train'][['open_ai_prompt', 'open_ai_completion']].copy()
df_test  = df[df['train_test'] == 'test'][['open_ai_prompt', 'open_ai_completion']].copy()

In [5]:
df[df['schema'] == '']['db_id'].unique()

array([], dtype=object)

In [6]:
print(df.iloc[110]['open_ai_prompt'])
print(df.iloc[110]['open_ai_completion'])

Schema: CREATE TABLE station (    id INTEGER PRIMARY KEY,    name TEXT,    lat NUMERIC,    long NUMERIC,    dock_count INTEGER,    city TEXT,    installation_date TEXT);CREATE TABLE status (    station_id INTEGER,    bikes_available INTEGER,    docks_available INTEGER,    time TEXT,    FOREIGN KEY (station_id);CREATE TABLE trip (    id INTEGER PRIMARY KEY,    duration INTEGER,    start_date TEXT,    start_station_name TEXT, -- this should be removed    start_station_id INTEGER,    end_date TEXT,    end_station_name TEXT, -- this should be removed    end_station_id INTEGER,    bike_id INTEGER,    subscription_type TEXT,    zip_code INTEGER);CREATE TABLE weather (    date TEXT,    max_temperature_f INTEGER,    mean_temperature_f INTEGER,    min_temperature_f INTEGER,    max_dew_point_f INTEGER,    mean_dew_point_f INTEGER,    min_dew_point_f INTEGER,    max_humidity INTEGER,    mean_humidity INTEGER,    min_humidity INTEGER,    max_sea_level_pressure_inches NUMERIC,    mean_sea_level_pressure_inches NUMERIC,    min_sea_level_pressure_inches NUMERIC,    max_visibility_miles INTEGER,    mean_visibility_miles INTEGER,    min_visibility_miles INTEGER,    max_wind_Speed_mph INTEGER,    mean_wind_speed_mph INTEGER,    max_gust_speed_mph INTEGER,    precipitation_inches INTEGER,    cloud_cover INTEGER,    events TEXT,    wind_dir_degrees INTEGER,    zip_code INTEGER)
Question: What are the dates with a maximum temperature higher than 85?

###


 SELECT date FROM weather WHERE max_temperature_f  >  85

In [7]:
df_train.shape

(5944, 2)

In [8]:
df_test.shape

(1056, 2)

# Training

In [9]:
# # Put the training data into jsonl format
# data = []
# for idx, row in df_train.iterrows():
#     data.append({"prompt": row["open_ai_prompt"], "completion": row["open_ai_completion"]})

# timestr = time.strftime("%Y%m%d-%H%M%S")
# with open("spider_open_ai_fine_tuning_" + timestr + ".jsonl", "w") as outfile:
#     for obj in data:
#         json.dump(obj, outfile)
#         outfile.write("\n")
        
# print("spider_open_ai_fine_tuning_" + timestr + ".jsonl")

spider_open_ai_fine_tuning_20230126-235556.jsonl

In [10]:
#!openai tools fine_tunes.prepare_data -f spider_open_ai_fine_tuning_20230126-235556.jsonl
# - There are 6 duplicated prompt-completion sets. These are rows: [1296, 2000, 2097, 2984, 2985, 3799]

In [11]:
df_train_dedup = df_train.copy()
df_train_dedup = df_train_dedup.drop(df_train.index[[1296, 2000, 2097, 2984, 2985, 3799]])
df_train_dedup[(df_train_dedup['open_ai_prompt'] == df_train_dedup.iloc[1296]['open_ai_prompt']) |
               (df_train_dedup['open_ai_prompt'] == df_train_dedup.iloc[2000]['open_ai_prompt']) |
               (df_train_dedup['open_ai_prompt'] == df_train_dedup.iloc[2097]['open_ai_prompt']) |
               (df_train_dedup['open_ai_prompt'] == df_train_dedup.iloc[2984]['open_ai_prompt']) |
               (df_train_dedup['open_ai_prompt'] == df_train_dedup.iloc[2985]['open_ai_prompt']) |
               (df_train_dedup['open_ai_prompt'] == df_train_dedup.iloc[3799]['open_ai_prompt'])]

,open_ai_prompt,open_ai_completion
1421,Schema: CREATE TABLE classroom\t(building\t\tv...,SELECT title FROM course WHERE course_id NOT ...
2344,"Schema: CREATE TABLE ""Campuses"" (\t""Id"" INTEGE...",SELECT campus FROM campuses WHERE county = ...
2442,Schema: create table Movie(\tmID int primary k...,SELECT count(*) FROM Reviewer\n
3489,Schema: CREATE TABLE `regions` ( `REGION_ID` ...,SELECT job_id FROM employees GROUP BY job_id ...
3490,Schema: CREATE TABLE `regions` ( `REGION_ID` ...,SELECT job_id FROM employees GROUP BY job_id ...
4405,Schema: CREATE TABLE Person ( name varchar(20...,SELECT count(DISTINCT city) FROM Person\n

In [12]:
# # Put the training data into jsonl format
# data = []
# for idx, row in df_train_dedup.iterrows():
#     data.append({"prompt": row["open_ai_prompt"], "completion": row["open_ai_completion"]})

# timestr = time.strftime("%Y%m%d-%H%M%S")
# with open("spider_open_ai_fine_tuning_" + timestr + ".jsonl", "w") as outfile:
#     for obj in data:
#         json.dump(obj, outfile)
#         outfile.write("\n")
        
# print("spider_open_ai_fine_tuning_" + timestr + ".jsonl")

spider_open_ai_fine_tuning_20230126-235844.jsonl

In [13]:
#!openai tools fine_tunes.prepare_data -f spider_open_ai_fine_tuning_20230126-235844.jsonl

In [14]:
# !openai api fine_tunes.create -t "spider_open_ai_fine_tuning_20230126-235844.jsonl" -m davinci
# [2023-01-27 00:01:35] Created fine-tune: ft-xv8wuk75QTAbYGVPgAC2vHYh
# [2023-01-27 00:05:10] Fine-tune costs $376.19
# [2023-01-27 00:05:17] Fine-tune enqueued. Queue number: 0
# [2023-01-27 00:05:27] Fine-tune started

In [15]:
# !openai api fine_tunes.list

# Out of Sample Testing

In [16]:
# tmp = df_test.copy()

# # tmp['model_response'] = ''
# data = []
# for idx, row in tmp.iterrows():
#     print(idx)
#     if row['model_response'] != '':
#         print('already completed')
#         data.append(row['model_response'])
#         continue
    
#     new_response = call_model(row, engine="davinci:ft-mercator-2023-01-27-10-13-07")
#     data.append(new_response)
#     tmp.loc[idx,'model_response'] = new_response

In [22]:
df_test = pd.read_csv('df_test_davinci_ft-mercator-2023-01-27-10-13-07.csv',index_col=0).fillna('')
df_test

,open_ai_prompt,open_ai_completion,model_response
301,Schema: CREATE TABLE `Attribute_Definitions` (...,SELECT distinct(catalog_entry_name) FROM cata...,SELECT DISTINCT catalog_entry_name FROM catal...
302,Schema: CREATE TABLE `Attribute_Definitions` (...,SELECT distinct(catalog_entry_name) FROM cata...,SELECT DISTINCT catalog_entry_name FROM catal...
303,Schema: CREATE TABLE `Attribute_Definitions` (...,SELECT attribute_data_type FROM Attribute_Def...,SELECT attribute_data_type FROM attribute_def...
304,Schema: CREATE TABLE `Attribute_Definitions` (...,SELECT attribute_data_type FROM Attribute_Def...,SELECT attribute_data_type FROM attribute_def...
305,Schema: CREATE TABLE `Attribute_Definitions` (...,SELECT attribute_data_type FROM Attribute_Def...,SELECT attribute_data_type FROM attribute_def...
...,...,...,...
6880,Schema: CREATE TABLE routes ( rid integer PR...,SELECT T1.name FROM airlines AS T1 JOIN route...,SELECT T1.name FROM airlines AS T1 JOIN route...
6881,Schema: CREATE TABLE routes ( rid integer PR...,SELECT T1.name FROM airports AS T1 JOIN route...,SELECT src_ap FROM routes WHERE rid IN (SELEC...
6882,Schema: CREATE TABLE routes ( rid integer PR...,SELECT T1.name FROM airports AS T1 JOIN route...,SELECT T1.name FROM airports AS T1 JOIN route...
6883,Schema: CREATE TABLE routes ( rid integer PR...,SELECT T1.name FROM airports AS T1 JOIN route...,SELECT T1.dst_ap FROM routes AS T1 JOIN airpo...
6884,Schema: CREATE TABLE routes ( rid integer PR...,SELECT T1.name FROM airports AS T1 JOIN route...,SELECT T1.name FROM airports AS T1 JOIN route...

In [23]:
# ignore: 
# - whitespace
# - capitalization
# - trailing semicolons
# - the difference between single and double quotes
# - difference between 'distinct(...)' and 'distinct ...'
# - explictly stating ASC (the ORDER BY default)
tmp = df_test[df_test['model_response'] != ''].copy()

tmp['correct'] = np.where(tmp['open_ai_completion'].str
                                                                         .strip()
                                                                         .str
                                                                         .lower()
                                                                         .apply(lambda x: re.sub("distinct\((.*)\)", "distinct\\1", 
                                                                                          re.sub('orderby(.*)asc', 'orderby\\1',
                                                                                          re.sub('"', "'",
                                                                                          re.sub('\s+', '', x))))
                                                                                .rstrip(';')) == 
                                     tmp['model_response'].str
                                                                     .strip()
                                                                     .str
                                                                     .lower()
                                                                         .apply(lambda x: re.sub("distinct\((.*)\)", "distinct\\1", 
                                                                                          re.sub('orderby(.*)asc', 'orderby\\1',
                                                                                          re.sub('"', "'",
                                                                                          re.sub('\s+', '', x))))
                                                                            .rstrip(';')), 1, 0)
tmp['correct'].mean()

0.4394250513347023

In [24]:
# 0 leaves off "distinct"
# 10 adds a bad GROUP BY
# 20 - provided answer is bad
# 30 completely wrong
# 40 wrong table
# 50 - right, just reverses join order
# 60 leaves off a join
# 70 leaves off a join
# 80 leaves off a column, adds two joins it doesn't need
# 90 - right, just reverses column and join order
i = 90

print(tmp[tmp['correct'] == 0]['open_ai_prompt'].iloc[i])
print(tmp[tmp['correct'] == 0]['open_ai_completion'].iloc[i])
print(tmp[tmp['correct'] == 0]['model_response'].iloc[i])

Schema: CREATE TABLE "region" ("Region_ID" int,"Region_name" text,"Date" text,"Label" text,"Format" text,"Catalogue" text,PRIMARY KEY ("Region_ID"));CREATE TABLE "party" ("Party_ID" int,"Minister" text,"Took_office" text,"Left_office" text,"Region_ID" int,"Party_name" text,PRIMARY KEY ("Party_ID"),FOREIGN KEY (`Region_ID`);CREATE TABLE "member" ("Member_ID" int,"Member_Name" text,"Party_ID" text,"In_office" text,PRIMARY KEY ("Member_ID"),FOREIGN KEY (`Party_ID`);CREATE TABLE "party_events" ("Event_ID" int,"Event_Name" text,"Party_ID" int,"Member_in_charge_ID" int,PRIMARY KEY ("Event_ID"),FOREIGN KEY (`Party_ID`);
Question: How many members are in each party?

###


 SELECT T2.party_name ,  count(*) FROM Member AS T1 JOIN party AS T2 ON T1.party_id  =  T2.party_id GROUP BY T1.party_id

 SELECT count(*) ,  T2.Party_name FROM party AS T1 JOIN member AS T2 ON T1.Party_ID  =  T2.Party_ID GROUP BY T2.Party_name

In [155]:
df_test

,open_ai_prompt,open_ai_completion,model_response
301,Schema: CREATE TABLE `Attribute_Definitions` (...,SELECT distinct(catalog_entry_name) FROM cata...,SELECT DISTINCT catalog_entry_name FROM catal...
302,Schema: CREATE TABLE `Attribute_Definitions` (...,SELECT distinct(catalog_entry_name) FROM cata...,SELECT DISTINCT catalog_entry_name FROM catal...
303,Schema: CREATE TABLE `Attribute_Definitions` (...,SELECT attribute_data_type FROM Attribute_Def...,SELECT attribute_data_type FROM attribute_def...
304,Schema: CREATE TABLE `Attribute_Definitions` (...,SELECT attribute_data_type FROM Attribute_Def...,SELECT attribute_data_type FROM attribute_def...
305,Schema: CREATE TABLE `Attribute_Definitions` (...,SELECT attribute_data_type FROM Attribute_Def...,SELECT attribute_data_type FROM attribute_def...
...,...,...,...
6880,Schema: CREATE TABLE routes ( rid integer PR...,SELECT T1.name FROM airlines AS T1 JOIN route...,SELECT T1.name FROM airlines AS T1 JOIN route...
6881,Schema: CREATE TABLE routes ( rid integer PR...,SELECT T1.name FROM airports AS T1 JOIN route...,SELECT src_ap FROM routes WHERE rid IN (SELEC...
6882,Schema: CREATE TABLE routes ( rid integer PR...,SELECT T1.name FROM airports AS T1 JOIN route...,SELECT T1.name FROM airports AS T1 JOIN route...
6883,Schema: CREATE TABLE routes ( rid integer PR...,SELECT T1.name FROM airports AS T1 JOIN route...,SELECT T1.dst_ap FROM routes AS T1 JOIN airpo...
6884,Schema: CREATE TABLE routes ( rid integer PR...,SELECT T1.name FROM airports AS T1 JOIN route...,SELECT T1.name FROM airports AS T1 JOIN route...

## How does the multi-table query model perform on single table queries?

In [26]:
# ignore: 
# - whitespace
# - capitalization
# - trailing semicolons
# - the difference between single and double quotes
# - coerce 'distinct(...)' to 'distinct ...'
# - explictly stating ASC, the ORDER BY default
df_test_single = df_test[~df_test['open_ai_completion'].str.contains('JOIN')].copy()
df_test_single = df_test_single[df_test_single['open_ai_completion'].str.count('FROM') <= 1]
df_test_single = df_test_single[df_test_single['model_response'] != '']

df_test_single['correct'] = np.where(df_test_single['open_ai_completion'].str
                                                                         .strip()
                                                                         .str
                                                                         .lower()
                                                                         .apply(lambda x: re.sub("distinct\((.*)\)", "distinct\\1", 
                                                                                          re.sub('orderby(.*)asc', 'orderby\\1',
                                                                                          re.sub('"', "'",
                                                                                          re.sub('\s+', '', x))))
                                                                                .rstrip(';')) == 
                                     df_test_single['model_response'].str
                                                                     .strip()
                                                                     .str
                                                                     .lower()
                                                                         .apply(lambda x: re.sub("distinct\((.*)\)", "distinct\\1", 
                                                                                          re.sub('orderby(.*)asc', 'orderby\\1',
                                                                                          re.sub('"', "'",
                                                                                          re.sub('\s+', '', x))))
                                                                            .rstrip(';')), 1, 0)
df_test_single['correct'].mean()

0.6713709677419355

In [27]:
# 0 leaves off "distinct"
# 10 confuses which column goes in SELECT vs WHERE clause
# 20 wrong table
# 30 wrong table
# 40 sorts by "year" instead of "date" to find "most recent"
# 50 adds a join it doesn't need and sorts by the wrong column
# 60 adds a join it doesn't need
# 70 wrong table, but I'd argue the model gets it right and the provided answer is wrong
# 80 leave off a column, but I'd argue the model gets it right and the provided answer is wrong
# 90 is right, just reverses the column order
i = 90

print(df_test_single[df_test_single['correct'] == 0]['open_ai_prompt'].iloc[i])
print(df_test_single[df_test_single['correct'] == 0]['open_ai_completion'].iloc[i])
print(df_test_single[df_test_single['correct'] == 0]['model_response'].iloc[i])

Schema: create table genre(	g_name varchar2(20) not null,	rating varchar2(10),	most_popular_in varchar2(50),	primary key(g_name));create table artist(	artist_name varchar2(50) not null,	country varchar2(20),	gender varchar2(20),	preferred_genre varchar2(50),	constraint a_name primary key(artist_name),	foreign key(preferred_genre);create table files(	f_id number(10) not null,	artist_name varchar2(50),	file_size varchar2(20),	duration varchar2(20),	formats varchar2(20),	primary key(f_id),	foreign key(artist_name);create table song(	song_name varchar2(50),	artist_name varchar2(50),	country varchar2(20),	f_id number(10),    	genre_is varchar2(20),	rating number(10) check(rating>0 and rating<11),	languages varchar2(20),	releasedate Date, 	resolution number(10) not null,	constraint s_name primary key(song_name),	foreign key(artist_name);
Question: List the names of all genres in alphabetical oder, together with its ratings.

###


 SELECT g_name ,  rating FROM genre ORDER BY g_name

 SELECT rating ,  g_name FROM genre ORDER BY g_name

# How does raw da vinci compare?

In [133]:
def open_ai_prompt(x):
    return f'''
        Convert text to SQL.
        You have the following DDLs:
        ```
        {x['schema']}
        ```
        Write the SQL that answers the following question:
        """{x['question']}"""
        Respond with only one concise SQL statement.
        '''

def call_raw_model(row):
    prompt = row["open_ai_prompt"]

    # parameters chosen to match OpenAI Playground
#     completions = openai.Completion.create(
#         engine="text-davinci-003",
#         prompt=prompt,
#         max_tokens=256,
#         stop=None,
#         temperature=0.7,
#         top_p=1,
#         frequency_penalty=0,
#         presence_penalty=0
#     )
    
    # Duber's parameters
    completions = openai.Completion.create(
        engine="text-davinci-003",
        prompt=prompt,
        temperature=0.3,
        max_tokens=2000,
        best_of=3,
        frequency_penalty=0,
        presence_penalty=0
    )

    print(completions.choices[0].text)
    # raise Exception()
    time.sleep(15)
    return completions.choices[0].text

In [134]:
# df_long = df.loc[df_test.index.to_list()].copy()
# df_long['model_response'] = ''

#Get the long prompt
# df_long['open_ai_prompt'] = df_long.apply(lambda x: open_ai_prompt(x), axis=1)

data = []
for idx, row in df_long.iterrows():
    print(idx)
    if row['model_response'] != '':
        print('already completed')
        data.append(row['model_response'])
        continue
    
    new_response = call_raw_model(row)
    print(row['open_ai_completion'])
    data.append(new_response)
    tmp.loc[idx,'model_response'] = new_response

301
already completed
302
already completed
303
already completed
304
already completed
305
already completed
306
already completed
307
already completed
308
already completed
309
already completed
310
already completed
311
already completed
312
already completed
313
already completed
314
already completed
315
already completed
316
already completed
317
already completed
318
already completed
319
already completed
320
already completed
321
already completed
322
already completed
323
already completed
324
already completed
325
already completed
326
already completed
327
already completed
328
already completed
329
already completed
330
already completed
331
already completed
332
already completed
333
already completed
334
already completed
335
already completed
336
already completed
337
already completed
338
already completed
339
already completed
340
already completed
341
already completed
342
already completed
891
already completed
892
already completed
893
already completed
894
already completed
895
already completed
896
already completed
897
already completed
898
already completed
899
already completed
900
already completed
901
already completed
902
already completed
903
already completed
904
already completed
905
already completed
906
already completed
907
already completed
908
already completed
909
already completed
910
already completed
911
already completed
912
already completed
913
already completed
914
already completed
915
already completed
916
already completed
917
already completed
918
already completed
919
already completed
920
already completed
921
already completed
922
already completed
923
already completed
924
already completed
925
already completed
926
already completed
927
already completed
928
already completed
929
already completed
930

        SELECT Customer_ID FROM Customers ORDER BY Customer_ID;
 SELECT customer_id ,  customer_name FROM customers ORDER BY customer_id ASC

931

        SELECT Date_Opened, Date_Closed FROM Customers_Policies
        INNER JOIN Customers ON Customers_Policies.Customer_ID = Customers.Customer_ID
        WHERE Customer_name LIKE '%Diana%';
 SELECT t2.date_opened ,  t2.date_closed FROM customers AS t1 JOIN customers_policies AS t2 ON t1.customer_id  =  t2.customer_id WHERE t1.customer_name LIKE "%Diana%"

932

        SELECT Date_Opened, Date_Closed
        FROM Customers_Policies
        INNER JOIN Customers
        ON Customers_Policies.Customer_ID = Customers.Customer_ID
        WHERE Customer_name LIKE '%Diana%';
 SELECT t2.date_opened ,  t2.date_closed FROM customers AS t1 JOIN customers_policies AS t2 ON t1.customer_id  =  t2.customer_id WHERE t1.customer_name LIKE "%Diana%"

1110

        SELECT COUNT(*) FROM climber;
 SELECT count(*) FROM climber

1111

        SELECT COUNT(*) FROM climber;
 SELECT count(*) FROM climber

1112

        SELECT Name FROM climber ORDER BY Points DESC;
 SELECT Name FROM climber ORDER BY Points DESC

1113

        SELECT Name FROM climber ORDER BY Points DESC;
 SELECT Name FROM climber ORDER BY Points DESC

1114

        SELECT Name FROM climber WHERE Country != 'Switzerland';
 SELECT Name FROM climber WHERE Country != "Switzerland"

1115

        SELECT Name FROM climber WHERE Country != 'Switzerland';
 SELECT Name FROM climber WHERE Country != "Switzerland"

1116

        SELECT MAX(Points) FROM climber WHERE Country = 'United Kingdom';
 SELECT max(Points) FROM climber WHERE Country  =  "United Kingdom"

1117

        SELECT MAX(Points) FROM climber WHERE Country = 'United Kingdom';
 SELECT max(Points) FROM climber WHERE Country  =  "United Kingdom"

1118

        SELECT COUNT(DISTINCT Country) FROM climber;
 SELECT COUNT(DISTINCT Country) FROM climber

1119

        SELECT COUNT(DISTINCT Country) FROM climber;
 SELECT COUNT(DISTINCT Country) FROM climber

1120

        SELECT Name FROM mountain ORDER BY Name ASC;
 SELECT Name FROM mountain ORDER BY Name ASC

1121

        SELECT Name FROM mountain ORDER BY Name ASC;
 SELECT Name FROM mountain ORDER BY Name ASC

1122

        SELECT Country FROM mountain WHERE Height > 5000;
 SELECT Country FROM mountain WHERE Height  >  5000

1123

        SELECT Country FROM mountain WHERE Height > 5000;
 SELECT Country FROM mountain WHERE Height  >  5000

1124

        SELECT Name FROM mountain ORDER BY Height DESC LIMIT 1;
 SELECT Name FROM mountain ORDER BY Height DESC LIMIT 1

1125

        SELECT Name FROM mountain ORDER BY Height DESC LIMIT 1;
 SELECT Name FROM mountain ORDER BY Height DESC LIMIT 1

1126

        SELECT DISTINCT Range FROM mountain ORDER BY Prominence DESC LIMIT 3;
 SELECT DISTINCT Range FROM mountain ORDER BY Prominence DESC LIMIT 3

1127

        SELECT DISTINCT Range FROM mountain ORDER BY Prominence DESC LIMIT 3;
 SELECT DISTINCT Range FROM mountain ORDER BY Prominence DESC LIMIT 3

1128

        SELECT climber.Name, mountain.Name
        FROM climber
        INNER JOIN mountain
        ON climber.Mountain_ID = mountain.Mountain_ID;
 SELECT T1.Name ,  T2.Name FROM climber AS T1 JOIN mountain AS T2 ON T1.Mountain_ID  =  T2.Mountain_ID

1129

        SELECT climber.Name, mountain.Name
        FROM climber
        INNER JOIN mountain
        ON climber.Mountain_ID = mountain.Mountain_ID;
 SELECT T1.Name ,  T2.Name FROM climber AS T1 JOIN mountain AS T2 ON T1.Mountain_ID  =  T2.Mountain_ID

1130

        SELECT climber.Name, mountain.Height FROM climber INNER JOIN mountain ON climber.Mountain_ID = mountain.Mountain_ID;
 SELECT T1.Name ,  T2.Height FROM climber AS T1 JOIN mountain AS T2 ON T1.Mountain_ID  =  T2.Mountain_ID

1131

        SELECT c.Name, m.Height
        FROM climber c
        INNER JOIN mountain m
        ON c.Mountain_ID = m.Mountain_ID;
 SELECT T1.Name ,  T2.Height FROM climber AS T1 JOIN mountain AS T2 ON T1.Mountain_ID  =  T2.Mountain_ID

1132

        SELECT Height FROM mountain INNER JOIN climber ON mountain.Mountain_ID = climber.Mountain_ID WHERE climber.Points = (SELECT MAX(Points) FROM climber);
 SELECT T2.Height FROM climber AS T1 JOIN mountain AS T2 ON T1.Mountain_ID  =  T2.Mountain_ID ORDER BY T1.Points DESC LIMIT 1

1133

        SELECT Height FROM mountain WHERE Mountain_ID = (SELECT Mountain_ID FROM climber ORDER BY Points DESC LIMIT 1);
 SELECT T2.Height FROM climber AS T1 JOIN mountain AS T2 ON T1.Mountain_ID  =  T2.Mountain_ID ORDER BY T1.Points DESC LIMIT 1

1134

        SELECT DISTINCT Name
        FROM mountain
        INNER JOIN climber
        ON mountain.Mountain_ID = climber.Mountain_ID
        WHERE climber.Country = 'West Germany';
 SELECT DISTINCT T2.Name FROM climber AS T1 JOIN mountain AS T2 ON T1.Mountain_ID  =  T2.Mountain_ID WHERE T1.Country  =  "West Germany"

1135

        SELECT Name FROM mountain WHERE Country = 'West Germany' INNER JOIN climber ON mountain.Mountain_ID = climber.Mountain_ID;
 SELECT DISTINCT T2.Name FROM climber AS T1 JOIN mountain AS T2 ON T1.Mountain_ID  =  T2.Mountain_ID WHERE T1.Country  =  "West Germany"

1136

        SELECT Time FROM climber INNER JOIN mountain ON climber.Mountain_ID = mountain.Mountain_ID WHERE Country = 'Uganda';
 SELECT T1.Time FROM climber AS T1 JOIN mountain AS T2 ON T1.Mountain_ID  =  T2.Mountain_ID WHERE T2.Country  =  "Uganda"

1137

        SELECT Time FROM climber WHERE Country = 'Uganda' AND Mountain_ID IN (SELECT Mountain_ID FROM mountain WHERE Country = 'Uganda');
 SELECT T1.Time FROM climber AS T1 JOIN mountain AS T2 ON T1.Mountain_ID  =  T2.Mountain_ID WHERE T2.Country  =  "Uganda"

1138

        SELECT Country, COUNT(*) AS 'Number of Climbers' FROM climber GROUP BY Country;
 SELECT Country ,  COUNT(*) FROM climber GROUP BY Country

1139

        SELECT Country, COUNT(Climber_ID) AS Num_Climbers FROM climber GROUP BY Country;
 SELECT Country ,  COUNT(*) FROM climber GROUP BY Country

1140

        SELECT Country FROM mountain GROUP BY Country HAVING COUNT(*) > 1;
 SELECT Country FROM mountain GROUP BY Country HAVING COUNT(*)  >  1

1141

        SELECT Country
        FROM mountain
        GROUP BY Country
        HAVING COUNT(*) > 1;
 SELECT Country FROM mountain GROUP BY Country HAVING COUNT(*)  >  1

1142

        SELECT Name FROM mountain WHERE Mountain_ID NOT IN (SELECT Mountain_ID FROM climber);

 SELECT Name FROM mountain WHERE Mountain_ID NOT IN (SELECT Mountain_ID FROM climber)

1143

        SELECT Name FROM mountain WHERE Mountain_ID NOT IN (SELECT Mountain_ID FROM climber);
 SELECT Name FROM mountain WHERE Mountain_ID NOT IN (SELECT Mountain_ID FROM climber)

1144

        SELECT DISTINCT Country
        FROM mountain
        WHERE Height > 5600 OR Height < 5200;
 SELECT Country FROM mountain WHERE Height  >  5600 INTERSECT SELECT Country FROM mountain WHERE Height  <  5200

1145

        SELECT DISTINCT Country
        FROM mountain
        WHERE Height > 5600 OR Height < 5200;
 SELECT Country FROM mountain WHERE Height  >  5600 INTERSECT SELECT Country FROM mountain WHERE Height  <  5200

1146

        SELECT Range, COUNT(*) AS Num_Mountains
        FROM mountain
        GROUP BY Range
        ORDER BY Num_Mountains DESC
        LIMIT 1;
 SELECT Range FROM mountain GROUP BY Range ORDER BY COUNT(*) DESC LIMIT 1

1147

        SELECT Range, COUNT(*) AS Mountain_Count
        FROM mountain
        GROUP BY Range
        ORDER BY Mountain_Count DESC
        LIMIT 1;
 SELECT Range FROM mountain GROUP BY Range ORDER BY COUNT(*) DESC LIMIT 1

1148

        SELECT Name FROM mountain WHERE Height > 5000 OR Prominence > 1000;
 SELECT Name FROM mountain WHERE Height  >  5000 OR Prominence  >  1000

1149

        SELECT Name FROM mountain WHERE Height > 5000 OR Prominence > 1000;
 SELECT Name FROM mountain WHERE Height  >  5000 OR Prominence  >  1000

1689

        SELECT i_id FROM item WHERE title = 'orange';
 SELECT i_id FROM item WHERE title  =  "orange"

1690

        SELECT * FROM item;
 SELECT * FROM item

1691

        SELECT COUNT(*) FROM review;
 SELECT count(*) FROM review

1692

        SELECT COUNT(*) FROM useracct;
 SELECT count(*) FROM useracct

1693

        SELECT AVG(rating), MAX(rating) FROM review;
 SELECT avg(rating) ,  max(rating) FROM review

1694

        SELECT MAX(rank) FROM review;
 SELECT min(rank) FROM review

1695

        SELECT COUNT(DISTINCT u_id) FROM review;
 SELECT count(DISTINCT u_id) FROM review

1696

        SELECT COUNT(DISTINCT i_id) FROM review;
 SELECT count(DISTINCT i_id) FROM review

1697

        SELECT COUNT(*) FROM item WHERE i_id NOT IN (SELECT i_id FROM review);
 SELECT count(*) FROM item WHERE i_id NOT IN (SELECT i_id FROM review)

1698

        SELECT name FROM useracct WHERE u_id NOT IN (SELECT u_id FROM review);
 SELECT name FROM useracct WHERE u_id NOT IN (SELECT u_id FROM review)

1699

        SELECT title FROM item
        INNER JOIN review ON item.i_id = review.i_id
        WHERE rating = 10;
 SELECT T1.title FROM item AS T1 JOIN review AS T2 ON T1.i_id  =  T2.i_id WHERE T2.rating  =  10

1700

        SELECT title FROM item WHERE i_id IN (SELECT i_id FROM review WHERE rating > (SELECT AVG(rating) FROM review));
 SELECT T1.title FROM item AS T1 JOIN review AS T2 ON T1.i_id  =  T2.i_id WHERE T2.rating  >  (SELECT avg(rating) FROM review)

1701

        SELECT title FROM item INNER JOIN review ON item.i_id = review.i_id WHERE rating < 5;
 SELECT T1.title FROM item AS T1 JOIN review AS T2 ON T1.i_id  =  T2.i_id WHERE T2.rating  <  5

1702

        SELECT title FROM item
        INNER JOIN review ON item.i_id = review.i_id
        WHERE rating > 8 AND rating < 5;
 SELECT T1.title FROM item AS T1 JOIN review AS T2 ON T1.i_id  =  T2.i_id WHERE T2.rating  >  8 INTERSECT SELECT T1.title FROM item AS T1 JOIN review AS T2 ON T1.i_id  =  T2.i_id WHERE T2.rating  <  5

1703

        SELECT title
        FROM item
        INNER JOIN review ON item.i_id = review.i_id
        WHERE rank > 3 AND AVG(rating) > 5;
 SELECT T1.title FROM item AS T1 JOIN review AS T2 ON T1.i_id  =  T2.i_id WHERE T2.rank  >  3 INTERSECT SELECT T1.title FROM item AS T1 JOIN review AS T2 ON T1.i_id  =  T2.i_id GROUP BY T2.i_id HAVING avg(T2.rating)  >  5

1704

        SELECT title FROM item WHERE i_id = (SELECT i_id FROM review ORDER BY AVG(rating) ASC LIMIT 1);
 SELECT T1.title FROM item AS T1 JOIN review AS T2 ON T1.i_id  =  T2.i_id GROUP BY T2.i_id ORDER BY avg(T2.rating) LIMIT 1

1705

        SELECT title FROM item ORDER BY title ASC;
 SELECT title FROM item ORDER BY title

1706

        SELECT name
        FROM useracct
        INNER JOIN review
        ON useracct.u_id = review.u_id
        GROUP BY useracct.u_id
        ORDER BY COUNT(review.u_id) DESC
        LIMIT 1;
 SELECT T1.name FROM useracct AS T1 JOIN review AS T2 ON T1.u_id  =  T2.u_id GROUP BY T2.u_id ORDER BY count(*) DESC LIMIT 1

1707

        SELECT title, i_id FROM item WHERE i_id = (SELECT i_id FROM review GROUP BY i_id ORDER BY AVG(rating) DESC LIMIT 1);
 SELECT T1.title ,  T1.i_id FROM item AS T1 JOIN review AS T2 ON T1.i_id  =  T2.i_id GROUP BY T2.i_id ORDER BY avg(T2.rating) DESC LIMIT 1

1708

        SELECT item.title, item.i_id
        FROM item
        INNER JOIN review
        ON item.i_id = review.i_id
        GROUP BY item.i_id
        ORDER BY AVG(review.rank) DESC
        LIMIT 1;
 SELECT T1.title ,  T1.i_id FROM item AS T1 JOIN review AS T2 ON T1.i_id  =  T2.i_id GROUP BY T2.i_id ORDER BY avg(T2.rank) DESC LIMIT 1

1709

        SELECT useracct.name, AVG(review.rating)
        FROM useracct
        INNER JOIN review
        ON useracct.u_id = review.u_id
        GROUP BY useracct.name;
 SELECT T1.name ,  avg(T2.rating) FROM useracct AS T1 JOIN review AS T2 ON T1.u_id  =  T2.u_id GROUP BY T2.u_id

1710

        SELECT useracct.name, COUNT(review.u_id) AS num_reviews
        FROM useracct
        LEFT JOIN review ON useracct.u_id = review.u_id
        GROUP BY useracct.name;
 SELECT T1.name ,  count(*) FROM useracct AS T1 JOIN review AS T2 ON T1.u_id  =  T2.u_id GROUP BY T2.u_id

1711

        SELECT name
        FROM useracct
        INNER JOIN review
        ON useracct.u_id = review.u_id
        INNER JOIN item
        ON review.i_id = item.i_id
        WHERE review.rating = (SELECT MAX(rating) FROM review)
 SELECT T1.name FROM useracct AS T1 JOIN review AS T2 ON T1.u_id  =  T2.u_id ORDER BY T2.rating DESC LIMIT 1

1712

        SELECT name
        FROM useracct
        WHERE u_id = (SELECT source_u_id
                      FROM trust
                      GROUP BY source_u_id
                      ORDER BY AVG(trust) DESC
                      LIMIT 1);
 SELECT T1.name FROM useracct AS T1 JOIN trust AS T2 ON T1.u_id  =  T2.source_u_id GROUP BY T2.source_u_id ORDER BY avg(trust) DESC LIMIT 1

1713

        SELECT useracct.name, AVG(trust.trust)
        FROM useracct
        INNER JOIN trust ON useracct.u_id = trust.target_u_id
        GROUP BY useracct.name;
 SELECT T1.name ,  avg(trust) FROM useracct AS T1 JOIN trust AS T2 ON T1.u_id  =  T2.target_u_id GROUP BY T2.target_u_id

1714

        SELECT useracct.name
        FROM trust
        JOIN useracct
        ON trust.target_u_id = useracct.u_id
        ORDER BY trust.trust ASC
        LIMIT 1;
 SELECT T1.name FROM useracct AS T1 JOIN trust AS T2 ON T1.u_id  =  T2.target_u_id ORDER BY trust LIMIT 1

1715

        SELECT title
        FROM item
        WHERE i_id NOT IN (SELECT i_id FROM review);
 SELECT title FROM item WHERE i_id NOT IN (SELECT i_id FROM review)

1716

        SELECT name FROM useracct WHERE u_id NOT IN (SELECT u_id FROM review);
 SELECT name FROM useracct WHERE u_id NOT IN (SELECT u_id FROM review)

1717

        SELECT COUNT(*) FROM useracct WHERE u_id NOT IN (SELECT u_id FROM review);
 SELECT count(*) FROM useracct WHERE u_id NOT IN (SELECT u_id FROM review)

1718

        SELECT COUNT(*) FROM item WHERE i_id NOT IN (SELECT i_id FROM review);
 SELECT count(*) FROM item WHERE i_id NOT IN (SELECT i_id FROM review)

1719

        SELECT COUNT(*) FROM player;
 SELECT count(*) FROM player

1720

        SELECT Player_name FROM player ORDER BY Votes ASC;
 SELECT Player_name FROM player ORDER BY Votes ASC

1721

        SELECT Gender, Occupation FROM player;
 SELECT Gender ,  Occupation FROM player

1722

        SELECT Player_name, Residence FROM player WHERE Occupation != 'Researcher';
 SELECT Player_name ,  residence FROM player WHERE Occupation != "Researcher"

1723

        SELECT Sponsor_name FROM player WHERE Residence IN ('Brandon', 'Birtle');

 SELECT Sponsor_name FROM player WHERE Residence  =  "Brandon" OR Residence  =  "Birtle"

1724

        SELECT Player_name
        FROM player
        ORDER BY Votes DESC
        LIMIT 1;
 SELECT Player_name FROM player ORDER BY Votes DESC LIMIT 1

1725

        SELECT Occupation, COUNT(*) AS 'Number of Players' FROM player GROUP BY Occupation;
 SELECT Occupation ,  COUNT(*) FROM player GROUP BY Occupation

1726

        SELECT Occupation, COUNT(Occupation) AS Occurrence
        FROM player
        GROUP BY Occupation
        ORDER BY Occurrence DESC
        LIMIT 1;
 SELECT Occupation FROM player GROUP BY Occupation ORDER BY COUNT(*) DESC LIMIT 1

1727

        SELECT Residence
        FROM player
        GROUP BY Residence
        HAVING COUNT(*) >= 2;
 SELECT Residence FROM player GROUP BY Residence HAVING COUNT(*)  >=  2

1728

        SELECT player.Player_name, coach.Coach_name
        FROM player
        INNER JOIN player_coach ON player.Player_ID = player_coach.Player_ID
        INNER JOIN coach ON player_coach.Coach_ID = coach.Coach_ID;
 SELECT T3.Player_name ,  T2.coach_name FROM player_coach AS T1 JOIN coach AS T2 ON T1.Coach_ID  =  T2.Coach_ID JOIN player AS T3 ON T1.Player_ID  =  T3.Player_ID

1729

        SELECT Player_name
        FROM player
        INNER JOIN player_coach
        ON player.Player_ID = player_coach.Player_ID
        INNER JOIN coach
        ON player_coach.Coach_ID = coach.Coach_ID
        WHERE coach.Rank = 1;
 SELECT T3.Player_name FROM player_coach AS T1 JOIN coach AS T2 ON T1.Coach_ID  =  T2.Coach_ID JOIN player AS T3 ON T1.Player_ID  =  T3.Player_ID WHERE T2.Rank  =  1

1730

        SELECT Player_name, Gender FROM player JOIN player_coach ON player.Player_ID = player_coach.Player_ID JOIN coach ON player_coach.Coach_ID = coach.Coach_ID WHERE Starting_year > 2011;
 SELECT T3.Player_name ,  T3.gender FROM player_coach AS T1 JOIN coach AS T2 ON T1.Coach_ID  =  T2.Coach_ID JOIN player AS T3 ON T1.Player_ID  =  T3.Player_ID WHERE T1.Starting_year  >  2011

1731

        SELECT Player_name, Coach_name
        FROM player
        JOIN player_coach ON player.Player_ID = player_coach.Player_ID
        JOIN coach ON player_coach.Coach_ID = coach.Coach_ID
        ORDER BY Votes DESC;
 SELECT T3.Player_name ,  T2.coach_name FROM player_coach AS T1 JOIN coach AS T2 ON T1.Coach_ID  =  T2.Coach_ID JOIN player AS T3 ON T1.Player_ID  =  T3.Player_ID ORDER BY T3.Votes DESC

1732

        SELECT Player_name
        FROM player
        WHERE Player_ID NOT IN (SELECT Player_ID FROM player_coach);
 SELECT Player_name FROM player WHERE Player_ID NOT IN (SELECT Player_ID FROM player_coach)

1733

        SELECT DISTINCT Residence
        FROM player
        WHERE Gender IN ('M', 'F')
        GROUP BY Residence
        HAVING COUNT(DISTINCT Gender) = 2;
 SELECT Residence FROM player WHERE gender  =  "M" INTERSECT SELECT Residence FROM player WHERE gender  =  "F"

1734

        SELECT c.Club_ID, c.Club_name, COUNT(pc.Coach_ID) AS num_coaches
        FROM club c
        LEFT JOIN player_coach pc ON c.Club_ID = pc.Club_ID
        GROUP BY c.Club_ID, c.Club_name;
 SELECT T1.club_id ,  T1.club_name, count(*) FROM club AS T1 JOIN coach AS T2 ON T1.club_id  =  T2.club_id GROUP BY T1.club_id

1735

        SELECT MAX(Gold)
        FROM match_result
        INNER JOIN club
        ON match_result.Club_ID = club.Club_ID
        INNER JOIN coach
        ON club.Club_ID = coach.Club_ID;
 SELECT T1.club_id ,  T1.gold FROM match_result AS T1 JOIN coach AS T2 ON T1.club_id  =  T2.club_id GROUP BY T1.club_id ORDER BY count(*) DESC LIMIT 1

2039

        SELECT COUNT(*) FROM region;
 SELECT count(*) FROM region

2040

        SELECT COUNT(*) FROM region;
 SELECT count(*) FROM region

2041

        SELECT DISTINCT Region_name FROM region ORDER BY Label;
 SELECT DISTINCT region_name FROM region ORDER BY Label

2042

        SELECT Region_name FROM region ORDER BY Label;
 SELECT DISTINCT region_name FROM region ORDER BY Label

2043

        SELECT COUNT(*) FROM party;
 SELECT count(DISTINCT party_name) FROM party

2044

        SELECT COUNT(DISTINCT Party_name) FROM party;
 SELECT count(DISTINCT party_name) FROM party

2045

        SELECT Minister, Took_office, Left_office FROM party ORDER BY Left_office;
 SELECT minister ,  took_office ,  left_office FROM party ORDER BY left_office

2046

        SELECT Minister, Took_office, Left_office FROM party ORDER BY Left_office;
 SELECT minister ,  took_office ,  left_office FROM party ORDER BY left_office

2047

        SELECT Minister
        FROM party
        WHERE Took_office > '1961' OR Took_office < '1959';
 SELECT minister FROM party WHERE took_office  >  1961 OR took_office  <  1959

2048

        SELECT Minister FROM party WHERE Took_office > '1961' OR Took_office < '1959';
 SELECT minister FROM party WHERE took_office  >  1961 OR took_office  <  1959

2049

        SELECT Minister FROM party WHERE Party_name != 'Progress Party';
 SELECT minister FROM party WHERE party_name != 'Progress Party'

2050

        SELECT Minister
        FROM party
        WHERE Party_name != 'Progress Party';
 SELECT minister FROM party WHERE party_name != 'Progress Party'

2051

        SELECT Minister, Party_name, Took_office FROM party JOIN region ON party.Region_ID = region.Region_ID ORDER BY Took_office DESC;
 SELECT minister ,  party_name FROM party ORDER BY took_office DESC

2052

        SELECT Minister, Party_name FROM party JOIN region ON party.Region_ID = region.Region_ID ORDER BY Took_office DESC;
 SELECT minister ,  party_name FROM party ORDER BY took_office DESC

2053

        SELECT Minister
        FROM party
        ORDER BY Left_office DESC
        LIMIT 1;
 SELECT minister FROM party ORDER BY left_office DESC LIMIT 1

2054

        SELECT Minister
        FROM party
        ORDER BY Left_office DESC
        LIMIT 1;
 SELECT minister FROM party ORDER BY left_office DESC LIMIT 1

2055

        SELECT Member_Name, Party_name
        FROM member
        INNER JOIN party
        ON member.Party_ID = party.Party_ID;
 SELECT T1.member_name ,  T2.party_name FROM Member AS T1 JOIN party AS T2 ON T1.party_id  =  T2.party_id

2056

        SELECT Member_Name, Party_name
        FROM member
        INNER JOIN party
        ON member.Party_ID = party.Party_ID;
 SELECT T1.member_name ,  T2.party_name FROM Member AS T1 JOIN party AS T2 ON T1.party_id  =  T2.party_id

2057

        SELECT Party_name, COUNT(Member_ID) AS 'Number of Members' FROM party LEFT JOIN member ON party.Party_ID = member.Party_ID GROUP BY Party_name;
 SELECT T2.party_name ,  count(*) FROM Member AS T1 JOIN party AS T2 ON T1.party_id  =  T2.party_id GROUP BY T1.party_id

2058

        SELECT Party_name, COUNT(Member_ID) AS Member_Count FROM party LEFT JOIN member ON party.Party_ID = member.Party_ID GROUP BY Party_name;
 SELECT T2.party_name ,  count(*) FROM Member AS T1 JOIN party AS T2 ON T1.party_id  =  T2.party_id GROUP BY T1.party_id

2059

        SELECT Party_name
        FROM party
        INNER JOIN member
        ON party.Party_ID = member.Party_ID
        GROUP BY Party_name
        ORDER BY COUNT(*) DESC
        LIMIT 1;
 SELECT T2.party_name FROM Member AS T1 JOIN party AS T2 ON T1.party_id  =  T2.party_id GROUP BY T1.party_id ORDER BY count(*) DESC LIMIT 1

2060

        SELECT Party_name, COUNT(Member_ID) AS Member_Count
        FROM party
        INNER JOIN member
        ON party.Party_ID = member.Party_ID
        GROUP BY Party_name
        ORDER BY Member_Count DESC
        LIMIT 1;
 SELECT T2.party_name FROM Member AS T1 JOIN party AS T2 ON T1.party_id  =  T2.party_id GROUP BY T1.party_id ORDER BY count(*) DESC LIMIT 1

2061

        SELECT p.Party_name, r.Region_name
        FROM party p
        JOIN region r
        ON p.Region_ID = r.Region_ID;
 SELECT T1.party_name ,  T2.region_name FROM party AS T1 JOIN region AS T2 ON T1.region_id  =  T2.region_id

2062

        SELECT Party_name, Region_name
        FROM party
        INNER JOIN region
        ON party.Region_ID = region.Region_ID;
 SELECT T1.party_name ,  T2.region_name FROM party AS T1 JOIN region AS T2 ON T1.region_id  =  T2.region_id

2063

        SELECT Party_name FROM party LEFT JOIN member ON party.Party_ID = member.Party_ID WHERE Member_Name IS NULL;
 SELECT party_name FROM party WHERE party_id NOT IN (SELECT party_id FROM Member)

2064

        SELECT Party_name FROM party LEFT JOIN member ON party.Party_ID = member.Party_ID WHERE Member_Name IS NULL;
 SELECT party_name FROM party WHERE party_id NOT IN (SELECT party_id FROM Member)

2065

        SELECT Member_Name
        FROM member
        WHERE Party_ID IN (1, 3);
 SELECT member_name FROM member WHERE party_id  =  3 INTERSECT SELECT member_name FROM member WHERE party_id  =  1

2066

        SELECT Member_Name
        FROM member
        WHERE Member_ID IN (SELECT Member_ID FROM member WHERE Party_ID = 3)
        AND Member_ID IN (SELECT Member_ID FROM member WHERE Party_ID = 1);
 SELECT member_name FROM member WHERE party_id  =  3 INTERSECT SELECT member_name FROM member WHERE party_id  =  1

2067

        SELECT Member_Name FROM member WHERE Party_ID NOT IN (SELECT Party_ID FROM party WHERE Party_name = 'Progress Party');
 SELECT T1.member_name FROM Member AS T1 JOIN party AS T2 ON T1.party_id  =  T2.party_id WHERE T2.Party_name != "Progress Party"

2068

        SELECT Member_Name FROM member WHERE Member_ID NOT IN (SELECT Member_in_charge_ID FROM party_events WHERE Party_ID IN (SELECT Party_ID FROM party WHERE Party_name = 'Progress Party'));
 SELECT T1.member_name FROM Member AS T1 JOIN party AS T2 ON T1.party_id  =  T2.party_id WHERE T2.Party_name != "Progress Party"

2069

        SELECT COUNT(*) FROM party_events;
 SELECT count(*) FROM party_events

2070

        SELECT COUNT(*) FROM party_events;
 SELECT count(*) FROM party_events

2071

        SELECT Party_name, COUNT(Event_ID) AS 'Number of Events' FROM party LEFT JOIN party_events ON party.Party_ID = party_events.Party_ID GROUP BY Party_name;
 SELECT T2.party_name ,  count(*) FROM party_events AS T1 JOIN party AS T2 ON T1.party_id  =  T2.party_id GROUP BY T1.party_id

2072

        SELECT COUNT(Event_ID) AS Event_Count, Party_ID FROM party_events GROUP BY Party_ID;
 SELECT T2.party_name ,  count(*) FROM party_events AS T1 JOIN party AS T2 ON T1.party_id  =  T2.party_id GROUP BY T1.party_id

2073

        SELECT Member_Name FROM member WHERE Member_ID NOT IN (SELECT Member_in_charge_ID FROM party_events);
 SELECT member_name FROM member EXCEPT SELECT T1.member_name FROM member AS T1 JOIN party_events AS T2 ON T1.member_id  =  T2.member_in_charge_id

2074

        SELECT Member_Name
        FROM member
        WHERE Member_ID NOT IN (SELECT Member_in_charge_ID FROM party_events);
 SELECT member_name FROM member EXCEPT SELECT T1.member_name FROM member AS T1 JOIN party_events AS T2 ON T1.member_id  =  T2.member_in_charge_id

2075

        SELECT Party_name
        FROM party
        INNER JOIN party_events
        ON party.Party_ID = party_events.Party_ID
        GROUP BY Party_name
        HAVING COUNT(Event_ID) >= 2;
 SELECT T2.party_name FROM party_events AS T1 JOIN party AS T2 ON T1.party_id  =  T2.party_id GROUP BY T1.party_id HAVING count(*)  >=  2

2076

        SELECT Party_name
        FROM party
        WHERE Party_ID IN (SELECT Party_ID
                           FROM party_events
                           GROUP BY Party_ID
                           HAVING COUNT(*) >= 2);
 SELECT T2.party_name FROM party_events AS T1 JOIN party AS T2 ON T1.party_id  =  T2.party_id GROUP BY T1.party_id HAVING count(*)  >=  2

2077

        SELECT Member_Name
        FROM member
        WHERE Member_ID = (SELECT Member_in_charge_ID
                           FROM party_events
                           GROUP BY Member_in_charge_ID
                           ORDER BY COUNT(*) DESC
                           LIMIT 1);
 SELECT T1.member_name FROM member AS T1 JOIN party_events AS T2 ON T1.member_id  =  T2.member_in_charge_id GROUP BY T2.member_in_charge_id ORDER BY count(*) DESC LIMIT 1

2078

        SELECT Member_Name
        FROM member
        INNER JOIN party_events
        ON member.Member_ID = party_events.Member_in_charge_ID
        GROUP BY Member_Name
        ORDER BY COUNT(*) DESC
        LIMIT 1;
 SELECT T1.member_name FROM member AS T1 JOIN party_events AS T2 ON T1.member_id  =  T2.member_in_charge_id GROUP BY T2.member_in_charge_id ORDER BY count(*) DESC LIMIT 1

2079

        SELECT Event_Name
        FROM party_events
        GROUP BY Event_Name
        HAVING COUNT(*) > 2;
 SELECT event_name FROM party_events GROUP BY event_name HAVING count(*)  >  2

2080

        SELECT Event_Name
        FROM party_events
        GROUP BY Event_Name
        HAVING COUNT(*) > 2;
 SELECT event_name FROM party_events GROUP BY event_name HAVING count(*)  >  2

2081

        SELECT COUNT(*) FROM region r
        JOIN party p ON r.Region_ID = p.Region_ID
        JOIN party_events pe ON p.Party_ID = pe.Party_ID
        WHERE r.Region_name = 'United Kingdom' AND pe.Event_Name = 'Annual Meeting';
 SELECT count(*) FROM region AS t1 JOIN party AS t2 ON t1.region_id  =  t2.region_id JOIN party_events AS t3 ON t2.party_id  =  t3.party_id WHERE t1.region_name  =  "United Kingdom" AND t3.Event_Name  =  "Annaual Meeting"

2082

        SELECT COUNT(*) FROM region r
        INNER JOIN party p ON r.Region_ID = p.Region_ID
        INNER JOIN party_events pe ON p.Party_ID = pe.Party_ID
        WHERE r.Region_name = 'United Kingdom' AND pe.Event_Name = 'Annual Meeting';
 SELECT count(*) FROM region AS t1 JOIN party AS t2 ON t1.region_id  =  t2.region_id JOIN party_events AS t3 ON t2.party_id  =  t3.party_id WHERE t1.region_name  =  "United Kingdom" AND t3.Event_Name  =  "Annaual Meeting"

2131

        SELECT Dname
        FROM department
        ORDER BY Mgr_start_date;
 SELECT dname FROM department ORDER BY mgr_start_date

2132

        SELECT Dependent_name FROM dependent WHERE Relationship = 'Spouse';
 SELECT Dependent_name FROM dependent WHERE relationship  =  'Spouse'

2133

        SELECT COUNT(*) FROM dependent WHERE Sex = 'Female';
 SELECT count(*) FROM dependent WHERE sex  =  'F'

2134

        SELECT Dname FROM department JOIN dept_locations ON department.Dnumber = dept_locations.Dnumber WHERE Dlocation = 'Houston';
 SELECT t1.dname FROM department AS t1 JOIN dept_locations AS t2 ON t1.dnumber  =  t2.dnumber WHERE t2.dlocation  =  'Houston'

2135

        SELECT Fname, Lname FROM employee WHERE Salary > 30000;
 SELECT fname ,  lname FROM employee WHERE salary  >  30000

2136

        SELECT Sex, COUNT(*)
        FROM employee
        WHERE Salary < 50000
        GROUP BY Sex;
 SELECT count(*) ,  sex FROM employee WHERE salary  <  50000 GROUP BY sex

2137

        SELECT Fname, Minit, Lname, Address
        FROM employee
        ORDER BY Bdate ASC;
 SELECT fname ,  lname ,  address FROM employee ORDER BY Bdate

2153

        SELECT name FROM races ORDER BY date DESC LIMIT 1;
 SELECT name FROM races ORDER BY date DESC LIMIT 1

2154

        SELECT name FROM races ORDER BY date DESC LIMIT 1;
 SELECT name FROM races ORDER BY date DESC LIMIT 1

2155

        SELECT name, date FROM races ORDER BY year DESC LIMIT 1;
 SELECT name ,  date FROM races ORDER BY date DESC LIMIT 1

2156

        SELECT name, date FROM races ORDER BY date DESC LIMIT 1;
 SELECT name ,  date FROM races ORDER BY date DESC LIMIT 1

2157

        SELECT name FROM races WHERE year = 2017;
 SELECT name FROM races WHERE YEAR = 2017

2158

        SELECT name FROM races WHERE year = 2017;
 SELECT name FROM races WHERE YEAR = 2017

2159

        SELECT DISTINCT name FROM races WHERE year BETWEEN 2014 AND 2017;
 SELECT DISTINCT name FROM races WHERE YEAR BETWEEN 2014 AND 2017

2160

        SELECT DISTINCT name FROM races WHERE year BETWEEN 2014 AND 2017;
 SELECT DISTINCT name FROM races WHERE YEAR BETWEEN 2014 AND 2017

2161

        SELECT DISTINCT forename, surname
        FROM drivers d
        INNER JOIN lapTimes l
        ON d.driverId = l.driverId
        WHERE l.milliseconds < 93000;
 SELECT DISTINCT T1.forename ,  T1.surname FROM drivers AS T1 JOIN laptimes AS T2 ON T1.driverid = T2.driverid WHERE T2.milliseconds < 93000

2162

        SELECT DISTINCT forename, surname
        FROM drivers
        INNER JOIN lapTimes
        ON drivers.driverId = lapTimes.driverId
        WHERE lapTimes.milliseconds < 93000;

 SELECT DISTINCT T1.forename ,  T1.surname FROM drivers AS T1 JOIN laptimes AS T2 ON T1.driverid = T2.driverid WHERE T2.milliseconds < 93000

2163

        SELECT DISTINCT driverId, nationality FROM drivers INNER JOIN lapTimes ON drivers.driverId = lapTimes.driverId WHERE milliseconds > 100000;
 SELECT DISTINCT T1.driverid ,  T1.nationality FROM drivers AS T1 JOIN laptimes AS T2 ON T1.driverid = T2.driverid WHERE T2.milliseconds >  100000

2164

        SELECT driverId, nationality FROM drivers INNER JOIN lapTimes ON drivers.driverId = lapTimes.driverId WHERE lapTimes.milliseconds > 100000;
 SELECT DISTINCT T1.driverid ,  T1.nationality FROM drivers AS T1 JOIN laptimes AS T2 ON T1.driverid = T2.driverid WHERE T2.milliseconds >  100000

2165

        SELECT forename, surname FROM drivers INNER JOIN lapTimes ON drivers.driverId = lapTimes.driverId WHERE lapTimes.milliseconds = (SELECT MIN(milliseconds) FROM lapTimes);
 SELECT T1.forename ,  T1.surname FROM drivers AS T1 JOIN laptimes AS T2 ON T1.driverid = T2.driverid ORDER BY T2.milliseconds LIMIT 1

2166

        SELECT forename, surname FROM drivers JOIN lapTimes ON drivers.driverId = lapTimes.driverId WHERE lapTimes.milliseconds = (SELECT MIN(milliseconds) FROM lapTimes);
 SELECT T1.forename ,  T1.surname FROM drivers AS T1 JOIN laptimes AS T2 ON T1.driverid = T2.driverid ORDER BY T2.milliseconds LIMIT 1

2167

        SELECT driverId, surname FROM drivers INNER JOIN lapTimes ON drivers.driverId = lapTimes.driverId WHERE lapTimes.milliseconds = (SELECT MAX(milliseconds) FROM lapTimes);
 SELECT T1.driverid ,  T1.surname FROM drivers AS T1 JOIN laptimes AS T2 ON T1.driverid = T2.driverid ORDER BY T2.milliseconds DESC LIMIT 1

2168

        SELECT driverId, surname FROM drivers INNER JOIN lapTimes ON drivers.driverId = lapTimes.driverId ORDER BY milliseconds DESC LIMIT 1;
 SELECT T1.driverid ,  T1.surname FROM drivers AS T1 JOIN laptimes AS T2 ON T1.driverid = T2.driverid ORDER BY T2.milliseconds DESC LIMIT 1

2169

        SELECT driverId, forename, surname
        FROM lapTimes
        INNER JOIN drivers
        ON lapTimes.driverId = drivers.driverId
        WHERE position = 1
        GROUP BY driverId
        HAVING COUNT(*) >= 2;
 SELECT T1.driverid ,  T1.forename ,  T1.surname FROM drivers AS T1 JOIN laptimes AS T2 ON T1.driverid = T2.driverid WHERE POSITION  =  '1' GROUP BY T1.driverid HAVING count(*)  >=  2

2170

        SELECT driverId, forename, surname
        FROM drivers
        INNER JOIN lapTimes
        ON drivers.driverId = lapTimes.driverId
        WHERE position = 1
        GROUP BY driverId
        HAVING COUNT(*) >= 2;
 SELECT T1.driverid ,  T1.forename ,  T1.surname FROM drivers AS T1 JOIN laptimes AS T2 ON T1.driverid = T2.driverid WHERE POSITION  =  '1' GROUP BY T1.driverid HAVING count(*)  >=  2

2171

        SELECT COUNT(DISTINCT driverId)
        FROM results
        INNER JOIN races
        ON results.raceId = races.raceId
        WHERE races.name = 'Australian Grand Prix'
        AND races.year = 2009;
 SELECT count(*) FROM results AS T1 JOIN races AS T2 ON T1.raceid = T2.raceid WHERE T2.name = "Australian Grand Prix" AND YEAR = 2009

2172

        SELECT COUNT(*) FROM drivers d
        INNER JOIN results r ON d.driverId = r.driverId
        INNER JOIN races ra ON r.raceId = ra.raceId
        WHERE ra.name = 'Australian Grand Prix' AND ra.year = 2009;
 SELECT count(*) FROM results AS T1 JOIN races AS T2 ON T1.raceid = T2.raceid WHERE T2.name = "Australian Grand Prix" AND YEAR = 2009

2173

        SELECT COUNT(*)
        FROM drivers
        WHERE driverId NOT IN (SELECT driverId FROM results WHERE raceId IN (SELECT raceId FROM races WHERE year = 2009));
 SELECT count(DISTINCT driverId) FROM results WHERE raceId NOT IN( SELECT raceId FROM races WHERE YEAR != 2009 )

2174

        SELECT COUNT(*) FROM drivers WHERE driverId NOT IN (SELECT driverId FROM results WHERE raceId IN (SELECT raceId FROM races WHERE year = 2009))
 SELECT count(DISTINCT driverId) FROM results WHERE raceId NOT IN( SELECT raceId FROM races WHERE YEAR != 2009 )

2175

        SELECT name, year FROM races INNER JOIN drivers ON races.circuitId = drivers.driverId WHERE forename = 'Lewis';
 SELECT T2.name ,  T2.year FROM results AS T1 JOIN races AS T2 ON T1.raceid = T2.raceid JOIN drivers AS T3 ON T1.driverid = T3.driverid WHERE T3.forename = "Lewis"

2176

        SELECT races.name, races.year
        FROM races
        INNER JOIN drivers ON races.raceId = drivers.driverId
        WHERE drivers.surname = 'Lewis';
 SELECT T2.name ,  T2.year FROM results AS T1 JOIN races AS T2 ON T1.raceid = T2.raceid JOIN drivers AS T3 ON T1.driverid = T3.driverid WHERE T3.forename = "Lewis"

2177

        SELECT forename, surname FROM drivers WHERE nationality = 'German';
 SELECT forename ,  surname FROM drivers WHERE nationality = "German"

2178

        SELECT forename, surname FROM drivers WHERE nationality = 'German';
 SELECT forename ,  surname FROM drivers WHERE nationality = "German"

2179

        SELECT driverId, forename FROM drivers
        INNER JOIN results ON drivers.driverId = results.driverId
        INNER JOIN races ON results.raceId = races.raceId
        WHERE races.name IN ('Australian Grand Prix', 'Chinese Grand Prix');
 SELECT T2.driverid ,  T3.forename FROM races AS T1 JOIN results AS T2 ON T1.raceid = T2.raceid JOIN drivers AS T3 ON T2.driverid  =  T3.driverid WHERE T1.name = "Australian Grand Prix" INTERSECT SELECT T2.driverid ,  T3.forename FROM races AS T1 JOIN results AS T2 ON T1.raceid = T2.raceid JOIN drivers AS T3 ON T2.driverid  =  T3.driverid WHERE T1.name = "Chinese Grand Prix"

2180

        SELECT driverId, forename FROM drivers
        INNER JOIN results ON drivers.driverId = results.driverId
        INNER JOIN races ON results.raceId = races.raceId
        WHERE races.name = 'Australian Grand Prix' OR races.name = 'Chinese Grand Prix';
 SELECT T2.driverid ,  T3.forename FROM races AS T1 JOIN results AS T2 ON T1.raceid = T2.raceid JOIN drivers AS T3 ON T2.driverid  =  T3.driverid WHERE T1.name = "Australian Grand Prix" INTERSECT SELECT T2.driverid ,  T3.forename FROM races AS T1 JOIN results AS T2 ON T1.raceid = T2.raceid JOIN drivers AS T3 ON T2.driverid  =  T3.driverid WHERE T1.name = "Chinese Grand Prix"

2181

        SELECT forename, surname
        FROM drivers
        INNER JOIN results ON drivers.driverId = results.driverId
        INNER JOIN races ON results.raceId = races.raceId
        WHERE races.name = 'Australian Grand Prix'
        AND driverId NOT IN (SELECT driverId
                             FROM results
                             INNER JOIN races ON results.raceId = races.raceId
                             WHERE races.name = 'Chinese Grand Prix');
 SELECT T3.forename ,  T3.surname FROM races AS T1 JOIN results AS T2 ON T1.raceid = T2.raceid JOIN drivers AS T3 ON T2.driverid = T3.driverid WHERE T1.name = "Australian Grand Prix" EXCEPT SELECT T3.forename ,  T3.surname FROM races AS T1 JOIN results AS T2 ON T1.raceid = T2.raceid JOIN drivers AS T3 ON T2.driverid = T3.driverid WHERE T1.name = "Chinese Grand Prix"

2182

        SELECT forename, surname
        FROM drivers
        WHERE driverId IN (SELECT driverId FROM results WHERE raceId IN (SELECT raceId FROM races WHERE name = 'Australian Grand Prix'))
        AND driverId NOT IN (SELECT driverId FROM results WHERE raceId IN (SELECT raceId FROM races WHERE name = 'Chinese Grand Prix'));
 SELECT T3.forename ,  T3.surname FROM races AS T1 JOIN results AS T2 ON T1.raceid = T2.raceid JOIN drivers AS T3 ON T2.driverid = T3.driverid WHERE T1.name = "Australian Grand Prix" EXCEPT SELECT T3.forename ,  T3.surname FROM races AS T1 JOIN results AS T2 ON T1.raceid = T2.raceid JOIN drivers AS T3 ON T2.driverid = T3.driverid WHERE T1.name = "Chinese Grand Prix"

2183

        SELECT DISTINCT forename FROM drivers JOIN driverStandings ON drivers.driverId = driverStandings.driverId WHERE position = 1 AND wins > 0;
 SELECT DISTINCT T1.forename FROM drivers AS T1 JOIN driverstandings AS T2 ON T1.driverid = T2.driverid WHERE T2.position = 1 AND T2.wins = 1

2184

        SELECT DISTINCT forename FROM drivers INNER JOIN driverStandings ON drivers.driverId = driverStandings.driverId WHERE position = 1 AND wins > 0;

 SELECT DISTINCT T1.forename FROM drivers AS T1 JOIN driverstandings AS T2 ON T1.driverid = T2.driverid WHERE T2.position = 1 AND T2.wins = 1

2185

        SELECT DISTINCT forename
        FROM drivers
        INNER JOIN driverStandings
        ON drivers.driverId = driverStandings.driverId
        WHERE driverStandings.position = 1
        AND driverStandings.points > 20;
 SELECT DISTINCT T1.forename FROM drivers AS T1 JOIN driverstandings AS T2 ON T1.driverid = T2.driverid WHERE T2.position = 1 AND T2.wins = 1 AND T2.points > 20

2186

        SELECT forename FROM drivers
        INNER JOIN driverStandings ON drivers.driverId = driverStandings.driverId
        WHERE driverStandings.position = 1 AND driverStandings.points > 20;
 SELECT DISTINCT T1.forename FROM drivers AS T1 JOIN driverstandings AS T2 ON T1.driverid = T2.driverid WHERE T2.position = 1 AND T2.wins = 1 AND T2.points > 20

2187

        SELECT nationality, COUNT(*) AS 'Number of Constructors' FROM constructors GROUP BY nationality;
 SELECT count(*) ,  nationality FROM constructors GROUP BY nationality

2188

        SELECT nationality, COUNT(DISTINCT constructorId) AS num_constructors FROM constructors GROUP BY nationality;
 SELECT count(*) ,  nationality FROM constructors GROUP BY nationality

2189

        SELECT C.constructorId, COUNT(R.raceId)
        FROM constructors C
        LEFT JOIN constructorResults R
        ON C.constructorId = R.constructorId
        GROUP BY C.constructorId;
 SELECT count(*) ,  constructorid FROM constructorStandings GROUP BY constructorid

2190

        SELECT COUNT(DISTINCT raceId) FROM constructorResults WHERE constructorId = ?;
 SELECT count(*) ,  constructorid FROM constructorStandings GROUP BY constructorid

2191

        SELECT r.name
        FROM races r
        INNER JOIN circuits c
        ON r.circuitId = c.circuitId
        WHERE r.year > 2017
        AND c.country = 'Spain';
 SELECT T1.name FROM races AS T1 JOIN circuits AS T2 ON T1.circuitid = T2.circuitid WHERE T2.country = "Spain" AND T1.year > 2017

2192

        SELECT name FROM races
        INNER JOIN circuits ON races.circuitId = circuits.circuitId
        WHERE year > 2017 AND country = 'Spain';
 SELECT T1.name FROM races AS T1 JOIN circuits AS T2 ON T1.circuitid = T2.circuitid WHERE T2.country = "Spain" AND T1.year > 2017

2193

        SELECT DISTINCT name
        FROM races
        INNER JOIN circuits
        ON races.circuitId = circuits.circuitId
        WHERE year > 2000
        AND country = 'Spain';
 SELECT DISTINCT T1.name FROM races AS T1 JOIN circuits AS T2 ON T1.circuitid = T2.circuitid WHERE T2.country = "Spain" AND T1.year > 2000

2194

        SELECT name FROM races WHERE year > 2000 AND country = 'Spain';
 SELECT DISTINCT T1.name FROM races AS T1 JOIN circuits AS T2 ON T1.circuitid = T2.circuitid WHERE T2.country = "Spain" AND T1.year > 2000

2195

        SELECT DISTINCT driverId, stop FROM pitStops WHERE raceId = 841 AND duration < (SELECT duration FROM pitStops WHERE raceId = 841);
 SELECT DISTINCT driverid ,  STOP FROM pitstops WHERE duration  <  (SELECT max(duration) FROM pitstops WHERE raceid  =  841)

2196

        SELECT driverId, stop FROM pitStops WHERE raceId = 841 AND duration < (SELECT duration FROM pitStops WHERE raceId = 841);
 SELECT DISTINCT driverid ,  STOP FROM pitstops WHERE duration  <  (SELECT max(duration) FROM pitstops WHERE raceid  =  841)

2197

        SELECT DISTINCT driverId FROM pitStops WHERE raceId = 841 AND duration > (SELECT duration FROM pitStops WHERE raceId = 841);
 SELECT DISTINCT driverid ,  STOP FROM pitstops WHERE duration  >  (SELECT min(duration) FROM pitstops WHERE raceid  =  841)

2198

        SELECT driverId, stop, duration FROM pitStops WHERE raceId = 841 AND duration > (SELECT duration FROM pitStops WHERE raceId = 841);
 SELECT DISTINCT driverid ,  STOP FROM pitstops WHERE duration  >  (SELECT min(duration) FROM pitstops WHERE raceid  =  841)

2199

        SELECT DISTINCT forename FROM drivers ORDER BY forename ASC;
 SELECT DISTINCT forename FROM drivers ORDER BY forename ASC

2200

        SELECT DISTINCT forename FROM drivers ORDER BY forename ASC;
 SELECT DISTINCT forename FROM drivers ORDER BY forename ASC

2201

        SELECT DISTINCT name FROM races ORDER BY name DESC;
 SELECT DISTINCT name FROM races ORDER BY name DESC

2202

        SELECT name FROM races ORDER BY name DESC;
 SELECT DISTINCT name FROM races ORDER BY name DESC

2203

        SELECT name FROM races WHERE year BETWEEN 2009 AND 2011;
 SELECT name FROM races WHERE YEAR BETWEEN 2009 AND 2011

2204

        SELECT name FROM races WHERE year BETWEEN 2009 AND 2011;
 SELECT name FROM races WHERE YEAR BETWEEN 2009 AND 2011

2205

        SELECT name FROM races WHERE time > '12:00:00' OR time < '09:00:00';
 SELECT name FROM races WHERE TIME > "12:00:00" OR TIME < "09:00:00"

2206

        SELECT name FROM races WHERE time > '12:00:00' OR time < '09:00:00';
 SELECT name FROM races WHERE TIME > "12:00:00" OR TIME < "09:00:00"

2207

        SELECT driverId, forename, surname
        FROM drivers
        WHERE driverId IN (SELECT driverId
                           FROM (SELECT driverId, COUNT(*) AS pitStops
                                 FROM pitStops
                                 GROUP BY driverId
                                 HAVING pitStops > 8)
                           UNION
                           SELECT driverId
                           FROM (SELECT driverId, COUNT(*) AS raceResults
                                 FROM results
                                 GROUP BY driverId
                                 HAVING raceResults > 5))
 SELECT T1.forename ,  T1.surname ,  T1.driverid FROM drivers AS T1 JOIN pitstops AS T2 ON T1.driverid  =  T2.driverid GROUP BY T1.driverid HAVING count(*)  >  8 UNION SELECT T1.forename ,  T1.surname ,  T1.driverid FROM drivers AS T1 JOIN results AS T2 ON T1.driverid  =  T2.driverid GROUP BY T1.driverid HAVING count(*)  >  5

2208

        SELECT forename, surname, driverId FROM drivers WHERE driverId IN (SELECT driverId FROM pitStops GROUP BY driverId HAVING COUNT(*) > 8) OR driverId IN (SELECT driverId FROM races GROUP BY driverId HAVING COUNT(*) > 5);
 SELECT T1.forename ,  T1.surname ,  T1.driverid FROM drivers AS T1 JOIN pitstops AS T2 ON T1.driverid  =  T2.driverid GROUP BY T1.driverid HAVING count(*)  >  8 UNION SELECT T1.forename ,  T1.surname ,  T1.driverid FROM drivers AS T1 JOIN results AS T2 ON T1.driverid  =  T2.driverid GROUP BY T1.driverid HAVING count(*)  >  5

2209

        SELECT driverId, surname FROM drivers JOIN pitStops ON drivers.driverId = pitStops.driverId JOIN results ON drivers.driverId = results.driverId WHERE pitStops.stop = 11 AND results.positionOrder > 5;
 SELECT T1.surname ,  T1.driverid FROM drivers AS T1 JOIN pitstops AS T2 ON T1.driverid  =  T2.driverid GROUP BY T1.driverid HAVING count(*)  =  11 INTERSECT SELECT T1.surname ,  T1.driverid FROM drivers AS T1 JOIN results AS T2 ON T1.driverid  =  T2.driverid GROUP BY T1.driverid HAVING count(*)  >  5

2210

        SELECT surname, driverId FROM drivers INNER JOIN pitStops ON drivers.driverId = pitStops.driverId INNER JOIN races ON pitStops.raceId = races.raceId WHERE pitStops.stop = 11 GROUP BY driverId HAVING COUNT(*) > 5;
 SELECT T1.surname ,  T1.driverid FROM drivers AS T1 JOIN pitstops AS T2 ON T1.driverid  =  T2.driverid GROUP BY T1.driverid HAVING count(*)  =  11 INTERSECT SELECT T1.surname ,  T1.driverid FROM drivers AS T1 JOIN results AS T2 ON T1.driverid  =  T2.driverid GROUP BY T1.driverid HAVING count(*)  >  5

2211

        SELECT driverId, surname FROM drivers INNER JOIN results ON drivers.driverId = results.driverId INNER JOIN races ON results.raceId = races.raceId WHERE races.year > 2010 GROUP BY driverId ORDER BY COUNT(*) DESC LIMIT 1;
 SELECT T1.driverid ,  T1.surname FROM drivers AS T1 JOIN results AS T2 ON T1.driverid  =  T2.driverid JOIN races AS T3 ON T2.raceid = T3.raceid WHERE T3.year > 2010 GROUP BY T1.driverid ORDER BY count(*) DESC LIMIT 1

2212

        SELECT driverId, surname FROM drivers
        INNER JOIN results ON drivers.driverId = results.driverId
        INNER JOIN races ON results.raceId = races.raceId
        WHERE races.year > 2010
        GROUP BY driverId
        ORDER BY COUNT(*) DESC
        LIMIT 1;

 SELECT T1.driverid ,  T1.surname FROM drivers AS T1 JOIN results AS T2 ON T1.driverid  =  T2.driverid JOIN races AS T3 ON T2.raceid = T3.raceid WHERE T3.year > 2010 GROUP BY T1.driverid ORDER BY count(*) DESC LIMIT 1

2213

        SELECT name FROM circuits WHERE country IN ('UK', 'Malaysia');
 SELECT name FROM circuits WHERE country = "UK" OR country = "Malaysia"

2214

        SELECT name FROM circuits WHERE country IN ('UK', 'Malaysia');
 SELECT name FROM circuits WHERE country = "UK" OR country = "Malaysia"

2215

        SELECT circuitId, location FROM circuits WHERE country IN ('France', 'Belgium');
 SELECT circuitid ,  LOCATION FROM circuits WHERE country = "France" OR country = "Belgium"

2216

        SELECT circuitId, location FROM circuits WHERE country IN ('France', 'Belgium');
 SELECT circuitid ,  LOCATION FROM circuits WHERE country = "France" OR country = "Belgium"

2217

        SELECT name
        FROM constructors
        INNER JOIN constructorResults
        ON constructors.constructorId = constructorResults.constructorId
        WHERE nationality = 'Japanese'
        AND points > 5;
 SELECT T1.name FROM constructors AS T1 JOIN constructorstandings AS T2 ON T1.constructorid = T2.constructorid WHERE T1.nationality = "Japanese" AND T2.points > 5

2218

        SELECT name FROM constructors WHERE nationality = 'Japanese' AND points > 5;
 SELECT T1.name FROM constructors AS T1 JOIN constructorstandings AS T2 ON T1.constructorid = T2.constructorid WHERE T1.nationality = "Japanese" AND T2.points > 5

2219

        SELECT AVG(fastestLapSpeed)
        FROM results
        JOIN races ON results.raceId = races.raceId
        WHERE races.name = 'Monaco Grand Prix'
        AND races.year = 2008;
 SELECT avg(T2.fastestlapspeed) FROM races AS T1 JOIN results AS T2 ON T1.raceid = T2.raceid WHERE T1.year = 2008 AND T1.name = "Monaco Grand Prix"

2220

        SELECT AVG(fastestLapSpeed)
        FROM results
        INNER JOIN races ON results.raceId = races.raceId
        WHERE races.name = 'Monaco Grand Prix' AND races.year = 2008;
 SELECT avg(T2.fastestlapspeed) FROM races AS T1 JOIN results AS T2 ON T1.raceid = T2.raceid WHERE T1.year = 2008 AND T1.name = "Monaco Grand Prix"

2221

        SELECT MAX(fastestLapSpeed)
        FROM results
        INNER JOIN races
        ON results.raceId = races.raceId
        WHERE races.name = 'Monaco Grand Prix'
        AND races.year = 2008;
 SELECT max(T2.fastestlapspeed) FROM races AS T1 JOIN results AS T2 ON T1.raceid = T2.raceid WHERE T1.year = 2008 AND T1.name = "Monaco Grand Prix"

2222

        SELECT MAX(fastestLapSpeed)
        FROM results
        INNER JOIN races ON results.raceId = races.raceId
        WHERE races.name = 'Monaco Grand Prix'
        AND races.year = 2008;
 SELECT max(T2.fastestlapspeed) FROM races AS T1 JOIN results AS T2 ON T1.raceid = T2.raceid WHERE T1.year = 2008 AND T1.name = "Monaco Grand Prix"

2223

        SELECT MAX(fastestLapSpeed), race.name, race.year
        FROM results
        JOIN races AS race ON results.raceId = race.raceId
        WHERE race.year > 2004
        GROUP BY race.name, race.year
        ORDER BY race.year;
 SELECT max(T2.fastestlapspeed) ,  T1.name ,  T1.year FROM races AS T1 JOIN results AS T2 ON T1.raceid = T2.raceid WHERE T1.year > 2014 GROUP BY T1.name ORDER BY T1.year

2224

        SELECT r.name, MAX(lt.fastestLapSpeed)
        FROM races r
        JOIN lapTimes lt ON lt.raceId = r.raceId
        WHERE r.year > 2004
        GROUP BY r.name
        ORDER BY r.year;
 SELECT max(T2.fastestlapspeed) ,  T1.name ,  T1.year FROM races AS T1 JOIN results AS T2 ON T1.raceid = T2.raceid WHERE T1.year > 2014 GROUP BY T1.name ORDER BY T1.year

2225

        SELECT AVG(fastestLapSpeed) AS avg_fastest_lap_speed, races.name, races.year
        FROM results
        INNER JOIN races ON results.raceId = races.raceId
        WHERE races.year > 2004
        GROUP BY races.name, races.year
        ORDER BY races.year;
 SELECT avg(T2.fastestlapspeed) ,  T1.name ,  T1.year FROM races AS T1 JOIN results AS T2 ON T1.raceid = T2.raceid WHERE T1.year > 2014 GROUP BY T1.name ORDER BY T1.year

2226

        SELECT AVG(fastestLapSpeed) AS avg_fastest_lap_speed, races.year
        FROM results
        INNER JOIN races ON results.raceId = races.raceId
        WHERE races.year > 2004
        GROUP BY races.year
        ORDER BY races.year ASC;
 SELECT avg(T2.fastestlapspeed) ,  T1.name ,  T1.year FROM races AS T1 JOIN results AS T2 ON T1.raceid = T2.raceid WHERE T1.year > 2014 GROUP BY T1.name ORDER BY T1.year

2227

        SELECT drivers.driverId, drivers.forename, COUNT(races.raceId) AS num_races
        FROM drivers
        INNER JOIN results ON drivers.driverId = results.driverId
        INNER JOIN races ON results.raceId = races.raceId
        GROUP BY drivers.driverId
        HAVING COUNT(races.raceId) >= 2;
 SELECT T1.driverid ,  T1.forename ,  count(*) FROM drivers AS T1 JOIN results AS T2 ON T1.driverid = T2.driverid JOIN races AS T3 ON T2.raceid = T3.raceid GROUP BY T1.driverid HAVING count(*)  >=  2

2228

        SELECT driverId, forename, COUNT(raceId) AS number_of_races
        FROM drivers
        INNER JOIN results ON drivers.driverId = results.driverId
        GROUP BY driverId
        HAVING COUNT(raceId) >= 2;
 SELECT T1.driverid ,  T1.forename ,  count(*) FROM drivers AS T1 JOIN results AS T2 ON T1.driverid = T2.driverid JOIN races AS T3 ON T2.raceid = T3.raceid GROUP BY T1.driverid HAVING count(*)  >=  2

2229

        SELECT driverId, COUNT(raceId) FROM driverStandings GROUP BY driverId HAVING COUNT(raceId) <= 30;
 SELECT T1.driverid ,  count(*) FROM drivers AS T1 JOIN results AS T2 ON T1.driverid = T2.driverid JOIN races AS T3 ON T2.raceid = T3.raceid GROUP BY T1.driverid HAVING count(*)  <=  30

2230

        SELECT driverId, COUNT(raceId) AS NumRaces FROM results WHERE raceId IN (SELECT raceId FROM results GROUP BY raceId HAVING COUNT(driverId) <= 30) GROUP BY driverId;
 SELECT T1.driverid ,  count(*) FROM drivers AS T1 JOIN results AS T2 ON T1.driverid = T2.driverid JOIN races AS T3 ON T2.raceid = T3.raceid GROUP BY T1.driverid HAVING count(*)  <=  30

2231

        SELECT driverId, surname
        FROM drivers
        INNER JOIN results
        ON drivers.driverId = results.driverId
        GROUP BY driverId
        ORDER BY COUNT(*) DESC
        LIMIT 1;
 SELECT T1.driverid ,  T1.surname FROM drivers AS T1 JOIN results AS T2 ON T1.driverid = T2.driverid JOIN races AS T3 ON T2.raceid = T3.raceid GROUP BY T1.driverid ORDER BY count(*) DESC LIMIT 1

2232

        SELECT driverId, surname FROM drivers WHERE driverId IN (SELECT driverId FROM results GROUP BY driverId ORDER BY COUNT(*) DESC LIMIT 1);
 SELECT T1.driverid ,  T1.surname FROM drivers AS T1 JOIN results AS T2 ON T1.driverid = T2.driverid JOIN races AS T3 ON T2.raceid = T3.raceid GROUP BY T1.driverid ORDER BY count(*) DESC LIMIT 1

2263

        SELECT COUNT(*) FROM entrepreneur;
 SELECT count(*) FROM entrepreneur

2264

        SELECT COUNT(*) FROM entrepreneur;
 SELECT count(*) FROM entrepreneur

2265

        SELECT Company, Money_Requested FROM entrepreneur ORDER BY Money_Requested DESC;
 SELECT Company FROM entrepreneur ORDER BY Money_Requested DESC

2266

        SELECT Company, Money_Requested FROM entrepreneur ORDER BY Money_Requested DESC;
 SELECT Company FROM entrepreneur ORDER BY Money_Requested DESC

2267

        SELECT Company, Investor FROM entrepreneur;
 SELECT Company ,  Investor FROM entrepreneur

2268

        SELECT Company, Investor FROM entrepreneur INNER JOIN people ON entrepreneur.People_ID = people.People_ID;
 SELECT Company ,  Investor FROM entrepreneur

2269

        SELECT AVG(Money_Requested) FROM entrepreneur;
 SELECT avg(Money_Requested) FROM entrepreneur

2270

        SELECT AVG(Money_Requested) FROM entrepreneur;
 SELECT avg(Money_Requested) FROM entrepreneur

2271

        SELECT Name FROM people ORDER BY Weight ASC;
 SELECT Name FROM People ORDER BY Weight ASC

2272

        SELECT Name FROM people ORDER BY Weight ASC;
 SELECT Name FROM People ORDER BY Weight ASC

2273

        SELECT Name FROM people INNER JOIN entrepreneur ON people.People_ID = entrepreneur.People_ID;

 SELECT T2.Name FROM entrepreneur AS T1 JOIN people AS T2 ON T1.People_ID  =  T2.People_ID

2274

        SELECT Name FROM people INNER JOIN entrepreneur ON people.People_ID = entrepreneur.People_ID;
 SELECT T2.Name FROM entrepreneur AS T1 JOIN people AS T2 ON T1.People_ID  =  T2.People_ID

2275

        SELECT Name
        FROM people
        INNER JOIN entrepreneur
        ON people.People_ID = entrepreneur.People_ID
        WHERE Investor != 'Rachel Elnaugh';
 SELECT T2.Name FROM entrepreneur AS T1 JOIN people AS T2 ON T1.People_ID  =  T2.People_ID WHERE T1.Investor != "Rachel Elnaugh"

2276

        SELECT Name
        FROM people
        JOIN entrepreneur
        ON people.People_ID = entrepreneur.People_ID
        WHERE Investor != 'Rachel Elnaugh';
 SELECT T2.Name FROM entrepreneur AS T1 JOIN people AS T2 ON T1.People_ID  =  T2.People_ID WHERE T1.Investor != "Rachel Elnaugh"

2277

        SELECT MIN(Weight) FROM people;
 SELECT Weight FROM people ORDER BY Height ASC LIMIT 1

2278

        SELECT MIN(Weight) FROM people;
 SELECT Weight FROM people ORDER BY Height ASC LIMIT 1

2279

        SELECT Name
        FROM people
        JOIN entrepreneur
        ON people.People_ID = entrepreneur.People_ID
        ORDER BY Weight DESC
        LIMIT 1;
 SELECT T2.Name FROM entrepreneur AS T1 JOIN people AS T2 ON T1.People_ID  =  T2.People_ID ORDER BY T2.Weight DESC LIMIT 1

2280

        SELECT Name
        FROM people
        INNER JOIN entrepreneur
        ON people.People_ID = entrepreneur.People_ID
        ORDER BY Weight DESC
        LIMIT 1;
 SELECT T2.Name FROM entrepreneur AS T1 JOIN people AS T2 ON T1.People_ID  =  T2.People_ID ORDER BY T2.Weight DESC LIMIT 1

2281

        SELECT SUM(Money_Requested)
        FROM entrepreneur
        INNER JOIN people
        ON entrepreneur.People_ID = people.People_ID
        WHERE Height > 1.85;
 SELECT sum(T1.Money_Requested) FROM entrepreneur AS T1 JOIN people AS T2 ON T1.People_ID  =  T2.People_ID WHERE T2.Height  >  1.85

2282

        SELECT SUM(Money_Requested)
        FROM entrepreneur
        INNER JOIN people
        ON entrepreneur.People_ID = people.People_ID
        WHERE people.Height > 1.85;
 SELECT sum(T1.Money_Requested) FROM entrepreneur AS T1 JOIN people AS T2 ON T1.People_ID  =  T2.People_ID WHERE T2.Height  >  1.85

2283

        SELECT Date_of_Birth FROM people INNER JOIN entrepreneur ON people.People_ID = entrepreneur.People_ID WHERE Investor IN ('Simon Woodroffe', 'Peter Jones');
 SELECT T2.Date_of_Birth FROM entrepreneur AS T1 JOIN people AS T2 ON T1.People_ID  =  T2.People_ID WHERE T1.Investor  =  "Simon Woodroffe" OR T1.Investor  =  "Peter Jones"

2284

        SELECT Date_of_Birth
        FROM people
        INNER JOIN entrepreneur
        ON people.People_ID = entrepreneur.People_ID
        WHERE Investor IN ('Simon Woodroffe', 'Peter Jones');
 SELECT T2.Date_of_Birth FROM entrepreneur AS T1 JOIN people AS T2 ON T1.People_ID  =  T2.People_ID WHERE T1.Investor  =  "Simon Woodroffe" OR T1.Investor  =  "Peter Jones"

2285

        SELECT Weight
        FROM people
        INNER JOIN entrepreneur
        ON people.People_ID = entrepreneur.People_ID
        ORDER BY Money_Requested DESC;
 SELECT T2.Weight FROM entrepreneur AS T1 JOIN people AS T2 ON T1.People_ID  =  T2.People_ID ORDER BY T1.Money_Requested DESC

2286

        SELECT Weight FROM people INNER JOIN entrepreneur ON people.People_ID = entrepreneur.People_ID ORDER BY Money_Requested DESC;
 SELECT T2.Weight FROM entrepreneur AS T1 JOIN people AS T2 ON T1.People_ID  =  T2.People_ID ORDER BY T1.Money_Requested DESC

2287

        SELECT Investor, COUNT(*) AS Number_of_Entrepreneurs_Invested
        FROM entrepreneur
        GROUP BY Investor;
 SELECT Investor ,  COUNT(*) FROM entrepreneur GROUP BY Investor

2288

        SELECT Investor, COUNT(*) AS 'Number of Entrepreneurs' FROM entrepreneur GROUP BY Investor;
 SELECT Investor ,  COUNT(*) FROM entrepreneur GROUP BY Investor

2289

        SELECT Investor, COUNT(*) AS Num_Investments
        FROM entrepreneur
        GROUP BY Investor
        ORDER BY Num_Investments DESC
        LIMIT 1;
 SELECT Investor FROM entrepreneur GROUP BY Investor ORDER BY COUNT(*) DESC LIMIT 1

2290

        SELECT Investor, COUNT(*) AS Num_Investments
        FROM entrepreneur
        GROUP BY Investor
        ORDER BY Num_Investments DESC
        LIMIT 1;
 SELECT Investor FROM entrepreneur GROUP BY Investor ORDER BY COUNT(*) DESC LIMIT 1

2291

        SELECT Investor
        FROM entrepreneur
        GROUP BY Investor
        HAVING COUNT(*) >= 2;
 SELECT Investor FROM entrepreneur GROUP BY Investor HAVING COUNT(*)  >=  2

2292

        SELECT Investor
        FROM entrepreneur
        GROUP BY Investor
        HAVING COUNT(*) >= 2;
 SELECT Investor FROM entrepreneur GROUP BY Investor HAVING COUNT(*)  >=  2

2293

        SELECT Name, Company, Money_Requested FROM entrepreneur INNER JOIN people ON entrepreneur.People_ID = people.People_ID ORDER BY Money_Requested DESC;
 SELECT T2.Name ,  T1.Company FROM entrepreneur AS T1 JOIN people AS T2 ON T1.People_ID  =  T2.People_ID ORDER BY T1.Money_Requested

2294

        SELECT "Name", "Investor", "Money_Requested"
        FROM "entrepreneur"
        INNER JOIN "people"
        ON "entrepreneur"."People_ID" = "people"."People_ID"
        ORDER BY "Money_Requested" DESC;
 SELECT T2.Name ,  T1.Company FROM entrepreneur AS T1 JOIN people AS T2 ON T1.People_ID  =  T2.People_ID ORDER BY T1.Money_Requested

2295

        SELECT Name FROM people WHERE People_ID NOT IN (SELECT People_ID FROM entrepreneur);
 SELECT Name FROM people WHERE People_ID NOT IN (SELECT People_ID FROM entrepreneur)

2296

        SELECT Name FROM people WHERE People_ID NOT IN (SELECT People_ID FROM entrepreneur);
 SELECT Name FROM people WHERE People_ID NOT IN (SELECT People_ID FROM entrepreneur)

2297

        SELECT Investor FROM entrepreneur WHERE Money_Requested > 140000 OR Money_Requested < 120000;
 SELECT Investor FROM entrepreneur WHERE Money_Requested  >  140000 INTERSECT SELECT Investor FROM entrepreneur WHERE Money_Requested  <  120000

2298

        SELECT Investor
        FROM entrepreneur
        WHERE Money_Requested > 140000
        AND Investor IN (SELECT Investor
                        FROM entrepreneur
                        WHERE Money_Requested < 120000)
 SELECT Investor FROM entrepreneur WHERE Money_Requested  >  140000 INTERSECT SELECT Investor FROM entrepreneur WHERE Money_Requested  <  120000

2299

        SELECT COUNT(DISTINCT Company) FROM entrepreneur;
 SELECT count(DISTINCT Company) FROM entrepreneur

2300

        SELECT COUNT(DISTINCT Company) FROM entrepreneur;
 SELECT count(DISTINCT Company) FROM entrepreneur

2301

        SELECT Company
        FROM entrepreneur
        INNER JOIN people
        ON entrepreneur.People_ID = people.People_ID
        WHERE Height = (SELECT MAX(Height) FROM people);
 SELECT T1.Company FROM entrepreneur AS T1 JOIN people AS T2 ON T1.People_ID  =  T2.People_ID ORDER BY T2.Height DESC LIMIT 1

2302

        SELECT Company
        FROM entrepreneur
        INNER JOIN people ON entrepreneur.People_ID = people.People_ID
        ORDER BY Height DESC
        LIMIT 1;
 SELECT T1.Company FROM entrepreneur AS T1 JOIN people AS T2 ON T1.People_ID  =  T2.People_ID ORDER BY T2.Height DESC LIMIT 1

2532

        SELECT COUNT(*) FROM county_public_safety;
 SELECT count(*) FROM county_public_safety

2533

        SELECT COUNT(*) FROM county_public_safety;
 SELECT count(*) FROM county_public_safety

2534

        SELECT Name FROM county_public_safety ORDER BY Population DESC;
 SELECT Name FROM county_public_safety ORDER BY Population DESC

2535

        SELECT Name FROM county_public_safety ORDER BY Population DESC;
 SELECT Name FROM county_public_safety ORDER BY Population DESC

2536

        SELECT DISTINCT Police_force
        FROM county_public_safety
        WHERE Location NOT LIKE '%east side%';
 SELECT DISTINCT Police_force FROM county_public_safety WHERE LOCATION != "East"

2537

        SELECT Police_force FROM county_public_safety WHERE Location NOT LIKE '%East%';
 SELECT DISTINCT Police_force FROM county_public_safety WHERE LOCATION != "East"

2538

        SELECT MIN(Crime_rate), MAX(Crime_rate) FROM county_public_safety;
 SELECT min(Crime_rate) ,  max(Crime_rate) FROM county_public_safety

2539

        SELECT MIN(Crime_rate), MAX(Crime_rate) FROM county_public_safety;
 SELECT min(Crime_rate) ,  max(Crime_rate) FROM county_public_safety

2540

        SELECT County_ID, Name, Crime_rate, Police_officers
        FROM county_public_safety
        ORDER BY Police_officers ASC;
 SELECT Crime_rate FROM county_public_safety ORDER BY Police_officers ASC

2541

        SELECT County_ID, Name, Crime_rate FROM county_public_safety ORDER BY Police_officers ASC;
 SELECT Crime_rate FROM county_public_safety ORDER BY Police_officers ASC

2542

        SELECT Name FROM city ORDER BY Name ASC;
 SELECT Name FROM city ORDER BY Name ASC

2543

        SELECT Name FROM city ORDER BY Name ASC;
 SELECT Name FROM city ORDER BY Name ASC

2544

        SELECT City.Name, Hispanic * 100.0 / (White + Black + Amerindian + Asian + Multiracial + Hispanic) AS Percentage_Hispanic
        FROM City
        INNER JOIN County_Public_Safety
        ON City.County_ID = County_Public_Safety.County_ID
        WHERE Black > 10;
 SELECT Hispanic FROM city WHERE Black  >  10

2545

        SELECT Hispanic FROM city WHERE Black > 10;
 SELECT Hispanic FROM city WHERE Black  >  10

2546

        SELECT Name FROM county_public_safety ORDER BY Population DESC LIMIT 1;
 SELECT Name FROM county_public_safety ORDER BY Population DESC LIMIT 1

2547

        SELECT Name FROM county_public_safety WHERE Population = (SELECT MAX(Population) FROM county_public_safety);
 SELECT Name FROM county_public_safety ORDER BY Population DESC LIMIT 1

2548

        SELECT Name FROM city ORDER BY White DESC LIMIT 5;
 SELECT Name FROM city ORDER BY White DESC LIMIT 5

2549

        SELECT Name
        FROM city
        ORDER BY White DESC
        LIMIT 5;
 SELECT Name FROM city ORDER BY White DESC LIMIT 5

2550

        SELECT c.Name AS 'City Name', p.Name AS 'County Name'
        FROM city c
        INNER JOIN county_public_safety p
        ON c.County_ID = p.County_ID;
 SELECT T1.Name ,  T2.Name FROM city AS T1 JOIN county_public_safety AS T2 ON T1.County_ID  =  T2.County_ID

2551

        SELECT c.Name AS City_Name, cp.Name AS County_Name
        FROM city c
        INNER JOIN county_public_safety cp
        ON c.County_ID = cp.County_ID;
 SELECT T1.Name ,  T2.Name FROM city AS T1 JOIN county_public_safety AS T2 ON T1.County_ID  =  T2.County_ID

2552

        SELECT c.Name AS County_Name, c.Crime_Rate, ci.Name AS City_Name, ci.White FROM county_public_safety c INNER JOIN city ci ON c.County_ID = ci.County_ID;
 SELECT T1.White ,  T2.Crime_rate FROM city AS T1 JOIN county_public_safety AS T2 ON T1.County_ID  =  T2.County_ID

2553

        SELECT c.White, p.Crime_rate
        FROM city c
        INNER JOIN county_public_safety p
        ON c.County_ID = p.County_ID;
 SELECT T1.White ,  T2.Crime_rate FROM city AS T1 JOIN county_public_safety AS T2 ON T1.County_ID  =  T2.County_ID

2554

        SELECT c.Name
        FROM county_public_safety cps
        JOIN city c
        ON cps.County_ID = c.County_ID
        WHERE cps.Police_officers = (SELECT MAX(Police_officers) FROM county_public_safety)
 SELECT name FROM city WHERE county_ID  =  (SELECT county_ID FROM county_public_safety ORDER BY Police_officers DESC LIMIT 1)

2555

        SELECT Name
        FROM city
        INNER JOIN county_public_safety
        ON city.County_ID = county_public_safety.County_ID
        WHERE Police_officers = (SELECT MAX(Police_officers) FROM county_public_safety);
 SELECT name FROM city WHERE county_ID  =  (SELECT county_ID FROM county_public_safety ORDER BY Police_officers DESC LIMIT 1)

2556

        SELECT COUNT(*) FROM county_public_safety cps JOIN city c ON cps.County_ID = c.County_ID WHERE cps.Population > 20000;
 SELECT count(*) FROM city WHERE county_ID IN (SELECT county_ID FROM county_public_safety WHERE population  >  20000)

2557

        SELECT COUNT(*) FROM city INNER JOIN county_public_safety ON city.County_ID = county_public_safety.County_ID WHERE county_public_safety.Population > 20000;
 SELECT count(*) FROM city WHERE county_ID IN (SELECT county_ID FROM county_public_safety WHERE population  >  20000)

2558

        SELECT County_ID, Crime_rate
        FROM county_public_safety
        WHERE County_ID IN (SELECT County_ID FROM city WHERE White > 90);
 SELECT T2.Crime_rate FROM city AS T1 JOIN county_public_safety AS T2 ON T1.County_ID  =  T2.County_ID WHERE T1.White  >  90

2559

        SELECT Crime_rate
        FROM county_public_safety
        INNER JOIN city
        ON county_public_safety.County_ID = city.County_ID
        WHERE White > 90;
 SELECT T2.Crime_rate FROM city AS T1 JOIN county_public_safety AS T2 ON T1.County_ID  =  T2.County_ID WHERE T1.White  >  90

2560

        SELECT Police_force, COUNT(*) AS 'Number of Counties' FROM county_public_safety GROUP BY Police_force;
 SELECT Police_force ,  COUNT(*) FROM county_public_safety GROUP BY Police_force

2561

        SELECT Police_force, COUNT(*) AS 'Number of Counties' FROM county_public_safety GROUP BY Police_force;
 SELECT Police_force ,  COUNT(*) FROM county_public_safety GROUP BY Police_force

2562

        SELECT Location, COUNT(*) AS Count
        FROM county_public_safety
        GROUP BY Location
        ORDER BY Count DESC
        LIMIT 1;
 SELECT LOCATION FROM county_public_safety GROUP BY LOCATION ORDER BY COUNT(*) DESC LIMIT 1

2563

        SELECT Location, COUNT(*) AS Count
        FROM county_public_safety
        GROUP BY Location
        ORDER BY Count DESC
        LIMIT 1;
 SELECT LOCATION FROM county_public_safety GROUP BY LOCATION ORDER BY COUNT(*) DESC LIMIT 1

2564

        SELECT Name FROM county_public_safety WHERE County_ID NOT IN (SELECT County_ID FROM city);
 SELECT Name FROM county_public_safety WHERE County_ID NOT IN (SELECT County_ID FROM city)

2565

        SELECT Name FROM county_public_safety WHERE County_ID NOT IN (SELECT County_ID FROM city);
 SELECT Name FROM county_public_safety WHERE County_ID NOT IN (SELECT County_ID FROM city)

2566

        SELECT Police_force FROM county_public_safety WHERE Location IN ('East', 'West');
 SELECT Police_force FROM county_public_safety WHERE LOCATION  =  "East" INTERSECT SELECT Police_force FROM county_public_safety WHERE LOCATION  =  "West"

2567

        SELECT Police_force
        FROM county_public_safety
        WHERE Location IN ('East', 'West')
        GROUP BY Police_force
        HAVING COUNT(*) > 1;
 SELECT Police_force FROM county_public_safety WHERE LOCATION  =  "East" INTERSECT SELECT Police_force FROM county_public_safety WHERE LOCATION  =  "West"

2568

        SELECT c.Name
        FROM county_public_safety cps
        JOIN city c
        ON cps.County_ID = c.County_ID
        WHERE cps.Crime_rate < 100;
 SELECT name FROM city WHERE county_id IN (SELECT county_id FROM county_public_safety WHERE Crime_rate  <  100)

2569

        SELECT c.Name
        FROM county_public_safety cps
        JOIN city c
        ON cps.County_ID = c.County_ID
        WHERE cps.Crime_rate < 100;
 SELECT name FROM city WHERE county_id IN (SELECT county_id FROM county_public_safety WHERE Crime_rate  <  100)

2570

        SELECT Name, Population, Case_burden FROM county_public_safety ORDER BY Population DESC;
 SELECT Case_burden FROM county_public_safety ORDER BY Population DESC

2571

        SELECT "County_ID", "Name", "Population", "Case_burden" FROM "county_public_safety" ORDER BY "Population" DESC;
 SELECT Case_burden FROM county_public_safety ORDER BY Population DESC

2690

        SELECT COUNT(*) FROM region;
 SELECT count(*) FROM region

2691

        SELECT COUNT(*) FROM region;
 SELECT count(*) FROM region

2692

        SELECT Region_code, Region_name FROM region ORDER BY Region_code;
 SELECT region_code ,  region_name FROM region ORDER BY region_code

2693

        SELECT Region_code, Region_name FROM region ORDER BY Region_code;
 SELECT region_code ,  region_name FROM region ORDER BY region_code

2694

        SELECT Region_name FROM region ORDER BY Region_name ASC;
 SELECT region_name FROM region ORDER BY region_name

2695

        SELECT Region_name FROM region ORDER BY Region_name ASC;
 SELECT region_name FROM region ORDER BY region_name

2696

        SELECT Region_name FROM region WHERE Region_name != 'Denmark';
 SELECT region_name FROM region WHERE region_name != 'Denmark'

2697

        SELECT Region_name FROM region WHERE Region_name != 'Denmark';
 SELECT region_name FROM region WHERE region_name != 'Denmark'

2698

        SELECT COUNT(Number_Deaths) FROM storm WHERE Number_Deaths > 0;
 SELECT count(*) FROM storm WHERE Number_Deaths  >  0

2699

        SELECT COUNT(*) FROM storm WHERE Number_Deaths > 0;
 SELECT count(*) FROM storm WHERE Number_Deaths  >  0

2700

        SELECT Name, Dates_active, Number_Deaths FROM storm WHERE Number_Deaths > 0;
 SELECT name ,  dates_active ,  number_deaths FROM storm WHERE number_deaths  >=  1

2701

        SELECT Name, Dates_active, Number_Deaths FROM storm WHERE Number_Deaths > 0;
 SELECT name ,  dates_active ,  number_deaths FROM storm WHERE number_deaths  >=  1

2702

        SELECT AVG(Damage_millions_USD), MAX(Damage_millions_USD) FROM storm WHERE Max_speed > 1000;
 SELECT avg(damage_millions_USD) ,  max(damage_millions_USD) FROM storm WHERE max_speed  >  1000

2703

        SELECT AVG(Damage_millions_USD), MAX(Damage_millions_USD) FROM storm WHERE Max_speed > 1000;
 SELECT avg(damage_millions_USD) ,  max(damage_millions_USD) FROM storm WHERE max_speed  >  1000

2704

SELECT SUM(Number_Deaths) AS Total_Deaths, SUM(Damage_millions_USD) AS Total_Damage FROM storm WHERE Max_speed > (SELECT AVG(Max_speed) FROM storm);
 SELECT sum(number_deaths) ,  sum(damage_millions_USD) FROM storm WHERE max_speed  >  (SELECT avg(max_speed) FROM storm)

2705

        SELECT SUM(Number_Deaths) AS Total_Deaths, SUM(Damage_millions_USD) AS Total_Damage_Millions FROM storm WHERE Max_speed > (SELECT AVG(Max_speed) FROM storm);
 SELECT sum(number_deaths) ,  sum(damage_millions_USD) FROM storm WHERE max_speed  >  (SELECT avg(max_speed) FROM storm)

2706

        SELECT Name, Damage_millions_USD FROM storm ORDER BY Max_speed DESC;
 SELECT name ,  damage_millions_USD FROM storm ORDER BY max_speed DESC

2707

        SELECT Name, Damage_millions_USD FROM storm ORDER BY Max_speed DESC;
 SELECT name ,  damage_millions_USD FROM storm ORDER BY max_speed DESC

2708

SELECT COUNT(*) FROM affected_region;
 SELECT count(DISTINCT region_id) FROM affected_region

2709

        SELECT COUNT(DISTINCT Region_id) FROM affected_region;
 SELECT count(DISTINCT region_id) FROM affected_region

2710

        SELECT Region_name FROM region WHERE Region_id NOT IN (SELECT Region_id FROM affected_region);
 SELECT region_name FROM region WHERE region_id NOT IN (SELECT region_id FROM affected_region)

2711

        SELECT Region_name FROM region WHERE Region_id NOT IN (SELECT Region_id FROM affected_region);
 SELECT region_name FROM region WHERE region_id NOT IN (SELECT region_id FROM affected_region)

2712

        SELECT Region_name, COUNT(Storm_ID) FROM region LEFT JOIN affected_region ON region.Region_id = affected_region.Region_id GROUP BY Region_name;
 SELECT T1.region_name ,  count(*) FROM region AS T1 JOIN affected_region AS T2 ON T1.region_id = T2.region_id GROUP BY T1.region_id

2713

        SELECT Region_name, COUNT(*) AS Number_of_storms
        FROM region
        INNER JOIN affected_region ON region.Region_id = affected_region.Region_id
        INNER JOIN storm ON storm.Storm_ID = affected_region.Storm_ID
        GROUP BY Region_name;
 SELECT T1.region_name ,  count(*) FROM region AS T1 JOIN affected_region AS T2 ON T1.region_id = T2.region_id GROUP BY T1.region_id

2714

        SELECT Name, COUNT(Region_id) AS Number_Affected_Regions FROM storm LEFT JOIN affected_region ON storm.Storm_ID = affected_region.Storm_ID GROUP BY Name;
 SELECT T1.name ,  count(*) FROM storm AS T1 JOIN affected_region AS T2 ON T1.storm_id  =  T2.storm_id GROUP BY T1.storm_id

2715

        SELECT Storm_ID, COUNT(Region_id) AS Number_of_Regions_Affected FROM affected_region GROUP BY Storm_ID;
 SELECT T1.name ,  count(*) FROM storm AS T1 JOIN affected_region AS T2 ON T1.storm_id  =  T2.storm_id GROUP BY T1.storm_id

2716

        SELECT Name, Max_speed
        FROM storm
        INNER JOIN affected_region ON storm.Storm_ID = affected_region.Storm_ID
        GROUP BY Name, Max_speed
        ORDER BY SUM(Number_city_affected) DESC
        LIMIT 1;
 SELECT T1.name ,  T1.max_speed FROM storm AS T1 JOIN affected_region AS T2 ON T1.storm_id  =  T2.storm_id GROUP BY T1.storm_id ORDER BY count(*) DESC LIMIT 1

2717

        SELECT Name, Max_speed
        FROM storm
        INNER JOIN affected_region
        ON storm.Storm_ID = affected_region.Storm_ID
        GROUP BY storm.Storm_ID
        ORDER BY COUNT(affected_region.Region_id) DESC
        LIMIT 1;
 SELECT T1.name ,  T1.max_speed FROM storm AS T1 JOIN affected_region AS T2 ON T1.storm_id  =  T2.storm_id GROUP BY T1.storm_id ORDER BY count(*) DESC LIMIT 1

2718

        SELECT Name FROM storm WHERE Storm_ID NOT IN (SELECT Storm_ID FROM affected_region);
 SELECT name FROM storm WHERE storm_id NOT IN (SELECT storm_id FROM affected_region)

2719

        SELECT Name FROM storm WHERE Storm_ID NOT IN (SELECT Storm_ID FROM affected_region);
 SELECT name FROM storm WHERE storm_id NOT IN (SELECT storm_id FROM affected_region)

2720

        SELECT s.Name
        FROM storm s
        INNER JOIN affected_region ar ON s.Storm_ID = ar.Storm_ID
        INNER JOIN region r ON ar.Region_id = r.Region_id
        GROUP BY s.Name
        HAVING COUNT(r.Region_id) >= 2 AND SUM(ar.Number_city_affected) >= 10;
 SELECT T1.name FROM storm AS T1 JOIN affected_region AS T2 ON T1.storm_id  =  T2.storm_id GROUP BY T1.storm_id HAVING count(*)  >=  2 INTERSECT SELECT T1.name FROM storm AS T1 JOIN affected_region AS T2 ON T1.storm_id  =  T2.storm_id GROUP BY T1.storm_id HAVING sum(T2.number_city_affected)  >=  10

2721

        SELECT Name
        FROM storm
        INNER JOIN affected_region
        ON storm.Storm_ID = affected_region.Storm_ID
        GROUP BY Name
        HAVING COUNT(*) >= 2 AND SUM(Number_city_affected) >= 10;
 SELECT T1.name FROM storm AS T1 JOIN affected_region AS T2 ON T1.storm_id  =  T2.storm_id GROUP BY T1.storm_id HAVING count(*)  >=  2 INTERSECT SELECT T1.name FROM storm AS T1 JOIN affected_region AS T2 ON T1.storm_id  =  T2.storm_id GROUP BY T1.storm_id HAVING sum(T2.number_city_affected)  >=  10

2722

        SELECT Name
        FROM storm
        WHERE Storm_ID NOT IN (SELECT Storm_ID
                               FROM affected_region
                               GROUP BY Storm_ID
                               HAVING COUNT(*) >= 2);
 SELECT name FROM storm EXCEPT SELECT T1.name FROM storm AS T1 JOIN affected_region AS T2 ON T1.storm_id  =  T2.storm_id GROUP BY T1.storm_id HAVING count(*)  >=  2

2723

        SELECT Name
        FROM storm
        WHERE Storm_ID NOT IN (SELECT Storm_ID
                               FROM affected_region
                               GROUP BY Storm_ID
                               HAVING COUNT(*) >= 2);
 SELECT name FROM storm EXCEPT SELECT T1.name FROM storm AS T1 JOIN affected_region AS T2 ON T1.storm_id  =  T2.storm_id GROUP BY T1.storm_id HAVING count(*)  >=  2

2724

        SELECT Region_name
        FROM region
        INNER JOIN affected_region
        ON region.Region_id = affected_region.Region_id
        INNER JOIN storm
        ON affected_region.Storm_ID = storm.Storm_ID
        WHERE storm.Number_Deaths >= 10;
 SELECT T2.region_name FROM affected_region AS T1 JOIN region AS T2 ON T1.region_id  =  T2.region_id JOIN storm AS T3 ON T1.storm_id  =  T3.storm_id WHERE T3.number_deaths  >=  10

2725

        SELECT region.Region_name
        FROM region
        INNER JOIN affected_region ON region.Region_id = affected_region.Region_id
        INNER JOIN storm ON affected_region.Storm_ID = storm.Storm_ID
        WHERE storm.Number_Deaths >= 10;
 SELECT T2.region_name FROM affected_region AS T1 JOIN region AS T2 ON T1.region_id  =  T2.region_id JOIN storm AS T3 ON T1.storm_id  =  T3.storm_id WHERE T3.number_deaths  >=  10

2726

        SELECT Name
        FROM storm
        INNER JOIN affected_region ON storm.Storm_ID = affected_region.Storm_ID
        INNER JOIN region ON affected_region.Region_id = region.Region_id
        WHERE region.Region_name = 'Denmark';

 SELECT T3.name FROM affected_region AS T1 JOIN region AS T2 ON T1.region_id  =  T2.region_id JOIN storm AS T3 ON T1.storm_id  =  T3.storm_id WHERE T2.region_name  =  'Denmark'

2727

        SELECT Name FROM storm
        INNER JOIN affected_region ON storm.Storm_ID = affected_region.Storm_ID
        INNER JOIN region ON affected_region.Region_id = region.Region_id
        WHERE region.Region_name = 'Denmark';
 SELECT T3.name FROM affected_region AS T1 JOIN region AS T2 ON T1.region_id  =  T2.region_id JOIN storm AS T3 ON T1.storm_id  =  T3.storm_id WHERE T2.region_name  =  'Denmark'

2728

        SELECT Region_name
        FROM region
        INNER JOIN affected_region
        ON region.Region_id = affected_region.Region_id
        INNER JOIN storm
        ON affected_region.Storm_ID = storm.Storm_ID
        GROUP BY Region_name
        HAVING COUNT(*) >= 2;
 SELECT T1.region_name FROM region AS T1 JOIN affected_region AS T2 ON T1.region_id = T2.region_id GROUP BY T1.region_id HAVING count(*)  >=  2

2729

        SELECT Region_name
        FROM region
        INNER JOIN affected_region
        ON region.Region_id = affected_region.Region_id
        INNER JOIN storm
        ON affected_region.Storm_ID = storm.Storm_ID
        GROUP BY Region_name
        HAVING COUNT(*) >= 2;
 SELECT T1.region_name FROM region AS T1 JOIN affected_region AS T2 ON T1.region_id = T2.region_id GROUP BY T1.region_id HAVING count(*)  >=  2

2730

        SELECT Region_name
        FROM region
        INNER JOIN affected_region
        ON region.Region_id = affected_region.Region_id
        INNER JOIN storm
        ON affected_region.Storm_ID = storm.Storm_ID
        WHERE storm.Number_Deaths = (SELECT MAX(Number_Deaths) FROM storm);
 SELECT T2.region_name FROM affected_region AS T1 JOIN region AS T2 ON T1.region_id  =  T2.region_id JOIN storm AS T3 ON T1.storm_id  =  T3.storm_id ORDER BY T3.Number_Deaths DESC LIMIT 1

2731

        SELECT Region_name
        FROM region
        INNER JOIN affected_region
        ON region.Region_id = affected_region.Region_id
        INNER JOIN storm
        ON affected_region.Storm_ID = storm.Storm_ID
        WHERE storm.Number_Deaths = (SELECT MAX(Number_Deaths) FROM storm);
 SELECT T2.region_name FROM affected_region AS T1 JOIN region AS T2 ON T1.region_id  =  T2.region_id JOIN storm AS T3 ON T1.storm_id  =  T3.storm_id ORDER BY T3.Number_Deaths DESC LIMIT 1

2732

        SELECT s.Name
        FROM storm s
        INNER JOIN affected_region ar1 ON s.Storm_ID = ar1.Storm_ID
        INNER JOIN region r1 ON ar1.Region_id = r1.Region_id
        INNER JOIN affected_region ar2 ON s.Storm_ID = ar2.Storm_ID
        INNER JOIN region r2 ON ar2.Region_id = r2.Region_id
        WHERE r1.Region_name = 'Afghanistan' AND r2.Region_name = 'Albania';
 SELECT T3.Name FROM affected_region AS T1 JOIN region AS T2 ON T1.region_id  =  T2.region_id JOIN storm AS T3 ON T1.storm_id  =  T3.storm_id WHERE T2.Region_name  =  'Afghanistan' INTERSECT SELECT T3.Name FROM affected_region AS T1 JOIN region AS T2 ON T1.region_id  =  T2.region_id JOIN storm AS T3 ON T1.storm_id  =  T3.storm_id WHERE T2.Region_name  =  'Albania'

2733

        SELECT s.Name
        FROM storm s
        INNER JOIN affected_region ar1 ON s.Storm_ID = ar1.Storm_ID
        INNER JOIN region r1 ON ar1.Region_id = r1.Region_id
        INNER JOIN affected_region ar2 ON s.Storm_ID = ar2.Storm_ID
        INNER JOIN region r2 ON ar2.Region_id = r2.Region_id
        WHERE r1.Region_name = 'Afghanistan' AND r2.Region_name = 'Albania';
 SELECT T3.Name FROM affected_region AS T1 JOIN region AS T2 ON T1.region_id  =  T2.region_id JOIN storm AS T3 ON T1.storm_id  =  T3.storm_id WHERE T2.Region_name  =  'Afghanistan' INTERSECT SELECT T3.Name FROM affected_region AS T1 JOIN region AS T2 ON T1.region_id  =  T2.region_id JOIN storm AS T3 ON T1.storm_id  =  T3.storm_id WHERE T2.Region_name  =  'Albania'

2802

        SELECT COUNT(*) FROM journalist;
 SELECT count(*) FROM journalist

2803

        SELECT Name FROM journalist ORDER BY Years_working ASC;
 SELECT Name FROM journalist ORDER BY Years_working ASC

2804

        SELECT Nationality, Age FROM journalist;
 SELECT Nationality ,  Age FROM journalist

2805

        SELECT Name FROM journalist WHERE Nationality IN ('England', 'Wales');
 SELECT Name FROM journalist WHERE Nationality  =  "England" OR Nationality  =  "Wales"

2806

        SELECT AVG(Years_working) FROM journalist;
 SELECT avg(Years_working) FROM journalist

2807

        SELECT Nationality
        FROM journalist
        WHERE Years_working = (SELECT MAX(Years_working) FROM journalist);
 SELECT Nationality FROM journalist ORDER BY Years_working DESC LIMIT 1

2808

        SELECT Nationality, COUNT(*) AS 'Number of Journalists' FROM journalist GROUP BY Nationality;
 SELECT Nationality ,  COUNT(*) FROM journalist GROUP BY Nationality

2809

        SELECT Nationality, COUNT(*) AS Frequency
        FROM journalist
        GROUP BY Nationality
        ORDER BY Frequency DESC
        LIMIT 1;
 SELECT Nationality FROM journalist GROUP BY Nationality ORDER BY COUNT(*) DESC LIMIT 1

2810

        SELECT DISTINCT Nationality
        FROM journalist
        WHERE Years_working > 10 OR Years_working < 3;
 SELECT Nationality FROM journalist WHERE Years_working  >  10 INTERSECT SELECT Nationality FROM journalist WHERE Years_working  <  3

2811

        SELECT Date, Venue, Name FROM event ORDER BY Event_Attendance DESC;
 SELECT Date ,  Name ,  venue FROM event ORDER BY Event_Attendance DESC

2812

        SELECT journalist.Name, event.Date
        FROM journalist
        INNER JOIN news_report ON journalist.journalist_ID = news_report.journalist_ID
        INNER JOIN event ON news_report.Event_ID = event.Event_ID;
 SELECT T3.Name ,  T2.Date FROM news_report AS T1 JOIN event AS T2 ON T1.Event_ID  =  T2.Event_ID JOIN journalist AS T3 ON T1.journalist_ID  =  T3.journalist_ID

2813

        SELECT journalist.Name, event.Name
        FROM journalist
        INNER JOIN news_report
        ON journalist.journalist_ID = news_report.journalist_ID
        INNER JOIN event
        ON news_report.Event_ID = event.Event_ID
        ORDER BY journalist.Name ASC, event.Name ASC;
 SELECT T3.Name ,  T2.Name FROM news_report AS T1 JOIN event AS T2 ON T1.Event_ID  =  T2.Event_ID JOIN journalist AS T3 ON T1.journalist_ID  =  T3.journalist_ID ORDER BY T2.Event_Attendance ASC

2814

        SELECT Name, COUNT(Event_ID) AS Number_of_Events_Reported FROM journalist JOIN news_report ON journalist.journalist_ID = news_report.journalist_ID GROUP BY Name;
 SELECT T3.Name ,  COUNT(*) FROM news_report AS T1 JOIN event AS T2 ON T1.Event_ID  =  T2.Event_ID JOIN journalist AS T3 ON T1.journalist_ID  =  T3.journalist_ID GROUP BY T3.Name

2815

        SELECT Name
        FROM journalist
        WHERE journalist_ID IN (SELECT journalist_ID
                                FROM news_report
                                GROUP BY journalist_ID
                                HAVING COUNT(*) > 1);
 SELECT T3.Name FROM news_report AS T1 JOIN event AS T2 ON T1.Event_ID  =  T2.Event_ID JOIN journalist AS T3 ON T1.journalist_ID  =  T3.journalist_ID GROUP BY T3.Name HAVING COUNT(*)  >  1

2816

        SELECT Name FROM journalist WHERE journalist_ID NOT IN (SELECT journalist_ID FROM news_report);
 SELECT Name FROM journalist WHERE journalist_ID NOT IN (SELECT journalist_ID FROM news_report)

2817

        SELECT AVG(Event_Attendance) AS Average_Attendance, MAX(Event_Attendance) AS Maximum_Attendance FROM event;
 SELECT avg(Event_Attendance) ,  max(Event_Attendance) FROM event

2818

        SELECT AVG(Age) AS Average_Age, AVG(Years_working) AS Average_Experience FROM journalist JOIN news_report ON journalist.journalist_ID = news_report.journalist_ID GROUP BY news_report.Work_Type;
 SELECT avg(t1.age) ,  avg(Years_working) ,  t2.work_type FROM journalist AS t1 JOIN news_report AS t2 ON t1.journalist_id  =  t2.journalist_id GROUP BY t2.work_type

2819

        SELECT Venue, Name FROM event WHERE Event_Attendance IN (SELECT TOP 2 Event_Attendance FROM event ORDER BY Event_Attendance DESC);

 SELECT venue ,  name FROM event ORDER BY Event_Attendance DESC LIMIT 2

3086

        SELECT COUNT(*) FROM Assessment_Notes;
 SELECT count(*) FROM ASSESSMENT_NOTES

3087

        SELECT date_of_notes FROM Assessment_Notes;
 SELECT date_of_notes FROM Assessment_Notes

3088

        SELECT COUNT(*) FROM Addresses WHERE zip_postcode = '197';
 SELECT count(*) FROM ADDRESSES WHERE zip_postcode  =  "197"

3089

        SELECT COUNT(DISTINCT incident_type_code) FROM Ref_Incident_Type;
 SELECT count(DISTINCT incident_type_code) FROM Behavior_Incident

3090

        SELECT DISTINCT detention_type_code FROM Ref_Detention_Type;
 SELECT DISTINCT detention_type_code FROM Detention

3091

        SELECT date_incident_start, date_incident_end FROM Behavior_Incident WHERE incident_type_code = 'NOISE';
 SELECT date_incident_start ,  date_incident_end FROM Behavior_Incident WHERE incident_type_code  =  "NOISE"

3092

        SELECT detention_summary FROM Detention;
 SELECT detention_summary FROM Detention

3093

        SELECT cell_mobile_number, email_address FROM Students;
 SELECT cell_mobile_number ,  email_address FROM STUDENTS

3094

        SELECT email_address FROM Students WHERE first_name = 'Emma' AND last_name = 'Rohan';
 SELECT email_address FROM Students WHERE first_name  =  "Emma" AND last_name  =  "Rohan"

3095

        SELECT COUNT(DISTINCT student_id) FROM Students_in_Detention;
 SELECT count(DISTINCT student_id) FROM Students_in_Detention

3096

        SELECT gender FROM Teachers WHERE last_name = 'Medhurst';
 SELECT gender FROM TEACHERS WHERE last_name  =  "Medhurst"

3097

        SELECT incident_type_description
        FROM Ref_Incident_Type
        WHERE incident_type_code = 'VIOLENCE';
 SELECT incident_type_description FROM Ref_Incident_Type WHERE incident_type_code  =  "VIOLENCE"

3098

        SELECT MAX(monthly_rental) AS Max_Rental, MIN(monthly_rental) AS Min_Rental FROM Student_Addresses;
 SELECT max(monthly_rental) ,  min(monthly_rental) FROM Student_Addresses

3099

        SELECT first_name FROM Teachers WHERE email_address LIKE '%man%';
 SELECT first_name FROM Teachers WHERE email_address LIKE '%man%'

3100

        SELECT * FROM Assessment_Notes ORDER BY date_of_notes ASC;
 SELECT * FROM Assessment_Notes ORDER BY date_of_notes ASC

3101

        SELECT DISTINCT city FROM Addresses ORDER BY city ASC;
 SELECT city FROM Addresses ORDER BY city

3102

        SELECT first_name, last_name FROM Teachers ORDER BY last_name ASC;
 SELECT first_name ,  last_name FROM Teachers ORDER BY last_name

3103

        SELECT * FROM Student_Addresses ORDER BY monthly_rental DESC;
 SELECT * FROM Student_Addresses ORDER BY monthly_rental DESC

3104

        SELECT student_id, first_name
        FROM Students
        WHERE student_id IN (SELECT student_id
                             FROM Assessment_Notes
                             GROUP BY student_id
                             ORDER BY COUNT(*) DESC
                             LIMIT 1)
 SELECT T1.student_id ,  T2.first_name FROM Assessment_Notes AS T1 JOIN Students AS T2 ON T1.student_id  =  T2.student_id GROUP BY T1.student_id ORDER BY count(*) DESC LIMIT 1

3105

        SELECT teacher_id, first_name FROM Teachers
        INNER JOIN Assessment_Notes
        ON Teachers.teacher_id = Assessment_Notes.teacher_id
        GROUP BY teacher_id
        ORDER BY COUNT(*) DESC
        LIMIT 3;
 SELECT T1.teacher_id ,  T2.first_name FROM Assessment_Notes AS T1 JOIN Teachers AS T2 ON T1.teacher_id  =  T2.teacher_id GROUP BY T1.teacher_id ORDER BY count(*) DESC LIMIT 3

3106

        SELECT student_id, last_name
        FROM Students
        INNER JOIN Behavior_Incident
        ON Students.student_id = Behavior_Incident.student_id
        GROUP BY student_id
        ORDER BY COUNT(incident_id) DESC
        LIMIT 1;
 SELECT T1.student_id ,  T2.last_name FROM Behavior_Incident AS T1 JOIN Students AS T2 ON T1.student_id  =  T2.student_id GROUP BY T1.student_id ORDER BY count(*) DESC LIMIT 1

3107

        SELECT teacher_id, last_name
        FROM Teachers
        INNER JOIN Detention ON Teachers.teacher_id = Detention.teacher_id
        WHERE detention_type_code = 'AFTER'
        GROUP BY teacher_id
        ORDER BY COUNT(*) DESC
        LIMIT 1;
 SELECT T1.teacher_id ,  T2.last_name FROM Detention AS T1 JOIN Teachers AS T2 ON T1.teacher_id  =  T2.teacher_id WHERE T1.detention_type_code  =  "AFTER" GROUP BY T1.teacher_id ORDER BY count(*) DESC LIMIT 1

3108

        SELECT student_id, first_name
        FROM Students
        INNER JOIN Student_Addresses ON Students.student_id = Student_Addresses.student_id
        INNER JOIN Addresses ON Student_Addresses.address_id = Addresses.address_id
        GROUP BY student_id
        ORDER BY AVG(monthly_rental) DESC
        LIMIT 1;
 SELECT T1.student_id ,  T2.first_name FROM Student_Addresses AS T1 JOIN Students AS T2 ON T1.student_id  =  T2.student_id GROUP BY T1.student_id ORDER BY AVG(monthly_rental) DESC LIMIT 1

3109

        SELECT address_id, city
        FROM Addresses
        INNER JOIN Student_Addresses
        ON Addresses.address_id = Student_Addresses.address_id
        ORDER BY monthly_rental DESC
        LIMIT 1;
 SELECT T2.address_id ,  T1.city FROM Addresses AS T1 JOIN Student_Addresses AS T2 ON T1.address_id  =  T2.address_id GROUP BY T2.address_id ORDER BY AVG(monthly_rental) DESC LIMIT 1

3110

        SELECT incident_type_code, incident_type_description
        FROM Ref_Incident_Type
        WHERE incident_type_code = (SELECT incident_type_code
                                    FROM Behavior_Incident
                                    GROUP BY incident_type_code
                                    ORDER BY COUNT(*) DESC
                                    LIMIT 1);
 SELECT T1.incident_type_code ,  T2.incident_type_description FROM Behavior_Incident AS T1 JOIN Ref_Incident_Type AS T2 ON T1.incident_type_code  =  T2.incident_type_code GROUP BY T1.incident_type_code ORDER BY count(*) DESC LIMIT 1

3111

        SELECT detention_type_code, detention_type_description
        FROM Ref_Detention_Type
        WHERE detention_type_code = (SELECT detention_type_code
                                     FROM Detention
                                     GROUP BY detention_type_code
                                     ORDER BY COUNT(*) ASC
                                     LIMIT 1);
 SELECT T1.detention_type_code ,  T2.detention_type_description FROM Detention AS T1 JOIN Ref_Detention_Type AS T2 ON T1.detention_type_code  =  T2.detention_type_code GROUP BY T1.detention_type_code ORDER BY count(*) ASC LIMIT 1

3112

        SELECT date_of_notes FROM Assessment_Notes INNER JOIN Students ON Assessment_Notes.student_id = Students.student_id WHERE Students.first_name = 'Fanny';
 SELECT T1.date_of_notes FROM Assessment_Notes AS T1 JOIN Students AS T2 ON T1.student_id  =  T2.student_id WHERE T2.first_name  =  "Fanny"

3113

        SELECT text_of_notes
        FROM Assessment_Notes
        INNER JOIN Teachers
        ON Assessment_Notes.teacher_id = Teachers.teacher_id
        WHERE Teachers.last_name = 'Schuster';
 SELECT T1.text_of_notes FROM Assessment_Notes AS T1 JOIN Teachers AS T2 ON T1.teacher_id  =  T2.teacher_id WHERE T2.last_name  =  "Schuster"

3114

        SELECT date_incident_start, date_incident_end FROM Behavior_Incident INNER JOIN Students ON Behavior_Incident.student_id = Students.student_id WHERE Students.last_name = 'Fahey';
 SELECT T1.date_incident_start ,  date_incident_end FROM Behavior_Incident AS T1 JOIN Students AS T2 ON T1.student_id  =  T2.student_id WHERE T2.last_name  =  "Fahey"

3115

        SELECT datetime_detention_start, datetime_detention_end
        FROM Detention
        INNER JOIN Teachers
        ON Detention.teacher_id = Teachers.teacher_id
        WHERE Teachers.last_name = 'Schultz';
 SELECT T1.datetime_detention_start ,  datetime_detention_end FROM Detention AS T1 JOIN Teachers AS T2 ON T1.teacher_id  =  T2.teacher_id WHERE T2.last_name  =  "Schultz"

3116

        SELECT address_id, zip_postcode FROM Addresses INNER JOIN Student_Addresses ON Addresses.address_id = Student_Addresses.address_id ORDER BY monthly_rental DESC LIMIT 1;

 SELECT T2.address_id ,  T1.zip_postcode FROM Addresses AS T1 JOIN Student_Addresses AS T2 ON T1.address_id  =  T2.address_id ORDER BY monthly_rental DESC LIMIT 1

3117

        SELECT cell_mobile_number
        FROM Students
        INNER JOIN Student_Addresses
        ON Students.student_id = Student_Addresses.student_id
        INNER JOIN Addresses
        ON Student_Addresses.address_id = Addresses.address_id
        ORDER BY monthly_rental ASC
        LIMIT 1;
 SELECT T2.cell_mobile_number FROM Student_Addresses AS T1 JOIN Students AS T2 ON T1.student_id  =  T2.student_id ORDER BY T1.monthly_rental ASC LIMIT 1

3118

        SELECT sa.monthly_rental
        FROM Student_Addresses sa
        JOIN Addresses a ON sa.address_id = a.address_id
        WHERE a.state_province_county = 'Texas';
 SELECT T2.monthly_rental FROM Addresses AS T1 JOIN Student_Addresses AS T2 ON T1.address_id  =  T2.address_id WHERE T1.state_province_county  =  "Texas"

3119

        SELECT first_name, last_name
        FROM Students s
        INNER JOIN Student_Addresses sa ON s.student_id = sa.student_id
        INNER JOIN Addresses a ON sa.address_id = a.address_id
        WHERE a.state_province_county = 'Wisconsin';
 SELECT T2.first_name ,  T2.last_name FROM Addresses AS T1 JOIN Students AS T2 ON T1.address_id  =  T2.address_id WHERE T1.state_province_county  =  "Wisconsin"

3120

        SELECT Addresses.line_1, AVG(Student_Addresses.monthly_rental)
        FROM Addresses
        INNER JOIN Student_Addresses
        ON Addresses.address_id = Student_Addresses.address_id
        GROUP BY Addresses.line_1;
 SELECT T1.line_1 ,  avg(T2.monthly_rental) FROM Addresses AS T1 JOIN Student_Addresses AS T2 ON T1.address_id  =  T2.address_id GROUP BY T2.address_id

3121

        SELECT zip_postcode
        FROM Ref_Address_Types
        INNER JOIN Addresses ON Ref_Address_Types.address_type_code = Addresses.address_type_code
        INNER JOIN Teachers ON Addresses.address_id = Teachers.address_id
        WHERE Teachers.first_name = 'Lyla';
 SELECT T1.zip_postcode FROM Addresses AS T1 JOIN Teachers AS T2 ON T1.address_id  =  T2.address_id WHERE T2.first_name  =  "Lyla"

3122

        SELECT email_address
        FROM Teachers
        INNER JOIN Addresses
        ON Teachers.address_id = Addresses.address_id
        WHERE Addresses.zip_postcode = '918';
 SELECT T2.email_address FROM Addresses AS T1 JOIN Teachers AS T2 ON T1.address_id  =  T2.address_id WHERE T1.zip_postcode  =  "918"

3123

        SELECT COUNT(*) FROM Students WHERE student_id NOT IN (SELECT student_id FROM Behavior_Incident);
 SELECT count(*) FROM STUDENTS WHERE student_id NOT IN ( SELECT student_id FROM Behavior_Incident )

3124

        SELECT last_name FROM Teachers WHERE teacher_id NOT IN (SELECT teacher_id FROM Detention);
 SELECT last_name FROM Teachers EXCEPT SELECT T1.last_name FROM Teachers AS T1 JOIN Detention AS T2 ON T1.teacher_id  =  T2.teacher_id

3125

        SELECT line_1
        FROM Addresses
        INNER JOIN Students_Addresses ON Addresses.address_id = Students_Addresses.address_id
        INNER JOIN Teachers ON Addresses.address_id = Teachers.address_id;
 SELECT T1.line_1 FROM Addresses AS T1 JOIN Students AS T2 ON T1.address_id  =  T2.address_id INTERSECT SELECT T1.line_1 FROM Addresses AS T1 JOIN Teachers AS T2 ON T1.address_id  =  T2.address_id

3389

        SELECT SUM(Num_of_Component) FROM furniture;
 SELECT sum(num_of_component) FROM furniture

3390

        SELECT "Name", "Furniture_ID" FROM "furniture" ORDER BY "Market_Rate" DESC LIMIT 1;
 SELECT name ,  furniture_id FROM furniture ORDER BY market_rate DESC LIMIT 1

3391

        SELECT SUM(Market_Rate)
        FROM furniture
        WHERE Furniture_ID IN (SELECT Furniture_ID
                               FROM furniture_manufacte
                               GROUP BY Furniture_ID
                               ORDER BY SUM(Price_in_Dollar) DESC
                               LIMIT 2);
 SELECT sum(market_rate) FROM furniture ORDER BY market_rate DESC LIMIT 2

3392

        SELECT Name, Num_of_Component FROM furniture WHERE Num_of_Component > 10;
 SELECT Num_of_Component ,  name FROM furniture WHERE Num_of_Component  >  10

3393

        SELECT Name, Num_of_Component FROM furniture ORDER BY Market_Rate ASC LIMIT 1;
 SELECT name ,  Num_of_Component FROM furniture ORDER BY market_rate LIMIT 1

3394

        SELECT Name FROM furniture WHERE Price_in_Dollar < (SELECT MAX(Price_in_Dollar) FROM furniture_manufacte);
 SELECT t1.name FROM furniture AS t1 JOIN furniture_manufacte AS t2 ON t1.Furniture_ID  =  t2.Furniture_ID WHERE t2.Price_in_Dollar  <  (SELECT max(Price_in_Dollar) FROM furniture_manufacte)

3395

        SELECT Name, Open_Year FROM manufacturer WHERE Num_of_Shops = (SELECT MAX(Num_of_Shops) FROM manufacturer);
 SELECT open_year ,  name FROM manufacturer ORDER BY num_of_shops DESC LIMIT 1

3396

        SELECT AVG(Num_of_Factories)
        FROM manufacturer
        WHERE Num_of_Shops > 20;
 SELECT avg(Num_of_Factories) FROM manufacturer WHERE num_of_shops  >  20

3397

        SELECT "Name", "Manufacturer_ID" FROM "manufacturer" ORDER BY "Open_Year" ASC;
 SELECT name ,  manufacturer_id FROM manufacturer ORDER BY open_year

3398

        SELECT Name, Open_Year FROM manufacturer WHERE Num_of_Factories < 10 OR Num_of_Shops > 10;
 SELECT name ,  open_year FROM manufacturer WHERE num_of_shops  >  10 OR Num_of_Factories  <  10

3399

        SELECT AVG(Num_of_Factories), MAX(Num_of_Shops)
        FROM manufacturer
        WHERE Open_Year < 1990;
 SELECT max(num_of_shops) ,  avg(Num_of_Factories) FROM manufacturer WHERE open_year  <  1990

3400

SELECT "Manufacturer_ID", "Num_of_Shops" FROM "manufacturer" WHERE "Manufacturer_ID" = (SELECT "Manufacturer_ID" FROM "furniture_manufacte" WHERE "Price_in_Dollar" = (SELECT MAX("Price_in_Dollar") FROM "furniture_manufacte"));
 SELECT t1.manufacturer_id ,  t1.num_of_shops FROM manufacturer AS t1 JOIN furniture_manufacte AS t2 ON t1.manufacturer_id  =  t2.manufacturer_id ORDER BY t2.Price_in_Dollar DESC LIMIT 1

3401

        SELECT m.Name, COUNT(fm.Furniture_ID) AS Num_of_Furniture_Types
        FROM manufacturer m
        INNER JOIN furniture_manufacte fm
        ON m.Manufacturer_ID = fm.Manufacturer_ID
        GROUP BY m.Name;
 SELECT count(*) ,  t1.name FROM manufacturer AS t1 JOIN furniture_manufacte AS t2 ON t1.manufacturer_id  =  t2.manufacturer_id GROUP BY t1.manufacturer_id

3402

        SELECT Furniture.Name, Furniture_Manufacte.Price_in_Dollar FROM Furniture INNER JOIN Furniture_Manufacte ON Furniture.Furniture_ID = Furniture_Manufacte.Furniture_ID;
 SELECT t1.name ,  t2.price_in_dollar FROM furniture AS t1 JOIN furniture_manufacte AS t2 ON t1.Furniture_ID  =  t2.Furniture_ID

3403

        SELECT Name, Market_Rate FROM furniture WHERE Furniture_ID NOT IN (SELECT Furniture_ID FROM furniture_manufacte);
 SELECT Market_Rate ,  name FROM furniture WHERE Furniture_ID NOT IN (SELECT Furniture_ID FROM furniture_manufacte)

3404

        SELECT m.Name
        FROM manufacturer m
        INNER JOIN furniture_manufacte fm ON m.Manufacturer_ID = fm.Manufacturer_ID
        INNER JOIN furniture f ON fm.Furniture_ID = f.Furniture_ID
        WHERE f.Num_of_Component < 6 OR f.Num_of_Component > 10;
 SELECT t3.name FROM furniture AS t1 JOIN furniture_manufacte AS t2 ON t1.Furniture_ID  =  t2.Furniture_ID JOIN manufacturer AS t3 ON t2.manufacturer_id  =  t3.manufacturer_id WHERE t1.num_of_component  <  6 INTERSECT SELECT t3.name FROM furniture AS t1 JOIN furniture_manufacte AS t2 ON t1.Furniture_ID  =  t2.Furniture_ID JOIN manufacturer AS t3 ON t2.manufacturer_id  =  t3.manufacturer_id WHERE t1.num_of_component  >  10

3529

        SELECT song_name
        FROM song
        ORDER BY releasedate DESC
        LIMIT 1;
 SELECT song_name ,  releasedate FROM song ORDER BY releasedate DESC LIMIT 1

3530

        SELECT song_name
        FROM song
        ORDER BY releasedate DESC
        LIMIT 1;
 SELECT song_name ,  releasedate FROM song ORDER BY releasedate DESC LIMIT 1

3531

        SELECT f_id FROM files ORDER BY duration DESC LIMIT 1;
 SELECT f_id FROM files ORDER BY duration DESC LIMIT 1

3532

        SELECT f_id
        FROM files
        ORDER BY duration DESC
        LIMIT 1;
 SELECT f_id FROM files ORDER BY duration DESC LIMIT 1

3533

        SELECT song_name FROM song WHERE languages = 'English';
 SELECT song_name FROM song WHERE languages  =  "english"

3534

        SELECT song_name FROM song WHERE languages = 'English';
 SELECT song_name FROM song WHERE languages  =  "english"

3535

        SELECT f_id FROM files WHERE formats = 'mp3';
 SELECT f_id FROM files WHERE formats  =  "mp3"

3536

        SELECT f_id FROM files WHERE formats = 'mp3';
 SELECT f_id FROM files WHERE formats  =  "mp3"

3537

        SELECT artist_name, country FROM artist JOIN song ON artist.artist_name = song.artist_name WHERE rating > 9;
 SELECT DISTINCT T1.artist_name ,  T1.country FROM artist AS T1 JOIN song AS T2 ON T1.artist_name  =  T2.artist_name WHERE T2.rating  >  9

3538

        SELECT artist_name, country FROM artist INNER JOIN song ON artist.artist_name = song.artist_name WHERE rating > 9;
 SELECT DISTINCT T1.artist_name ,  T1.country FROM artist AS T1 JOIN song AS T2 ON T1.artist_name  =  T2.artist_name WHERE T2.rating  >  9

3539

        SELECT file_size, formats FROM files JOIN song ON files.f_id = song.f_id WHERE resolution < 800;
 SELECT DISTINCT T1.file_size ,  T1.formats FROM files AS T1 JOIN song AS T2 ON T1.f_id  =  T2.f_id WHERE T2.resolution  <  800

3540

        SELECT file_size, formats FROM files JOIN song ON files.f_id = song.f_id WHERE resolution < 800;
 SELECT DISTINCT T1.file_size ,  T1.formats FROM files AS T1 JOIN song AS T2 ON T1.f_id  =  T2.f_id WHERE T2.resolution  <  800

3541

        SELECT artist_name
        FROM song
        WHERE resolution = (SELECT MIN(resolution) FROM song);
 SELECT T1.artist_name FROM song AS T1 JOIN files AS T2 ON T1.f_id  =  T2.f_id ORDER BY T2.duration LIMIT 1

3542

        SELECT artist_name
        FROM artist
        INNER JOIN song ON artist.artist_name = song.artist_name
        INNER JOIN files ON song.f_id = files.f_id
        ORDER BY duration ASC
        LIMIT 1;
 SELECT T1.artist_name FROM song AS T1 JOIN files AS T2 ON T1.f_id  =  T2.f_id ORDER BY T2.duration LIMIT 1

3543

        SELECT artist_name, country FROM artist INNER JOIN song ON artist.artist_name = song.artist_name WHERE rating IN (SELECT TOP 3 rating FROM song ORDER BY rating DESC) ORDER BY rating DESC;
 SELECT T1.artist_name ,  T1.country FROM artist AS T1 JOIN song AS T2 ON T1.artist_name  =  T2.artist_name ORDER BY T2.rating DESC LIMIT 3

3544

        SELECT artist_name, country
        FROM artist
        INNER JOIN song ON artist.artist_name = song.artist_name
        WHERE rating IN (SELECT TOP 3 rating FROM song ORDER BY rating DESC)
        ORDER BY rating DESC;
 SELECT T1.artist_name ,  T1.country FROM artist AS T1 JOIN song AS T2 ON T1.artist_name  =  T2.artist_name ORDER BY T2.rating DESC LIMIT 3

3545

        SELECT COUNT(*) FROM song WHERE duration = '4 minute';
 SELECT count(*) FROM files WHERE duration LIKE "4:%"

3546

        SELECT COUNT(*) FROM song WHERE duration BETWEEN '3:59' AND '4:01';
 SELECT count(*) FROM files WHERE duration LIKE "4:%"

3547

        SELECT COUNT(*) FROM artist WHERE country = 'Bangladesh';
 SELECT count(*) FROM artist WHERE country  =  "Bangladesh"

3548

        SELECT COUNT(*) FROM artist WHERE country = 'Bangladesh';
 SELECT count(*) FROM artist WHERE country  =  "Bangladesh"

3549

        SELECT AVG(rating)
        FROM song
        JOIN artist ON song.artist_name = artist.artist_name
        WHERE artist.gender = 'female';
 SELECT avg(T2.rating) FROM artist AS T1 JOIN song AS T2 ON T1.artist_name  =  T2.artist_name WHERE T1.gender  =  "Female"

3550

        SELECT AVG(COUNT(s.song_name))
        FROM song s
        INNER JOIN artist a ON s.artist_name = a.artist_name
        WHERE a.gender = 'female';
 SELECT avg(T2.rating) FROM artist AS T1 JOIN song AS T2 ON T1.artist_name  =  T2.artist_name WHERE T1.gender  =  "Female"

3551

        SELECT formats, COUNT(*) AS Popularity
        FROM files
        GROUP BY formats
        ORDER BY Popularity DESC
        LIMIT 1;
 SELECT formats FROM files GROUP BY formats ORDER BY COUNT (*) DESC LIMIT 1

3552

        SELECT formats, COUNT(*) AS num_files
        FROM files
        GROUP BY formats
        ORDER BY num_files DESC
        LIMIT 1;
 SELECT formats FROM files GROUP BY formats ORDER BY COUNT (*) DESC LIMIT 1

3553

        SELECT artist_name
        FROM artist
        INNER JOIN song
        ON artist.artist_name = song.artist_name
        WHERE country = 'UK' AND languages = 'English';
 SELECT artist_name FROM artist WHERE country  =  "UK" INTERSECT SELECT artist_name FROM song WHERE languages  =  "english"

3554

        SELECT artist_name FROM artist WHERE country = 'UK' AND languages = 'English';
 SELECT artist_name FROM artist WHERE country  =  "UK" INTERSECT SELECT artist_name FROM song WHERE languages  =  "english"

3555

        SELECT f_id FROM files WHERE formats = 'mp4' AND resolution < 1000;
 SELECT f_id FROM files WHERE formats  =  "mp4" INTERSECT SELECT f_id FROM song WHERE resolution  <  1000

3556

        SELECT f_id FROM files WHERE formats = 'mp4' AND resolution < 1000;
 SELECT f_id FROM files WHERE formats  =  "mp4" INTERSECT SELECT f_id FROM song WHERE resolution  <  1000

3557

        SELECT country FROM artist JOIN song ON artist.artist_name = song.artist_name WHERE gender = 'female' AND languages = 'Bangla';
 SELECT T1.country FROM artist AS T1 JOIN song AS T2 ON T1.artist_name  =  T2.artist_name WHERE T1.gender  =  "Female" AND T2.languages  =  "bangla"

3558

        SELECT country FROM artist a INNER JOIN song s ON a.artist_name = s.artist_name WHERE a.gender = 'female' AND s.languages = 'Bangla';
 SELECT T1.country FROM artist AS T1 JOIN song AS T2 ON T1.artist_name  =  T2.artist_name WHERE T1.gender  =  "Female" AND T2.languages  =  "bangla"

3559

        SELECT AVG(duration) FROM song s JOIN files f ON s.f_id = f.f_id WHERE formats = 'mp3' AND resolution < 800;
 SELECT avg(T1.duration) FROM files AS T1 JOIN song AS T2 ON T1.f_id  =  T2.f_id WHERE T1.formats  =  "mp3" AND T2.resolution   <  800

3560

        SELECT AVG(duration) FROM song s JOIN files f ON s.f_id = f.f_id WHERE formats = 'mp3' AND resolution < 800;
 SELECT avg(T1.duration) FROM files AS T1 JOIN song AS T2 ON T1.f_id  =  T2.f_id WHERE T1.formats  =  "mp3" AND T2.resolution   <  800

3561

        SELECT gender, COUNT(artist_name) AS Number_of_Artists
        FROM artist
        GROUP BY gender;
 SELECT count(*) ,  gender FROM artist GROUP BY gender

3562

        SELECT COUNT(CASE WHEN gender = 'male' THEN 1 END) AS male_artists, COUNT(CASE WHEN gender = 'female' THEN 1 END) AS female_artists FROM artist;
 SELECT count(*) ,  gender FROM artist GROUP BY gender

3563

        SELECT languages, AVG(rating)
        FROM song
        GROUP BY languages;
 SELECT avg(rating) ,  languages FROM song GROUP BY languages

3564

        SELECT languages, AVG(rating) FROM song GROUP BY languages;
 SELECT avg(rating) ,  languages FROM song GROUP BY languages

3565

        SELECT gender, artist_name FROM artist INNER JOIN song ON artist.artist_name = song.artist_name WHERE resolution = (SELECT MIN(resolution) FROM song);
 SELECT T1.gender ,  T1.artist_name FROM artist AS T1 JOIN song AS T2 ON T1.artist_name  =  T2.artist_name ORDER BY T2.resolution LIMIT 1

3566

        SELECT gender, artist_name FROM artist JOIN song ON artist.artist_name = song.artist_name WHERE resolution = (SELECT MIN(resolution) FROM song);
 SELECT T1.gender ,  T1.artist_name FROM artist AS T1 JOIN song AS T2 ON T1.artist_name  =  T2.artist_name ORDER BY T2.resolution LIMIT 1

3567

        SELECT formats, COUNT(DISTINCT artist_name)
        FROM files
        JOIN song ON files.f_id = song.f_id
        GROUP BY formats;
 SELECT count(*) ,  formats FROM files GROUP BY formats

3568

        SELECT formats, COUNT(*) AS "Number of Songs"
        FROM files
        INNER JOIN song ON files.f_id = song.f_id
        GROUP BY formats;
 SELECT count(*) ,  formats FROM files GROUP BY formats

3569

        SELECT DISTINCT song_name
        FROM song
        WHERE resolution > (SELECT resolution FROM song WHERE languages = 'English')

 SELECT DISTINCT song_name FROM song WHERE resolution  >  (SELECT min(resolution) FROM song WHERE languages  =  "english")

3570

        SELECT song_name FROM song WHERE resolution > (SELECT resolution FROM song WHERE languages = 'English');
 SELECT DISTINCT song_name FROM song WHERE resolution  >  (SELECT min(resolution) FROM song WHERE languages  =  "english")

3571

        SELECT song_name
        FROM song
        WHERE rating < (SELECT rating FROM song WHERE genre_is = 'blues');
 SELECT song_name FROM song WHERE rating  <  (SELECT max(rating) FROM song WHERE genre_is  =  "blues")

3572

        SELECT song_name
        FROM song
        WHERE rating < (SELECT rating FROM song WHERE genre_is = 'blues')
 SELECT song_name FROM song WHERE rating  <  (SELECT max(rating) FROM song WHERE genre_is  =  "blues")

3573

        SELECT artist_name, country FROM artist JOIN song ON artist.artist_name = song.artist_name WHERE song_name LIKE '%love%';
 SELECT T1.artist_name ,  T1.country FROM artist AS T1 JOIN song AS T2 ON T1.artist_name  =  T2.artist_name WHERE T2.song_name LIKE "%love%"

3574

        SELECT artist_name, country FROM artist INNER JOIN song ON artist.artist_name = song.artist_name WHERE song_name LIKE '%love%';
 SELECT T1.artist_name ,  T1.country FROM artist AS T1 JOIN song AS T2 ON T1.artist_name  =  T2.artist_name WHERE T2.song_name LIKE "%love%"

3575

        SELECT artist_name, gender FROM artist INNER JOIN song ON artist.artist_name = song.artist_name WHERE MONTH(releasedate) = 3;
 SELECT T1.artist_name ,  T1.gender FROM artist AS T1 JOIN song AS T2 ON T1.artist_name  =  T2.artist_name WHERE T2.releasedate LIKE "%Mar%"

3576

        SELECT artist_name, gender FROM artist INNER JOIN song ON artist.artist_name = song.artist_name WHERE MONTH(releasedate) = 3;
 SELECT T1.artist_name ,  T1.gender FROM artist AS T1 JOIN song AS T2 ON T1.artist_name  =  T2.artist_name WHERE T2.releasedate LIKE "%Mar%"

3577

        SELECT g_name, rating FROM genre ORDER BY g_name ASC;
 SELECT g_name ,  rating FROM genre ORDER BY g_name

3578

        SELECT g_name, rating FROM genre ORDER BY g_name ASC;
 SELECT g_name ,  rating FROM genre ORDER BY g_name

3579

        SELECT song_name FROM song ORDER BY resolution;
 SELECT song_name FROM song ORDER BY resolution

3580

        SELECT song_name FROM song ORDER BY resolution;
 SELECT song_name FROM song ORDER BY resolution

3581

        SELECT f_id FROM files WHERE formats = 'mp4' OR resolution > 720;
 SELECT f_id FROM files WHERE formats  =  "mp4" UNION SELECT f_id FROM song WHERE resolution  >  720

3582

        SELECT f_id FROM files JOIN song ON files.artist_name = song.artist_name WHERE formats = 'mp4' OR resolution > 720;
 SELECT f_id FROM files WHERE formats  =  "mp4" UNION SELECT f_id FROM song WHERE resolution  >  720

3583

        SELECT song_name FROM song WHERE duration = '4 minutes' OR languages = 'English';
 SELECT T2.song_name FROM files AS T1 JOIN song AS T2 ON T1.f_id  =  T2.f_id WHERE T1.duration LIKE "4:%" UNION SELECT song_name FROM song WHERE languages  =  "english"

3584

        SELECT song_name FROM song WHERE duration LIKE '%4 min%' OR languages = 'English';
 SELECT T2.song_name FROM files AS T1 JOIN song AS T2 ON T1.f_id  =  T2.f_id WHERE T1.duration LIKE "4:%" UNION SELECT song_name FROM song WHERE languages  =  "english"

3585

        SELECT languages, COUNT(*) AS count
        FROM song
        GROUP BY languages
        ORDER BY count DESC
        LIMIT 1;
 SELECT languages FROM song GROUP BY languages ORDER BY count(*) DESC LIMIT 1

3586

        SELECT languages, COUNT(*) AS num_songs
        FROM song
        GROUP BY languages
        ORDER BY num_songs DESC;
 SELECT languages FROM song GROUP BY languages ORDER BY count(*) DESC LIMIT 1

3587

        SELECT languages
        FROM song
        WHERE resolution > 500
        GROUP BY languages
        ORDER BY COUNT(*) DESC
        LIMIT 1;
 SELECT artist_name FROM song WHERE resolution  >  500 GROUP BY languages ORDER BY count(*) DESC LIMIT 1

3588

        SELECT artist_name
        FROM song
        WHERE resolution > 500
        GROUP BY artist_name, languages
        ORDER BY COUNT(*) DESC;
 SELECT artist_name FROM song WHERE resolution  >  500 GROUP BY languages ORDER BY count(*) DESC LIMIT 1

3589

        SELECT artist_name FROM artist WHERE gender = 'Male' AND country = 'UK';
 SELECT artist_name FROM artist WHERE country  =  "UK" AND gender  =  "Male"

3590

        SELECT artist_name FROM artist WHERE gender = 'male' AND country = 'British';
 SELECT artist_name FROM artist WHERE country  =  "UK" AND gender  =  "Male"

3591

        SELECT song_name FROM song WHERE genre_is = 'modern' OR languages = 'English';
 SELECT song_name FROM song WHERE genre_is  =  "modern" OR languages  =  "english"

3592

        SELECT song_name FROM song WHERE genre_is = 'modern' OR languages = 'English';
 SELECT song_name FROM song WHERE genre_is  =  "modern" OR languages  =  "english"

3593

SELECT song_name FROM song JOIN files ON song.artist_name = files.artist_name WHERE formats = 'mp3' AND resolution < 1000;
 SELECT T2.song_name FROM files AS T1 JOIN song AS T2 ON T1.f_id  =  T2.f_id WHERE T1.formats  =  "mp3" INTERSECT SELECT song_name FROM song WHERE resolution  <  1000

3594

        SELECT song_name FROM song JOIN files ON song.artist_name = files.artist_name WHERE formats = 'mp3' AND resolution < 1000;
 SELECT T2.song_name FROM files AS T1 JOIN song AS T2 ON T1.f_id  =  T2.f_id WHERE T1.formats  =  "mp3" INTERSECT SELECT song_name FROM song WHERE resolution  <  1000

3595

        SELECT artist_name
        FROM artist
        INNER JOIN song
        ON artist.artist_name = song.artist_name
        WHERE artist.country = 'UK'
        AND song.languages = 'English';
 SELECT artist_name FROM artist WHERE country  =  "UK" INTERSECT SELECT T1.artist_name FROM artist AS T1 JOIN song AS T2 ON T1.artist_name  =  T2.artist_name WHERE T2.languages  =  "english"

3596

        SELECT artist_name
        FROM artist
        INNER JOIN song
        ON artist.artist_name = song.artist_name
        WHERE country = 'UK' AND languages = 'English';
 SELECT artist_name FROM artist WHERE country  =  "UK" INTERSECT SELECT T1.artist_name FROM artist AS T1 JOIN song AS T2 ON T1.artist_name  =  T2.artist_name WHERE T2.languages  =  "english"

3597

        SELECT AVG(rating), AVG(resolution) FROM song WHERE languages = 'Bangla';
 SELECT avg(rating) ,  avg(resolution) FROM song WHERE languages  =  "bangla"

3598

        SELECT AVG(rating), AVG(resolution) FROM song WHERE languages = 'Bangla';
 SELECT avg(rating) ,  avg(resolution) FROM song WHERE languages  =  "bangla"

3599

        SELECT MAX(resolution), MIN(resolution) FROM song WHERE duration = '3 minutes';
 SELECT max(T2.resolution) ,  min(T2.resolution) FROM files AS T1 JOIN song AS T2 ON T1.f_id  =  T2.f_id WHERE T1.duration LIKE "3:%"

3600

SELECT MAX(resolution), MIN(resolution) FROM song WHERE duration BETWEEN '2:50' AND '3:10';
 SELECT max(T2.resolution) ,  min(T2.resolution) FROM files AS T1 JOIN song AS T2 ON T1.f_id  =  T2.f_id WHERE T1.duration LIKE "3:%"

3601

        SELECT MAX(duration), MAX(resolution) FROM song GROUP BY languages ORDER BY languages;
 SELECT max(T1.duration) ,  max(T2.resolution) ,  T2.languages FROM files AS T1 JOIN song AS T2 ON T1.f_id  =  T2.f_id GROUP BY T2.languages ORDER BY T2.languages

3602

        SELECT languages, MAX(duration) AS Max_Duration, MAX(resolution) AS Max_Resolution
        FROM song
        GROUP BY languages
        ORDER BY languages ASC;
 SELECT max(T1.duration) ,  max(T2.resolution) ,  T2.languages FROM files AS T1 JOIN song AS T2 ON T1.f_id  =  T2.f_id GROUP BY T2.languages ORDER BY T2.languages

3603

        SELECT g_name, MIN(duration) AS shortest_duration, MIN(rating) AS lowest_rating
        FROM song
        JOIN genre ON genre.g_name = song.genre_is
        GROUP BY g_name
        ORDER BY g_name;
 SELECT min(T1.duration) ,  min(T2.rating) ,  T2.genre_is FROM files AS T1 JOIN song AS T2 ON T1.f_id  =  T2.f_id GROUP BY T2.genre_is ORDER BY T2.genre_is

3604

        SELECT g_name, song_name, rating FROM genre g JOIN song s ON g.g_name = s.genre_is WHERE resolution = (SELECT MIN(resolution) FROM song WHERE genre_is = g.g_name) AND rating = (SELECT MIN(rating) FROM song WHERE genre_is = g.g_name) ORDER BY g_name ASC;

 SELECT min(T1.duration) ,  min(T2.rating) ,  T2.genre_is FROM files AS T1 JOIN song AS T2 ON T1.f_id  =  T2.f_id GROUP BY T2.genre_is ORDER BY T2.genre_is

3605

        SELECT artist_name, COUNT(*)
        FROM song
        WHERE languages = 'English'
        GROUP BY artist_name;
 SELECT T1.artist_name ,  count(*) FROM artist AS T1 JOIN song AS T2 ON T1.artist_name  =  T2.artist_name WHERE T2.languages  =  "english" GROUP BY T2.artist_name HAVING count(*)  >=  1

3606

        SELECT artist_name, COUNT(*) AS num_works
        FROM song
        WHERE languages = 'English'
        GROUP BY artist_name;
 SELECT T1.artist_name ,  count(*) FROM artist AS T1 JOIN song AS T2 ON T1.artist_name  =  T2.artist_name WHERE T2.languages  =  "english" GROUP BY T2.artist_name HAVING count(*)  >=  1

3607

        SELECT artist_name, country FROM artist a INNER JOIN song s ON a.artist_name = s.artist_name WHERE resolution > 900;
 SELECT T1.artist_name ,  T1.country FROM artist AS T1 JOIN song AS T2 ON T1.artist_name  =  T2.artist_name WHERE T2.resolution  >  900 GROUP BY T2.artist_name HAVING count(*)  >=  1

3608

        SELECT artist_name, country FROM artist JOIN song ON artist.artist_name = song.artist_name WHERE resolution > 900;
 SELECT T1.artist_name ,  T1.country FROM artist AS T1 JOIN song AS T2 ON T1.artist_name  =  T2.artist_name WHERE T2.resolution  >  900 GROUP BY T2.artist_name HAVING count(*)  >=  1

3609

SELECT artist_name, COUNT(*) AS num_works
FROM song
GROUP BY artist_name
ORDER BY num_works DESC
LIMIT 3;
 SELECT T1.artist_name ,  count(*) FROM artist AS T1 JOIN song AS T2 ON T1.artist_name  =  T2.artist_name GROUP BY T2.artist_name ORDER BY count(*) DESC LIMIT 3

3610

        SELECT artist_name, COUNT(*) AS num_works
        FROM song
        GROUP BY artist_name
        ORDER BY num_works DESC
        LIMIT 3;
 SELECT T1.artist_name ,  count(*) FROM artist AS T1 JOIN song AS T2 ON T1.artist_name  =  T2.artist_name GROUP BY T2.artist_name ORDER BY count(*) DESC LIMIT 3

3611

        SELECT country FROM artist WHERE artist_name = (SELECT artist_name FROM song GROUP BY artist_name ORDER BY COUNT(*) ASC LIMIT 1);
 SELECT T1.country FROM artist AS T1 JOIN song AS T2 ON T1.artist_name  =  T2.artist_name GROUP BY T2.artist_name ORDER BY count(*) LIMIT 1

3612

        SELECT country
        FROM artist
        WHERE artist_name = (SELECT artist_name
                             FROM song
                             GROUP BY artist_name
                             ORDER BY COUNT(*) ASC
                             LIMIT 1);
 SELECT T1.country FROM artist AS T1 JOIN song AS T2 ON T1.artist_name  =  T2.artist_name GROUP BY T2.artist_name ORDER BY count(*) LIMIT 1

3613

        SELECT song_name FROM song WHERE rating < (SELECT MAX(rating) FROM song WHERE languages = 'English');
 SELECT song_name FROM song WHERE rating  <   (SELECT min(rating) FROM song WHERE languages  =  'english')

3614

        SELECT song_name
        FROM song
        WHERE rating < (SELECT MIN(rating) FROM song WHERE languages = 'English');
 SELECT song_name FROM song WHERE rating  <   (SELECT min(rating) FROM song WHERE languages  =  'english')

3615

        SELECT f_id FROM song WHERE resolution > (SELECT resolution FROM song WHERE rating < 8);
 SELECT f_id FROM song WHERE resolution  >  (SELECT max(resolution) FROM song WHERE rating  <  8)

3616

        SELECT f_id FROM song WHERE resolution > (SELECT resolution FROM song WHERE rating < 8);
 SELECT f_id FROM song WHERE resolution  >  (SELECT max(resolution) FROM song WHERE rating  <  8)

3617

        SELECT f_id
        FROM song
        WHERE genre_is = 'modern'
        AND resolution > (SELECT AVG(resolution) FROM song WHERE genre_is = 'modern');
 SELECT f_id FROM song WHERE resolution  >  (SELECT avg(resolution) FROM song WHERE genre_is  =  "modern")

3618

SELECT f_id FROM song WHERE genre_is = 'modern' AND resolution > (SELECT AVG(resolution) FROM song WHERE genre_is = 'modern');
 SELECT f_id FROM song WHERE resolution  >  (SELECT avg(resolution) FROM song WHERE genre_is  =  "modern")

3619

        SELECT artist_name, COUNT(*) AS song_count
        FROM song
        WHERE languages = 'Bangla'
        GROUP BY artist_name
        ORDER BY song_count DESC
        LIMIT 3;
 SELECT T1.artist_name FROM artist AS T1 JOIN song AS T2 ON T1.artist_name  =  T2.artist_name WHERE T2.languages  =  "bangla" GROUP BY T2.artist_name ORDER BY count(*) DESC LIMIT 3

3620

        SELECT artist_name, COUNT(*) AS num_songs
        FROM song
        WHERE languages = 'Bangla'
        GROUP BY artist_name
        ORDER BY num_songs DESC
        LIMIT 3;
 SELECT T1.artist_name FROM artist AS T1 JOIN song AS T2 ON T1.artist_name  =  T2.artist_name WHERE T2.languages  =  "bangla" GROUP BY T2.artist_name ORDER BY count(*) DESC LIMIT 3

3621

        SELECT f_id, genre_is, artist_name
        FROM song
        WHERE languages = 'English'
        ORDER BY rating;
 SELECT f_id ,  genre_is ,  artist_name FROM song WHERE languages  =   "english" ORDER BY rating

3622

        SELECT f_id, genre_is, artist_name
        FROM song
        WHERE languages = 'English'
        ORDER BY rating ASC;
 SELECT f_id ,  genre_is ,  artist_name FROM song WHERE languages  =   "english" ORDER BY rating

3623

        SELECT duration, file_size, formats FROM song JOIN files ON song.f_id = files.f_id WHERE genre_is = 'pop' ORDER BY song_name;
 SELECT T1.duration ,  T1.file_size ,  T1.formats FROM files AS T1 JOIN song AS T2 ON T1.f_id  =  T2.f_id WHERE T2.genre_is  =  "pop" ORDER BY T2.song_name

3624

        SELECT duration, file_size, formats
        FROM song
        INNER JOIN files ON song.f_id = files.f_id
        INNER JOIN genre ON song.genre_is = genre.g_name
        WHERE genre.rating = 'Pop'
        ORDER BY song_name ASC;
 SELECT T1.duration ,  T1.file_size ,  T1.formats FROM files AS T1 JOIN song AS T2 ON T1.f_id  =  T2.f_id WHERE T2.genre_is  =  "pop" ORDER BY T2.song_name

3625

        SELECT artist_name
        FROM artist
        INNER JOIN song ON artist.artist_name = song.artist_name
        WHERE song.languages = 'English' AND song.rating <= 8;
 SELECT DISTINCT artist_name FROM song WHERE languages  =  "english" EXCEPT SELECT DISTINCT artist_name FROM song WHERE rating  >  8

3626

        SELECT artist_name
        FROM artist
        INNER JOIN song
        ON artist.artist_name = song.artist_name
        WHERE song.languages = 'English'
        AND song.rating <= 8;
 SELECT DISTINCT artist_name FROM song WHERE languages  =  "english" EXCEPT SELECT DISTINCT artist_name FROM song WHERE rating  >  8

3627

        SELECT artist_name
        FROM artist
        WHERE country = 'Bangladesh'
        AND NOT EXISTS (SELECT *
                        FROM song
                        WHERE artist_name = artist.artist_name
                        AND rating > 7);
 SELECT DISTINCT artist_name FROM artist WHERE country  =  "Bangladesh" EXCEPT SELECT DISTINCT artist_name FROM song WHERE rating  >  7

3628

        SELECT artist_name
        FROM artist
        INNER JOIN song
        ON artist.artist_name = song.artist_name
        INNER JOIN genre
        ON song.genre_is = genre.g_name
        WHERE country = 'Bangladesh'
        AND rating <= 7;
 SELECT DISTINCT artist_name FROM artist WHERE country  =  "Bangladesh" EXCEPT SELECT DISTINCT artist_name FROM song WHERE rating  >  7

4583

        SELECT COUNT(Product_ID) FROM Products;
 SELECT count(*) FROM Products

4584

        SELECT Product_Name FROM Products ORDER BY Product_Price ASC;
 SELECT Product_Name FROM Products ORDER BY Product_Price ASC

4585

        SELECT Product_Name, Product_Type_Code FROM Products;
 SELECT Product_Name ,  Product_Type_Code FROM Products

4586

        SELECT Product_Price FROM Products WHERE Product_Name IN ('Dining', 'Trading Policy');
 SELECT Product_Price FROM Products WHERE Product_Name  =  "Dining" OR Product_Name  =  "Trading Policy"

4587

        SELECT AVG(Product_Price) FROM Products;
 SELECT avg(Product_Price) FROM Products

4588

        SELECT Product_Name FROM Products WHERE Product_Price = (SELECT MAX(Product_Price) FROM Products);

 SELECT Product_Name FROM Products ORDER BY Product_Price DESC LIMIT 1

4589

        SELECT Product_Type_Code, COUNT(Product_Type_Code) FROM Products GROUP BY Product_Type_Code;
 SELECT Product_Type_Code ,  COUNT(*) FROM Products GROUP BY Product_Type_Code

4590

        SELECT Product_Type_Code, COUNT(*) AS Frequency
        FROM Products
        GROUP BY Product_Type_Code
        ORDER BY Frequency DESC
        LIMIT 1;
 SELECT Product_Type_Code FROM Products GROUP BY Product_Type_Code ORDER BY COUNT(*) DESC LIMIT 1

4591

        SELECT Product_Type_Code
        FROM Products
        GROUP BY Product_Type_Code
        HAVING COUNT(Product_ID) >= 2;
 SELECT Product_Type_Code FROM Products GROUP BY Product_Type_Code HAVING COUNT(*)  >=  2

4592

        SELECT Product_Type_Code
        FROM Products
        WHERE Product_Price > 4500 OR Product_Price < 3000;
 SELECT Product_Type_Code FROM Products WHERE Product_Price  >  4500 INTERSECT SELECT Product_Type_Code FROM Products WHERE Product_Price  <  3000

4593

        SELECT Product_Name, COUNT(Product_in_Event_ID)
        FROM Products
        INNER JOIN Products_in_Events
        ON Products.Product_ID = Products_in_Events.Product_ID
        GROUP BY Product_Name;
 SELECT T1.Product_Name ,  COUNT(*) FROM Products AS T1 JOIN Products_in_Events AS T2 ON T1.Product_ID  =  T2.Product_ID GROUP BY T1.Product_Name

4594

        SELECT Product_Name, COUNT(Product_in_Event_ID) AS Num_Events
        FROM Products
        INNER JOIN Products_in_Events
        ON Products.Product_ID = Products_in_Events.Product_ID
        GROUP BY Product_Name
        ORDER BY Num_Events DESC;
 SELECT T1.Product_Name ,  COUNT(*) FROM Products AS T1 JOIN Products_in_Events AS T2 ON T1.Product_ID  =  T2.Product_ID GROUP BY T1.Product_Name ORDER BY COUNT(*) DESC

4595

        SELECT Product_Name
        FROM Products
        WHERE Product_ID IN (SELECT Product_ID
                             FROM Products_in_Events
                             GROUP BY Product_ID
                             HAVING COUNT(*) >= 2);
 SELECT T1.Product_Name FROM Products AS T1 JOIN Products_in_Events AS T2 ON T1.Product_ID  =  T2.Product_ID GROUP BY T1.Product_Name HAVING COUNT(*)  >=  2

4596

        SELECT Product_Name
        FROM Products
        WHERE Product_ID IN (SELECT Product_ID
                             FROM Products_in_Events
                             GROUP BY Product_ID
                             HAVING COUNT(*) >= 2)
        ORDER BY Product_Name ASC;
 SELECT T1.Product_Name FROM Products AS T1 JOIN Products_in_Events AS T2 ON T1.Product_ID  =  T2.Product_ID GROUP BY T1.Product_Name HAVING COUNT(*)  >=  2 ORDER BY T1.Product_Name

4597

        SELECT Product_Name
        FROM Products
        WHERE Product_ID NOT IN (SELECT Product_ID FROM Products_in_Events);
 SELECT Product_Name FROM Products WHERE Product_ID NOT IN (SELECT Product_ID FROM Products_in_Events)

4598

        SELECT COUNT(*) FROM artwork;
 SELECT count(*) FROM artwork

4599

        SELECT Name FROM artwork ORDER BY Name ASC;
 SELECT Name FROM artwork ORDER BY Name ASC

4600

        SELECT Name FROM artwork WHERE Type != 'Program Talent Show';
 SELECT Name FROM artwork WHERE TYPE != "Program Talent Show"

4601

        SELECT Festival_Name, Location FROM festival_detail;
 SELECT Festival_Name ,  LOCATION FROM festival_detail

4602

        SELECT Chair_Name FROM festival_detail ORDER BY Year ASC;
 SELECT Chair_Name FROM festival_detail ORDER BY YEAR ASC

4603

        SELECT Location
        FROM festival_detail
        WHERE Num_of_Audience = (SELECT MAX(Num_of_Audience) FROM festival_detail);
 SELECT LOCATION FROM festival_detail ORDER BY Num_of_Audience DESC LIMIT 1

4604

        SELECT Festival_Name FROM festival_detail WHERE Year = 2007;
 SELECT Festival_Name FROM festival_detail WHERE YEAR  =  2007

4605

        SELECT AVG(Num_of_Audience) FROM festival_detail;
 SELECT avg(Num_of_Audience) FROM festival_detail

4606

        SELECT Festival_Name FROM festival_detail WHERE Year IN (SELECT MAX(Year) FROM festival_detail ORDER BY Year DESC LIMIT 3);
 SELECT Festival_Name FROM festival_detail ORDER BY YEAR DESC LIMIT 3

4607

        SELECT artwork.Name, festival_detail.Festival_Name FROM artwork INNER JOIN nomination ON artwork.Artwork_ID = nomination.Artwork_ID INNER JOIN festival_detail ON nomination.Festival_ID = festival_detail.Festival_ID;
 SELECT T2.Name ,  T3.Festival_Name FROM nomination AS T1 JOIN artwork AS T2 ON T1.Artwork_ID  =  T2.Artwork_ID JOIN festival_detail AS T3 ON T1.Festival_ID  =  T3.Festival_ID

4608

        SELECT DISTINCT Type FROM artwork INNER JOIN nomination ON artwork.Artwork_ID = nomination.Artwork_ID INNER JOIN festival_detail ON nomination.Festival_ID = festival_detail.Festival_ID WHERE Year = 2007;
 SELECT DISTINCT T2.Type FROM nomination AS T1 JOIN artwork AS T2 ON T1.Artwork_ID  =  T2.Artwork_ID JOIN festival_detail AS T3 ON T1.Festival_ID  =  T3.Festival_ID WHERE T3.Year  =  2007

4609

        SELECT Name FROM artwork INNER JOIN nomination ON artwork.Artwork_ID = nomination.Artwork_ID INNER JOIN festival_detail ON nomination.Festival_ID = festival_detail.Festival_ID ORDER BY Year ASC;
 SELECT T2.Name FROM nomination AS T1 JOIN artwork AS T2 ON T1.Artwork_ID  =  T2.Artwork_ID JOIN festival_detail AS T3 ON T1.Festival_ID  =  T3.Festival_ID ORDER BY T3.Year

4610

        SELECT Festival_Name
        FROM festival_detail
        INNER JOIN nomination
        ON festival_detail.Festival_ID = nomination.Festival_ID
        INNER JOIN artwork
        ON nomination.Artwork_ID = artwork.Artwork_ID
        WHERE artwork.Type = 'Program Talent Show';
 SELECT T3.Festival_Name FROM nomination AS T1 JOIN artwork AS T2 ON T1.Artwork_ID  =  T2.Artwork_ID JOIN festival_detail AS T3 ON T1.Festival_ID  =  T3.Festival_ID WHERE T2.Type  =  "Program Talent Show"

4611

        SELECT "Festival_ID", "Festival_Name"
        FROM "festival_detail"
        WHERE "Festival_ID" IN (SELECT "Festival_ID"
                                FROM nomination
                                GROUP BY "Festival_ID"
                                HAVING COUNT(*) >= 2);
 SELECT T1.Festival_ID ,  T3.Festival_Name FROM nomination AS T1 JOIN artwork AS T2 ON T1.Artwork_ID  =  T2.Artwork_ID JOIN festival_detail AS T3 ON T1.Festival_ID  =  T3.Festival_ID GROUP BY T1.Festival_ID HAVING COUNT(*)  >=  2

4612

        SELECT fd.Festival_ID, fd.Festival_Name, COUNT(n.Artwork_ID) AS Num_of_Nominated_Artworks
        FROM festival_detail fd
        LEFT JOIN nomination n
        ON fd.Festival_ID = n.Festival_ID
        GROUP BY fd.Festival_ID, fd.Festival_Name;
 SELECT T1.Festival_ID ,  T3.Festival_Name ,  COUNT(*) FROM nomination AS T1 JOIN artwork AS T2 ON T1.Artwork_ID  =  T2.Artwork_ID JOIN festival_detail AS T3 ON T1.Festival_ID  =  T3.Festival_ID GROUP BY T1.Festival_ID

4613

        SELECT Type, COUNT(*) AS Num_of_Artworks FROM artwork GROUP BY Type;
 SELECT TYPE ,  COUNT(*) FROM artwork GROUP BY TYPE

4614

        SELECT Type, COUNT(*) AS Count
        FROM artwork
        GROUP BY Type
        ORDER BY Count DESC
        LIMIT 1;
 SELECT TYPE FROM artwork GROUP BY TYPE ORDER BY COUNT(*) DESC LIMIT 1

4615

        SELECT Year
        FROM festival_detail
        GROUP BY Year
        HAVING COUNT(*) > 1;
 SELECT YEAR FROM festival_detail GROUP BY YEAR HAVING COUNT(*)  >  1

4616

        SELECT Name FROM artwork WHERE Artwork_ID NOT IN (SELECT Artwork_ID FROM nomination);
 SELECT Name FROM Artwork WHERE Artwork_ID NOT IN (SELECT Artwork_ID FROM nomination)

4617

        SELECT SUM(Num_of_Audience)
        FROM festival_detail
        WHERE Year IN (2008, 2010);
 SELECT Num_of_Audience FROM festival_detail WHERE YEAR  =  2008 OR YEAR  =  2010

4618

        SELECT SUM(Num_of_Audience) FROM festival_detail;
 SELECT sum(Num_of_Audience) FROM festival_detail

4619

        SELECT Year FROM festival_detail WHERE Location IN ('United States', 'Outside United States');
 SELECT YEAR FROM festival_detail WHERE LOCATION  =  'United States' INTERSECT SELECT YEAR FROM festival_detail WHERE LOCATION != 'United States'

5090

        SELECT COUNT(*) FROM Bookings;

 SELECT count(*) FROM BOOKINGS

5091

        SELECT COUNT(*) FROM Bookings;
 SELECT count(*) FROM BOOKINGS

5092

        SELECT Order_Date FROM Bookings;
 SELECT Order_Date FROM BOOKINGS

5093

        SELECT Order_Date FROM Bookings;
 SELECT Order_Date FROM BOOKINGS

5094

        SELECT Planned_Delivery_Date, Actual_Delivery_Date FROM Bookings;
 SELECT Planned_Delivery_Date ,  Actual_Delivery_Date FROM BOOKINGS

5095

        SELECT Bookings.Planned_Delivery_Date, Bookings.Actual_Delivery_Date FROM Bookings;
 SELECT Planned_Delivery_Date ,  Actual_Delivery_Date FROM BOOKINGS

5096

        SELECT COUNT(*) FROM Customers;
 SELECT count(*) FROM CUSTOMERS

5097

        SELECT COUNT(*) FROM Customers;
 SELECT count(*) FROM CUSTOMERS

5098

        SELECT Customer_Phone, Customer_Email_Address
        FROM Customers
        WHERE Customer_Name = 'Harold';
 SELECT Customer_Phone ,  Customer_Email_Address FROM CUSTOMERS WHERE Customer_Name  =  "Harold"

5099

        SELECT Customer_Phone, Customer_Email_Address FROM Customers WHERE Customer_Name = 'Harold';
 SELECT Customer_Phone ,  Customer_Email_Address FROM CUSTOMERS WHERE Customer_Name  =  "Harold"

5100

        SELECT Store_Name FROM Drama_Workshop_Groups;
 SELECT Store_Name FROM Drama_Workshop_Groups

5101

        SELECT Store_Name FROM Drama_Workshop_Groups;
 SELECT Store_Name FROM Drama_Workshop_Groups

5102

        SELECT MIN(Order_Quantity) AS Min_Order_Quantity, AVG(Order_Quantity) AS Avg_Order_Quantity, MAX(Order_Quantity) AS Max_Order_Quantity FROM Invoice_Items;
 SELECT min(Order_Quantity) ,  avg(Order_Quantity) ,  max(Order_Quantity) FROM INVOICES

5103

SELECT MIN(Order_Quantity) AS Min_Quantity, AVG(Order_Quantity) AS Avg_Quantity, MAX(Order_Quantity) AS Max_Quantity FROM Invoices INNER JOIN Invoice_Items ON Invoices.Invoice_ID = Invoice_Items.Invoice_ID;
 SELECT min(Order_Quantity) ,  avg(Order_Quantity) ,  max(Order_Quantity) FROM INVOICES

5104

        SELECT DISTINCT payment_method_code FROM Invoices;
 SELECT DISTINCT payment_method_code FROM INVOICES

5105

        SELECT DISTINCT payment_method_code FROM Invoices;
 SELECT DISTINCT payment_method_code FROM INVOICES

5106

        SELECT Marketing_Region_Descriptrion
        FROM Marketing_Regions
        WHERE Marketing_Region_Name = 'China';
 SELECT Marketing_Region_Descriptrion FROM Marketing_Regions WHERE Marketing_Region_Name  =  "China"

5107

        SELECT Marketing_Region_Descriptrion
        FROM Marketing_Regions
        WHERE Marketing_Region_Name = 'China';
 SELECT Marketing_Region_Descriptrion FROM Marketing_Regions WHERE Marketing_Region_Name  =  "China"

5108

        SELECT DISTINCT Product_Name, Product_Price
        FROM Products
        WHERE Product_Price > (SELECT AVG(Product_Price) FROM Products);
 SELECT DISTINCT Product_Name FROM PRODUCTS WHERE Product_Price  >  (SELECT avg(Product_Price) FROM PRODUCTS)

5109

        SELECT DISTINCT Product_Name
        FROM Products
        WHERE Product_Price > (SELECT AVG(Product_Price) FROM Products);
 SELECT DISTINCT Product_Name FROM PRODUCTS WHERE Product_Price  >  (SELECT avg(Product_Price) FROM PRODUCTS)

5110

        SELECT Product_Name FROM Products ORDER BY Product_Price DESC LIMIT 1;
 SELECT Product_Name FROM PRODUCTS ORDER BY Product_Price DESC LIMIT 1

5111

        SELECT Product_Name FROM Products ORDER BY Product_Price DESC LIMIT 1;
 SELECT Product_Name FROM PRODUCTS ORDER BY Product_Price DESC LIMIT 1

5112

        SELECT Product_Name, Product_Price FROM Products ORDER BY Product_Price ASC;
 SELECT Product_Name FROM Products ORDER BY Product_Price ASC

5113

        SELECT Product_Name FROM Products ORDER BY Product_Price ASC;
 SELECT Product_Name FROM Products ORDER BY Product_Price ASC

5114

        SELECT Customer_Phone
        FROM Performers
        INNER JOIN Addresses
        ON Performers.Address_ID = Addresses.Address_ID
        WHERE Customer_Name = 'Ashley';
 SELECT Customer_Phone FROM PERFORMERS WHERE Customer_Name  =  "Ashley"

5115

        SELECT Customer_Phone
        FROM Performers
        INNER JOIN Addresses
        ON Performers.Address_ID = Addresses.Address_ID
        WHERE Customer_Name = 'Ashley';
 SELECT Customer_Phone FROM PERFORMERS WHERE Customer_Name  =  "Ashley"

5116

        SELECT payment_method_code, COUNT(Order_ID) AS Number_of_Orders
        FROM Ref_Payment_Methods
        INNER JOIN Invoices
        ON Ref_Payment_Methods.payment_method_code = Invoices.payment_method_code
        GROUP BY payment_method_code;
 SELECT payment_method_code ,  count(*) FROM INVOICES GROUP BY payment_method_code

5117

        SELECT payment_method_code, COUNT(DISTINCT Order_ID) AS 'Number of Orders' FROM Invoices GROUP BY payment_method_code;
 SELECT payment_method_code ,  count(*) FROM INVOICES GROUP BY payment_method_code

5118

        SELECT payment_method_code, COUNT(payment_method_code) AS num_orders
        FROM Invoices
        GROUP BY payment_method_code
        ORDER BY num_orders DESC
        LIMIT 1;
 SELECT payment_method_code FROM INVOICES GROUP BY payment_method_code ORDER BY count(*) DESC LIMIT 1

5119

        SELECT payment_method_code, COUNT(payment_method_code) AS count
        FROM Invoices
        GROUP BY payment_method_code
        ORDER BY count DESC
        LIMIT 1;
 SELECT payment_method_code FROM INVOICES GROUP BY payment_method_code ORDER BY count(*) DESC LIMIT 1

5120

        SELECT City_Town
        FROM Addresses
        INNER JOIN Stores
        ON Addresses.Address_ID = Stores.Address_ID
        WHERE Store_Name = 'FJA Filming';
 SELECT T1.City_Town FROM Addresses AS T1 JOIN Stores AS T2 ON T1.Address_ID  =  T2.Address_ID WHERE T2.Store_Name  =  "FJA Filming"

5121

        SELECT City_Town
        FROM Stores
        INNER JOIN Addresses
        ON Stores.Address_ID = Addresses.Address_ID
        WHERE Store_Name = 'FJA Filming';
 SELECT T1.City_Town FROM Addresses AS T1 JOIN Stores AS T2 ON T1.Address_ID  =  T2.Address_ID WHERE T2.Store_Name  =  "FJA Filming"

5122

        SELECT State_County FROM Addresses a INNER JOIN Stores s ON a.Address_ID = s.Address_ID WHERE s.Marketing_Region_Code = 'CA';
 SELECT T1.State_County FROM Addresses AS T1 JOIN Stores AS T2 ON T1.Address_ID  =  T2.Address_ID WHERE T2.Marketing_Region_Code  =  "CA"

5123

        SELECT State_County FROM Addresses a INNER JOIN Stores s ON a.Address_ID = s.Address_ID WHERE s.Marketing_Region_Code = 'CA';
 SELECT T1.State_County FROM Addresses AS T1 JOIN Stores AS T2 ON T1.Address_ID  =  T2.Address_ID WHERE T2.Marketing_Region_Code  =  "CA"

5124

        SELECT Marketing_Region_Name
        FROM Stores
        INNER JOIN Marketing_Regions
        ON Stores.Marketing_Region_Code = Marketing_Regions.Marketing_Region_Code
        WHERE Store_Name = 'Rob Dinning';
 SELECT T1.Marketing_Region_Name FROM Marketing_Regions AS T1 JOIN Stores AS T2 ON T1.Marketing_Region_Code  =  T2.Marketing_Region_Code WHERE T2.Store_Name  =  "Rob Dinning"

5125

        SELECT Marketing_Region_Name
        FROM Stores
        INNER JOIN Marketing_Regions
        ON Stores.Marketing_Region_Code = Marketing_Regions.Marketing_Region_Code
        WHERE Store_Name = 'Rob Dinning';
 SELECT T1.Marketing_Region_Name FROM Marketing_Regions AS T1 JOIN Stores AS T2 ON T1.Marketing_Region_Code  =  T2.Marketing_Region_Code WHERE T2.Store_Name  =  "Rob Dinning"

5126

        SELECT Service_Type_Description
        FROM Ref_Service_Types
        INNER JOIN Services
        ON Ref_Service_Types.Service_Type_Code = Services.Service_Type_Code
        WHERE Product_Price > 100;
 SELECT T1.Service_Type_Description FROM Ref_Service_Types AS T1 JOIN Services AS T2 ON T1.Service_Type_Code  =  T2.Service_Type_Code WHERE T2.Product_Price  >  100

5127

        SELECT Service_Type_Description
        FROM Ref_Service_Types
        INNER JOIN Services
        ON Ref_Service_Types.Service_Type_Code = Services.Service_Type_Code
        WHERE Product_Price > 100;
 SELECT T1.Service_Type_Description FROM Ref_Service_Types AS T1 JOIN Services AS T2 ON T1.Service_Type_Code  =  T2.Service_Type_Code WHERE T2.Product_Price  >  100

5128

        SELECT Service_Type_Code, Service_Type_Description, COUNT(*) FROM Ref_Service_Types GROUP BY Service_Type_Code, Service_Type_Description;
 SELECT T1.Service_Type_Description ,  T2.Service_Type_Code ,  COUNT(*) FROM Ref_Service_Types AS T1 JOIN Services AS T2 ON T1.Service_Type_Code  =  T2.Service_Type_Code GROUP BY T2.Service_Type_Code

5129

        SELECT Service_Type_Description, Service_Type_Code, COUNT(Service_ID) AS Number_of_Services FROM Ref_Service_Types INNER JOIN Services ON Ref_Service_Types.Service_Type_Code = Services.Service_Type_Code GROUP BY Service_Type_Description, Service_Type_Code;
 SELECT T1.Service_Type_Description ,  T2.Service_Type_Code ,  COUNT(*) FROM Ref_Service_Types AS T1 JOIN Services AS T2 ON T1.Service_Type_Code  =  T2.Service_Type_Code GROUP BY T2.Service_Type_Code

5130

        SELECT Service_Type_Description, Service_Type_Code
        FROM Ref_Service_Types
        INNER JOIN Services
        ON Ref_Service_Types.Service_Type_Code = Services.Service_Type_Code
        GROUP BY Service_Type_Description, Service_Type_Code
        ORDER BY COUNT(*) DESC
        LIMIT 1;
 SELECT T1.Service_Type_Description , T1.Service_Type_Code FROM Ref_Service_Types AS T1 JOIN Services AS T2 ON T1.Service_Type_Code  =  T2.Service_Type_Code GROUP BY T1.Service_Type_Code ORDER BY COUNT(*) DESC LIMIT 1

5131

        SELECT Service_Type_Description, Service_Type_Code
        FROM Ref_Service_Types
        INNER JOIN Services ON Ref_Service_Types.Service_Type_Code = Services.Service_Type_Code
        INNER JOIN Bookings_Services ON Services.Service_ID = Bookings_Services.Product_ID
        GROUP BY Service_Type_Description, Service_Type_Code
        ORDER BY COUNT(*) DESC
        LIMIT 1;
 SELECT T1.Service_Type_Description , T1.Service_Type_Code FROM Ref_Service_Types AS T1 JOIN Services AS T2 ON T1.Service_Type_Code  =  T2.Service_Type_Code GROUP BY T1.Service_Type_Code ORDER BY COUNT(*) DESC LIMIT 1

5132

        SELECT Store_Phone, Store_Email_Address
        FROM Stores
        INNER JOIN Drama_Workshop_Groups ON Stores.Store_ID = Drama_Workshop_Groups.Workshop_Group_ID
        INNER JOIN Bookings_Services ON Drama_Workshop_Groups.Workshop_Group_ID = Bookings_Services.Order_ID;
 SELECT T1.Store_Phone ,  T1.Store_Email_Address FROM Drama_Workshop_Groups AS T1 JOIN Services AS T2 ON T1.Workshop_Group_ID  =  T2.Workshop_Group_ID

5133

        SELECT Store_Phone, Store_Email_Address
        FROM Stores
        INNER JOIN Drama_Workshop_Groups ON Stores.Store_ID = Drama_Workshop_Groups.Workshop_Group_ID
        INNER JOIN Bookings_Services ON Drama_Workshop_Groups.Workshop_Group_ID = Bookings_Services.Order_ID;
 SELECT T1.Store_Phone ,  T1.Store_Email_Address FROM Drama_Workshop_Groups AS T1 JOIN Services AS T2 ON T1.Workshop_Group_ID  =  T2.Workshop_Group_ID

5134

        SELECT Workshop_Group_Name
        FROM Drama_Workshop_Groups
        INNER JOIN Services
        ON Drama_Workshop_Groups.Workshop_Group_ID = Services.Workshop_Group_ID
        WHERE Product_Name = 'film';
 SELECT T1.Store_Phone ,  T1.Store_Email_Address FROM Drama_Workshop_Groups AS T1 JOIN Services AS T2 ON T1.Workshop_Group_ID  =  T2.Workshop_Group_ID WHERE T2.Product_Name  =  "film"

5135

        SELECT Workshop_Group_ID
        FROM Services
        INNER JOIN Drama_Workshop_Groups
        ON Services.Workshop_Group_ID = Drama_Workshop_Groups.Workshop_Group_ID
        WHERE Product_Name = 'film';
 SELECT T1.Store_Phone ,  T1.Store_Email_Address FROM Drama_Workshop_Groups AS T1 JOIN Services AS T2 ON T1.Workshop_Group_ID  =  T2.Workshop_Group_ID WHERE T2.Product_Name  =  "film"

5136

        SELECT Product_Name, AVG(Product_Price) FROM Products GROUP BY Product_Name;
 SELECT Product_Name ,  avg(Product_Price) FROM PRODUCTS GROUP BY Product_Name

5137

        SELECT Product_Name, AVG(Product_Price) FROM Products GROUP BY Product_Name;
 SELECT Product_Name ,  avg(Product_Price) FROM PRODUCTS GROUP BY Product_Name

5138

        SELECT Product_Name, AVG(Product_Price) AS Average_Product_Price
        FROM Products
        GROUP BY Product_Name
        HAVING Average_Product_Price < 1000000;
 SELECT Product_Name FROM PRODUCTS GROUP BY Product_Name HAVING avg(Product_Price)  <  1000000

5139

        SELECT Product_Name
        FROM Products
        WHERE Product_Price < 1000000
        GROUP BY Product_Name
        HAVING AVG(Product_Price) < 1000000;
 SELECT Product_Name FROM PRODUCTS GROUP BY Product_Name HAVING avg(Product_Price)  <  1000000

5140

        SELECT SUM(Order_Quantity) FROM Order_Items WHERE Product_ID IN (SELECT Product_ID FROM Products WHERE Product_Name LIKE '%photo%');
 SELECT sum(T1.Order_Quantity) FROM ORDER_ITEMS AS T1 JOIN Products AS T2 ON T1.Product_ID  =  T2.Product_ID WHERE T2.Product_Name  =  "photo"

5141

        SELECT SUM(Order_Quantity) FROM Order_Items WHERE Product_ID = 'photo';
 SELECT sum(T1.Order_Quantity) FROM ORDER_ITEMS AS T1 JOIN Products AS T2 ON T1.Product_ID  =  T2.Product_ID WHERE T2.Product_Name  =  "photo"

5142

        SELECT Order_ID, Order_Date, Planned_Delivery_Date, Actual_Delivery_Date, Other_Order_Details
        FROM Customer_Orders
        INNER JOIN Order_Items ON Customer_Orders.Order_ID = Order_Items.Order_ID
        INNER JOIN Products ON Order_Items.Product_ID = Products.Product_ID
        WHERE Products.Product_Price > 2000;
 SELECT T1.Other_Item_Details FROM ORDER_ITEMS AS T1 JOIN Products AS T2 ON T1.Product_ID  =  T2.Product_ID WHERE T2.Product_price  >  2000

5143

        SELECT Order_ID, Product_ID, Order_Quantity, Other_Item_Details
        FROM Order_Items
        INNER JOIN Products
        ON Order_Items.Product_ID = Products.Product_ID
        WHERE Products.Product_Price > 2000;
 SELECT T1.Other_Item_Details FROM ORDER_ITEMS AS T1 JOIN Products AS T2 ON T1.Product_ID  =  T2.Product_ID WHERE T2.Product_price  >  2000

5144

        SELECT Actual_Delivery_Date
        FROM Customer_Orders
        INNER JOIN Order_Items
        ON Customer_Orders.Order_ID = Order_Items.Order_ID
        WHERE Order_Quantity = 1;
 SELECT T1.Actual_Delivery_Date FROM Customer_Orders AS T1 JOIN ORDER_ITEMS AS T2 ON T1.Order_ID  =  T2.Order_ID WHERE T2.Order_Quantity  =  1

5145

        SELECT Actual_Delivery_Date FROM Customer_Orders WHERE Order_Quantity = 1;
 SELECT T1.Actual_Delivery_Date FROM Customer_Orders AS T1 JOIN ORDER_ITEMS AS T2 ON T1.Order_ID  =  T2.Order_ID WHERE T2.Order_Quantity  =  1

5146

        SELECT Order_Date
        FROM Customer_Orders
        JOIN Order_Items ON Customer_Orders.Order_ID = Order_Items.Order_ID
        JOIN Products ON Order_Items.Product_ID = Products.Product_ID
        WHERE Products.Product_Price > 1000;
 SELECT T1.Order_Date FROM Customer_Orders AS T1 JOIN ORDER_ITEMS AS T2 ON T1.Order_ID  =  T2.Order_ID JOIN Products AS T3 ON T2.Product_ID  =  T3.Product_ID WHERE T3.Product_price  >  1000

5147

        SELECT Order_Date
        FROM Customer_Orders
        INNER JOIN Order_Items
        ON Customer_Orders.Order_ID = Order_Items.Order_ID
        INNER JOIN Products
        ON Order_Items.Product_ID = Products.Product_ID
        WHERE Products.Product_Price > 1000;
 SELECT T1.Order_Date FROM Customer_Orders AS T1 JOIN ORDER_ITEMS AS T2 ON T1.Order_ID  =  T2.Order_ID JOIN Products AS T3 ON T2.Product_ID  =  T3.Product_ID WHERE T3.Product_price  >  1000

5148

        SELECT COUNT(DISTINCT Currency_Code) FROM Drama_Workshop_Groups;
 SELECT count(DISTINCT Currency_Code) FROM Drama_Workshop_Groups

5149

        SELECT COUNT(DISTINCT Currency_Code) FROM Drama_Workshop_Groups;
 SELECT count(DISTINCT Currency_Code) FROM Drama_Workshop_Groups

5150

        SELECT Workshop_Group_Name
        FROM Drama_Workshop_Groups
        INNER JOIN Addresses
        ON Drama_Workshop_Groups.Address_ID = Addresses.Address_ID
        WHERE City_Town = 'Feliciaberg';
 SELECT T2.Store_Name FROM Addresses AS T1 JOIN Drama_Workshop_Groups AS T2 ON T1.Address_ID  =  T2.Address_ID WHERE T1.City_Town  =  "Feliciaberg"

5151

        SELECT Store_Name
        FROM Drama_Workshop_Groups
        INNER JOIN Addresses
        ON Drama_Workshop_Groups.Address_ID = Addresses.Address_ID
        WHERE City_Town = 'Feliciaberg';

 SELECT T2.Store_Name FROM Addresses AS T1 JOIN Drama_Workshop_Groups AS T2 ON T1.Address_ID  =  T2.Address_ID WHERE T1.City_Town  =  "Feliciaberg"

5152

        SELECT Store_Email_Address
        FROM Drama_Workshop_Groups
        INNER JOIN Addresses
        ON Drama_Workshop_Groups.Address_ID = Addresses.Address_ID
        WHERE State_County = 'Alaska';
 SELECT T2.Store_Email_Address FROM Addresses AS T1 JOIN Drama_Workshop_Groups AS T2 ON T1.Address_ID  =  T2.Address_ID WHERE T1.State_County  =  "Alaska"

5153

        SELECT Store_Email_Address
        FROM Drama_Workshop_Groups
        INNER JOIN Addresses
        ON Drama_Workshop_Groups.Address_ID = Addresses.Address_ID
        WHERE State_County = 'Alaska';
 SELECT T2.Store_Email_Address FROM Addresses AS T1 JOIN Drama_Workshop_Groups AS T2 ON T1.Address_ID  =  T2.Address_ID WHERE T1.State_County  =  "Alaska"

5154

        SELECT City_Town, COUNT(*) AS 'Number of Drama Workshop Groups'
        FROM Addresses
        INNER JOIN Drama_Workshop_Groups
        ON Addresses.Address_ID = Drama_Workshop_Groups.Address_ID
        GROUP BY City_Town;
 SELECT T1.City_Town ,  count(*) FROM Addresses AS T1 JOIN Drama_Workshop_Groups AS T2 ON T1.Address_ID  =  T2.Address_ID GROUP BY T1.City_Town

5155

        SELECT City_Town, COUNT(*) FROM Addresses
        INNER JOIN Drama_Workshop_Groups
        ON Addresses.Address_ID = Drama_Workshop_Groups.Address_ID
        GROUP BY City_Town;
 SELECT T1.City_Town ,  count(*) FROM Addresses AS T1 JOIN Drama_Workshop_Groups AS T2 ON T1.Address_ID  =  T2.Address_ID GROUP BY T1.City_Town

5156

        SELECT Marketing_Region_Code
        FROM Drama_Workshop_Groups
        GROUP BY Marketing_Region_Code
        ORDER BY COUNT(*) DESC
        LIMIT 1;
 SELECT Marketing_Region_Code FROM Drama_Workshop_Groups GROUP BY Marketing_Region_Code ORDER BY count(*) DESC LIMIT 1

5157

        SELECT Marketing_Region_Code
        FROM Marketing_Regions
        INNER JOIN Drama_Workshop_Groups
        ON Marketing_Regions.Marketing_Region_Code = Drama_Workshop_Groups.Marketing_Region_Code
        GROUP BY Marketing_Region_Code
        ORDER BY COUNT(*) DESC
        LIMIT 1;
 SELECT Marketing_Region_Code FROM Drama_Workshop_Groups GROUP BY Marketing_Region_Code ORDER BY count(*) DESC LIMIT 1

5158

        SELECT DISTINCT City_Town
        FROM Addresses
        WHERE Address_ID IN (SELECT Address_ID FROM Clients)
        AND City_Town NOT IN (SELECT City_Town FROM Addresses WHERE Address_ID IN (SELECT Address_ID FROM Performers));
 SELECT T1.City_Town FROM Addresses AS T1 JOIN Customers AS T2 ON T1.Address_ID  =  T2.Address_ID EXCEPT SELECT T1.City_Town FROM Addresses AS T1 JOIN Performers AS T2 ON T1.Address_ID  =  T2.Address_ID

5159

        SELECT DISTINCT City_Town
        FROM Addresses
        WHERE Address_ID IN (SELECT Address_ID FROM Customers)
        AND Address_ID NOT IN (SELECT Address_ID FROM Performers);
 SELECT T1.City_Town FROM Addresses AS T1 JOIN Customers AS T2 ON T1.Address_ID  =  T2.Address_ID EXCEPT SELECT T1.City_Town FROM Addresses AS T1 JOIN Performers AS T2 ON T1.Address_ID  =  T2.Address_ID

5160

        SELECT Status_Code, COUNT(*) AS Frequency
        FROM Bookings
        GROUP BY Status_Code
        ORDER BY Frequency DESC
        LIMIT 1;
 SELECT Status_Code FROM BOOKINGS GROUP BY Status_Code ORDER BY count(*) DESC LIMIT 1

5161

        SELECT Status_Code, COUNT(*) AS Num_Bookings
        FROM Bookings
        GROUP BY Status_Code
        ORDER BY Num_Bookings DESC
        LIMIT 1;
 SELECT Status_Code FROM BOOKINGS GROUP BY Status_Code ORDER BY count(*) DESC LIMIT 1

5162

        SELECT Workshop_Group_Name
        FROM Drama_Workshop_Groups
        INNER JOIN Bookings
        ON Drama_Workshop_Groups.Workshop_Group_ID = Bookings.Workshop_Group_ID
        WHERE Bookings.Status_Code = 'stop';
 SELECT T2.Store_Name FROM Bookings AS T1 JOIN Drama_Workshop_Groups AS T2 ON T1.Workshop_Group_ID  =  T2.Workshop_Group_ID WHERE T1.Status_Code  =  "stop"

5163

        SELECT DISTINCT Marketing_Region_Name
        FROM Drama_Workshop_Groups
        INNER JOIN Bookings
        ON Drama_Workshop_Groups.Workshop_Group_ID = Bookings.Workshop_Group_ID
        WHERE Bookings.Status_Code = 'stop';
 SELECT T2.Store_Name FROM Bookings AS T1 JOIN Drama_Workshop_Groups AS T2 ON T1.Workshop_Group_ID  =  T2.Workshop_Group_ID WHERE T1.Status_Code  =  "stop"

5164

        SELECT Customer_Name FROM Clients WHERE Client_ID NOT IN (SELECT Customer_ID FROM Bookings);
 SELECT Customer_Name FROM Clients EXCEPT SELECT T2.Customer_Name FROM Bookings AS T1 JOIN Clients AS T2 ON T1.Customer_ID  =  T2.Client_ID

5165

        SELECT Customer_Name
        FROM Clients
        WHERE Client_ID NOT IN (SELECT Customer_ID FROM Bookings);
 SELECT Customer_Name FROM Clients EXCEPT SELECT T2.Customer_Name FROM Bookings AS T1 JOIN Clients AS T2 ON T1.Customer_ID  =  T2.Client_ID

5166

        SELECT AVG(Order_Quantity) FROM Invoices INNER JOIN Customer_Orders ON Invoices.Order_ID = Customer_Orders.Order_ID WHERE payment_method_code = 'MasterCard';
 SELECT avg(Order_Quantity) FROM Invoices WHERE payment_method_code  =  "MasterCard"

5167

        SELECT AVG(Order_Quantity) FROM Invoices INNER JOIN Order_Items ON Invoices.Order_ID = Order_Items.Order_ID WHERE payment_method_code = 'MasterCard';
 SELECT avg(Order_Quantity) FROM Invoices WHERE payment_method_code  =  "MasterCard"

5168

        SELECT Product_ID
        FROM Invoice_Items
        GROUP BY Product_ID
        ORDER BY COUNT(Product_ID) DESC
        LIMIT 1;
 SELECT Product_ID FROM INVOICES GROUP BY Product_ID ORDER BY COUNT(*) DESC LIMIT 1

5169

        SELECT Product_ID, COUNT(*) AS Order_Count
        FROM Invoice_Items
        GROUP BY Product_ID
        ORDER BY Order_Count DESC
        LIMIT 1;
 SELECT Product_ID FROM INVOICES GROUP BY Product_ID ORDER BY COUNT(*) DESC LIMIT 1

5170

        SELECT Service_Type_Description
        FROM Ref_Service_Types
        WHERE Service_Type_Code IN (SELECT Service_Type_Code
                                    FROM Services
                                    WHERE Product_Name IN ('Photo Product', 'Film Product'));
 SELECT T1.Service_Type_Description FROM Ref_Service_Types AS T1 JOIN Services AS T2 ON T1.Service_Type_Code  =  T2.Service_Type_Code WHERE T2.Product_Name  =  'photo' INTERSECT SELECT T1.Service_Type_Description FROM Ref_Service_Types AS T1 JOIN Services AS T2 ON T1.Service_Type_Code  =  T2.Service_Type_Code WHERE T2.Product_Name  =  'film'

5171

        SELECT Service_Type_Description
        FROM Ref_Service_Types
        INNER JOIN Products
        ON Ref_Service_Types.Service_Type_Code = Products.Product_ID
        WHERE Product_Name = 'photo' OR Product_Name = 'film';
 SELECT T1.Service_Type_Description FROM Ref_Service_Types AS T1 JOIN Services AS T2 ON T1.Service_Type_Code  =  T2.Service_Type_Code WHERE T2.Product_Name  =  'photo' INTERSECT SELECT T1.Service_Type_Description FROM Ref_Service_Types AS T1 JOIN Services AS T2 ON T1.Service_Type_Code  =  T2.Service_Type_Code WHERE T2.Product_Name  =  'film'

5400

        SELECT COUNT(*) FROM branch WHERE membership_amount > (SELECT AVG(membership_amount) FROM branch);
 SELECT count(*) FROM branch WHERE membership_amount  >  (SELECT avg(membership_amount) FROM branch)

5401

        SELECT COUNT(*) FROM branch WHERE membership_amount > (SELECT AVG(membership_amount) FROM branch);
 SELECT count(*) FROM branch WHERE membership_amount  >  (SELECT avg(membership_amount) FROM branch)

5402

        SELECT Name, Address_road, City FROM branch ORDER BY Open_year;
 SELECT name ,  address_road ,  city FROM branch ORDER BY open_year

5403

        SELECT Name, Address_road, City FROM branch ORDER BY Open_year;
 SELECT name ,  address_road ,  city FROM branch ORDER BY open_year

5404

        SELECT Name, membership_amount
        FROM branch
        ORDER BY membership_amount DESC
        LIMIT 3;
 SELECT name FROM branch ORDER BY membership_amount DESC LIMIT 3

5405

        SELECT Name
        FROM branch
        WHERE Branch_ID IN (SELECT Branch_ID
                            FROM membership_register_branch
                            GROUP BY Branch_ID
                            ORDER BY COUNT(*) DESC
                            LIMIT 3);

 SELECT name FROM branch ORDER BY membership_amount DESC LIMIT 3

5406

        SELECT DISTINCT City FROM branch WHERE membership_amount >= 100;
 SELECT DISTINCT city FROM branch WHERE membership_amount  >=  100

5407

        SELECT City
        FROM branch
        WHERE membership_amount > 100;
 SELECT DISTINCT city FROM branch WHERE membership_amount  >=  100

5408

        SELECT Open_year
        FROM branch
        GROUP BY Open_year
        HAVING COUNT(*) >= 2;
 SELECT open_year FROM branch GROUP BY open_year HAVING count(*)  >=  2

5409

        SELECT Open_year
        FROM branch
        GROUP BY Open_year
        HAVING COUNT(*) >= 2;
 SELECT open_year FROM branch GROUP BY open_year HAVING count(*)  >=  2

5410

        SELECT MIN(membership_amount), MAX(membership_amount) FROM branch WHERE Open_year = '2011' OR City = 'London';
 SELECT min(membership_amount) ,  max(membership_amount) FROM branch WHERE open_year  =  2011 OR city  =  'London'

5411

        SELECT MIN(membership_amount), MAX(membership_amount)
        FROM branch
        WHERE Open_year = '2011' OR City = 'London';
 SELECT min(membership_amount) ,  max(membership_amount) FROM branch WHERE open_year  =  2011 OR city  =  'London'

5412

        SELECT City, COUNT(*) AS 'Number of Branches Opened Before 2010' FROM branch WHERE Open_year < '2010' GROUP BY City;
 SELECT city ,  count(*) FROM branch WHERE open_year  <  2010 GROUP BY city

5413

        SELECT City, COUNT(*) AS 'Number of Branches Opened Before 2010' FROM branch WHERE Open_year < '2010' GROUP BY City;
 SELECT city ,  count(*) FROM branch WHERE open_year  <  2010 GROUP BY city

5414

        SELECT COUNT(DISTINCT Level) FROM member;
 SELECT count(DISTINCT LEVEL) FROM member

5415

        SELECT DISTINCT Level FROM member;
 SELECT count(DISTINCT LEVEL) FROM member

5416

        SELECT Card_Number, Name, Hometown FROM member ORDER BY Level DESC;
 SELECT card_number ,  name ,  hometown FROM member ORDER BY LEVEL DESC

5417

        SELECT Card_Number, Name, Hometown FROM member ORDER BY Level DESC;
 SELECT card_number ,  name ,  hometown FROM member ORDER BY LEVEL DESC

5418

SELECT Level, COUNT(*) AS Num_Members
FROM member
GROUP BY Level
ORDER BY Num_Members DESC
LIMIT 1;
 SELECT LEVEL FROM member GROUP BY LEVEL ORDER BY count(*) DESC LIMIT 1

5419

        SELECT Level, COUNT(*) AS Total_Members
        FROM member
        GROUP BY Level
        ORDER BY Total_Members DESC
        LIMIT 1;
 SELECT LEVEL FROM member GROUP BY LEVEL ORDER BY count(*) DESC LIMIT 1

5420

        SELECT m.Name, b.Name, mrb.Register_Year
        FROM member m
        INNER JOIN membership_register_branch mrb ON m.Member_ID = mrb.Member_ID
        INNER JOIN branch b ON mrb.Branch_ID = b.Branch_ID
        ORDER BY mrb.Register_Year;
 SELECT T3.name ,  T2.name FROM membership_register_branch AS T1 JOIN branch AS T2 ON T1.branch_id  =  T2.branch_id JOIN member AS T3 ON T1.member_id  =  T3.member_id ORDER BY T1.register_year

5421

        SELECT m.Name, b.Name, mrb.Register_Year
        FROM member m
        INNER JOIN membership_register_branch mrb
        ON m.Member_ID = mrb.Member_ID
        INNER JOIN branch b
        ON mrb.Branch_ID = b.Branch_ID
        ORDER BY mrb.Register_Year;
 SELECT T3.name ,  T2.name FROM membership_register_branch AS T1 JOIN branch AS T2 ON T1.branch_id  =  T2.branch_id JOIN member AS T3 ON T1.member_id  =  T3.member_id ORDER BY T1.register_year

5422

        SELECT b.Name, COUNT(mrb.Member_ID) AS 'Number of Members'
        FROM branch b
        LEFT JOIN membership_register_branch mrb
        ON b.Branch_ID = mrb.Branch_ID
        WHERE mrb.Register_Year > '2015'
        GROUP BY b.Name;
 SELECT T2.name ,  count(*) FROM membership_register_branch AS T1 JOIN branch AS T2 ON T1.branch_id  =  T2.branch_id WHERE T1.register_year  >  2015 GROUP BY T2.branch_id

5423

        SELECT b.Branch_ID, b.Name
        FROM branch b
        INNER JOIN membership_register_branch mrb
        ON b.Branch_ID = mrb.Branch_ID
        WHERE mrb.Register_Year > '2015';
 SELECT T2.name ,  count(*) FROM membership_register_branch AS T1 JOIN branch AS T2 ON T1.branch_id  =  T2.branch_id WHERE T1.register_year  >  2015 GROUP BY T2.branch_id

5424

        SELECT Name FROM member WHERE Member_ID NOT IN (SELECT Member_ID FROM membership_register_branch);
 SELECT name FROM member WHERE member_id NOT IN (SELECT member_id FROM membership_register_branch)

5425

        SELECT Name FROM member WHERE Member_ID NOT IN (SELECT Member_ID FROM membership_register_branch);
 SELECT name FROM member WHERE member_id NOT IN (SELECT member_id FROM membership_register_branch)

5426

        SELECT Name, City FROM branch WHERE Branch_ID NOT IN (SELECT Branch_ID FROM membership_register_branch);
 SELECT name ,  city FROM branch WHERE branch_id NOT IN (SELECT branch_id FROM membership_register_branch)

5427

        SELECT Name, City FROM branch WHERE Branch_ID NOT IN (SELECT Branch_ID FROM membership_register_branch);
 SELECT name ,  city FROM branch WHERE branch_id NOT IN (SELECT branch_id FROM membership_register_branch)

5428

        SELECT Name, Open_year FROM branch WHERE Branch_ID = (SELECT Branch_ID FROM membership_register_branch WHERE Register_Year = '2016' ORDER BY COUNT(*) DESC LIMIT 1);
 SELECT T2.name ,  T2.open_year FROM membership_register_branch AS T1 JOIN branch AS T2 ON T1.branch_id  =  T2.branch_id WHERE T1.register_year  =  2016 GROUP BY T2.branch_id ORDER BY count(*) DESC LIMIT 1

5429

APIConnectionError: Error communicating with OpenAI: ('Connection aborted.', RemoteDisconnected('Remote end closed connection without response'))

In [135]:
len(data)

748

In [136]:
data[0]

'\n        SELECT catalog_entry_name FROM Catalog_Contents;'

In [143]:
df_long[['open_ai_prompt', 'open_ai_completion', 'model_response']].to_csv('davinci-completions.csv')

In [137]:
for i in range(len(data)):
    df_long.iloc[i]['model_response'] = data[i]

In [71]:
df_long = df_long.dropna()

In [138]:
df_long.shape

(1056, 12)

In [73]:
df_long[df_long['model_response'] != ''].shape

(42, 12)

In [74]:
len(data)

42

In [87]:
i = 50
print(df_long[df_long['model_response'] != ''].iloc[i]['open_ai_prompt'] + '\n')
print(df_long[df_long['model_response'] != ''].iloc[i]['open_ai_completion'])
print(df_long[df_long['model_response'] != ''].iloc[i]['model_response'])

IndexError: single positional indexer is out-of-bounds

In [144]:
# ignore: 
# - whitespace
# - capitalization
# - trailing semicolons
# - the difference between single and double quotes
# - difference between 'distinct(...)' and 'distinct ...'
# - explictly stating ASC (the ORDER BY default)
tmp = df_long[df_long['model_response'] != ''].copy()

tmp['correct'] = np.where(tmp['open_ai_completion'].str
                                                                         .strip()
                                                                         .str
                                                                         .lower()
                                                                         .apply(lambda x: re.sub("distinct\((.*)\)", "distinct\\1", 
                                                                                          re.sub('orderby(.*)asc', 'orderby\\1',
                                                                                          re.sub('"', "'",
                                                                                          re.sub('\s+', '', x))))
                                                                                .rstrip(';')) == 
                                     tmp['model_response'].str
                                                                     .strip()
                                                                     .str
                                                                     .lower()
                                                                         .apply(lambda x: re.sub("distinct\((.*)\)", "distinct\\1", 
                                                                                          re.sub('orderby(.*)asc', 'orderby\\1',
                                                                                          re.sub('"', "'",
                                                                                          re.sub('\s+', '', x))))
                                                                            .rstrip(';')), 1, 0)
tmp['correct'].mean()

0.32219251336898397

In [154]:
i = 50
print(tmp[tmp['correct'] == 0]['open_ai_prompt'].iloc[i])
print(tmp[tmp['correct'] == 0]['open_ai_completion'].iloc[i])
print(tmp[tmp['correct'] == 0]['model_response'].iloc[i])

        Convert text to SQL.
        You have the following DDLs:
        ```
        CREATE TABLE Customers (Customer_ID INTEGER ,Customer_name VARCHAR(40),PRIMARY KEY (Customer_ID));CREATE TABLE Services (Service_ID INTEGER ,Service_name VARCHAR(40),PRIMARY KEY (Service_ID));CREATE TABLE Available_Policies (Policy_ID INTEGER ,policy_type_code CHAR(15),Customer_Phone VARCHAR(255),PRIMARY KEY (Policy_ID),UNIQUE (Policy_ID));CREATE TABLE Customers_Policies (Customer_ID INTEGER ,Policy_ID INTEGER ,Date_Opened DATE,Date_Closed DATE,PRIMARY KEY (Customer_ID, Policy_ID),FOREIGN KEY (Customer_ID);CREATE TABLE First_Notification_of_Loss (FNOL_ID INTEGER ,Customer_ID INTEGER ,Policy_ID INTEGER ,Service_ID INTEGER ,PRIMARY KEY (FNOL_ID),UNIQUE (FNOL_ID),FOREIGN KEY (Service_ID);CREATE TABLE Claims (Claim_ID INTEGER ,FNOL_ID INTEGER ,Effective_Date DATE,PRIMARY KEY (Claim_ID),UNIQUE (Claim_ID),FOREIGN KEY (FNOL_ID);CREATE TABLE Settlements (Settlement_ID INTEGER ,Claim_ID INTEGER,Effective_Date DATE,Settlement_Amount REAL,PRIMARY KEY (Settlement_ID),UNIQUE (Settlement_ID),FOREIGN KEY (Claim_ID);
        ```
        Write the SQL that answers the following question:
        """Find the names of users who do not have a first notification of loss record."""
        Respond with only one concise SQL statement.

 SELECT customer_name FROM customers EXCEPT SELECT t1.customer_name FROM customers AS t1 JOIN first_notification_of_loss AS t2 ON t1.customer_id  =  t2.customer_id


        SELECT Customer_name
        FROM Customers
        WHERE Customer_ID NOT IN (SELECT Customer_ID FROM First_Notification_of_Loss);